{"bloodline": "Aberrant","description": "There is a taint in your blood, one that is alien and bizarre. You tend to think in odd ways, approaching problems from an angle that most would not expect. Over time, this taint manifests itself in your physical form.","class skill": "Knowledge (dungeoneering)","bonus spells": "enlarge person (3rd), see invisibility (5th), tongues (7th), black tentacles (9th), feeblemind (11th), veil (13th), plane shift (15th), mind blank (17th), shapechange (19th)","bonus feats": "Combat Casting, Improved Disarm, Improved Grapple, Improved Initiative, Improved Unarmed Strike, Iron Will, Silent Spell, Skill Focus (Knowledge [dungeoneering])","bloodline arcana": "Whenever you cast a spell of the polymorph subschool, increase the duration of the spell by 50% (minimum 1 round). This bonus does not stack with the increase granted by the Extend Spell feat.","bloodline powers": "Aberrant sorcerers show increasing signs of their tainted heritage as they increase in level, although they are only visible when used.\\n\\nAcidic Ray (Sp): Starting at 1st level, you can fire an acidic ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. The acidic ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nLong Limbs (Ex): At 3rd level, your reach increases by 5 feet whenever you are making a melee touch attack. This ability does not otherwise increase your threatened area. At 11th level, this bonus to your reach increases to 10 feet. At 17th level, this bonus to your reach increases to 15 feet.\\n\\nUnusual Anatomy (Ex): At 9th level, your anatomy changes, giving you a 25% chance to ignore any critical hit or sneak attack scored against you. This chance increases to 50% at 13th level.\\n\\nAlien Resistance (Su): At 15th level, you gain spell resistance equal to your sorcerer level + 10.\\n\\nAberrant Form (Ex): At 20th level, your body becomes truly unnatural. You are immune to critical hits and sneak attacks. In addition, you gain blindsight with a range of 60 feet and damage reduction 5/-."},
{"bloodline": "Abyssal","description": "Generations ago, a demon spread its filth into your heritage. While it does not manifest in all of your kin, for you it is particularly strong. You might sometimes have urges to chaos or evil, but your destiny (and alignment) is up to you.","class skill": "Knowledge (planes)","bonus spells": "cause fear (3rd), bull's strength (5th), rage (7th), stoneskin (9th), dismissal (11th), transformation (13th), greater teleport (15th), unholy aura (17th), summon monster IX (19th)","bonus feats": "Augment Summoning, Cleave, Empower Spell, Great Fortitude, Improved Bull Rush, Improved Sunder, Power Attack, Skill Focus (Knowledge [planes])","bloodline arcana": "Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/good equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.","bloodline powers": "While some would say that you are possessed, you know better. The demonic influence in your blood grows as you gain power.\\n\\nClaws (Su): At 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. These attacks deal 1d4 points of damage each (1d3 if you are Small) plus your Strength modifier. At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws become flaming weapons, each dealing an additional 1d6 points of fire damage on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.\\n\\nDemon Resistances (Ex): At 3rd level, you gain resist electricity 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to electricity increases to 10 and your bonus on poison saving throws increases to +4.\\n\\nStrength of the Abyss (Ex): At 9th level, you gain a +2 inherent bonus to your Strength. This bonus increases to +4 at 13th level, and to +6 at 17th level.\\n\\nAdded Summonings (Su): At 15th level, whenever you summon a creature with the demon subtype or the fiendish template using a summon monster spell, you summon one additional creature of the same kind.\\n\\nDemonic Might (Su): At 20th level, the power of the Abyss flows through you. You gain immunity to electricity and poison. You also gain resistance to acid 10, cold 10, and fire 10, and gain telepathy with a range of 60 feet (allowing you to communicate with any creature that can speak a language)."},
{"bloodline": "Arcane","description": "Your family has always been skilled in the eldritch art of magic. While many of your relatives were accomplished wizards, your powers developed without the need for study and practice.","class skill": "Knowledge (any one)","bonus spells": "identify (3rd), invisibility (5th), dispel magic (7th), dimension door (9th), overland flight (11th), true seeing (13th), greater teleport (15th), power word stun (17th), wish (19th)","bonus feats": "Combat Casting, Improved Counterspell, Improved Initiative, Iron Will, Scribe Scroll, Skill Focus (Knowledge [arcana]), Spell Focus, Still Spell","bloodline arcana": "Whenever you apply a metamagic feat to a spell that increases the slot used by at least one level, increase the spell's DC by +1. This bonus does not stack with itself and does not apply to spells modified by the Heighten Spell feat.","bloodline powers": "Magic comes naturally to you, but as you gain levels you must take care to prevent the power from overwhelming you.\\n\\nArcane Bond (Su): At 1st level, you gain an arcane bond, as a wizard equal to your sorcerer level. Your sorcerer levels stack with any wizard levels you possess when determining the powers of your familiar or bonded object. This ability does not allow you to have both a familiar and a bonded item. Once per day, your bond item allows you to cast any one of our spells known (unlike a wizard's bonded item, which allows him to cast any one spell in his spellbook).\\n\\nMetamagic Adept (Ex): At 3rd level, you can apply any one metamagic feat you know to a spell you are about to cast without increasing the casting time. You must still expend a higher-level spell slot to cast this spell. You can use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 19th level. At 20th level, this ability is replaced by arcane apotheosis.\\n\\nNew Arcana (Ex): At 9th level, you can add any one spell from the sorcerer/wizard spell list to your list of spells known. This spell must be of a level that you are capable of casting. You can also add one additional spell at 13th level and 17th level.\\n\\nSchool Power (Ex): At 15th level, pick one school of magic. The DC for any spells you cast from that school increases by +2. This bonus stacks with the bonus granted by Spell Focus.\\n\\nArcane Apotheosis (Ex): At 20th level, your body surges with arcane power. You can add any metamagic feats that you know to your spells without increasing their casting time, although you must still expend higher-level spell slots. Whenever you use magic items that require charges, you can instead expend spell slots to power the item. For every three levels of spell slots that you expend, you consume one less charge when using a magic item that expends charges."},
{"bloodline": "Celestial","description": "Your bloodline is blessed by a celestial power, either from a celestial ancestor or through divine intervention. Although this power drives you along the path of good, your fate (and alignment) is your own to determine.","class skill": "Heal","bonus spells": "bless (3rd), resist energy (5th), magic circle against evil (7th), remove curse (9th), flame strike (11th), greater dispel magic (13th), banishment (15th), sunburst (17th), gate (19th)","bonus feats": "Dodge, Extend Spell, Iron Will, Mobility, Mounted Combat, Ride-By Attack, Skill Focus (Knowledge [religion]), Weapon Finesse","bloodline arcana": "Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/evil equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.","bloodline powers": "Your celestial heritage grants you a great many powers, but they come at a price. The lords of the higher planes are watching you and your actions closely.\\n\\nHeavenly Fire (Sp): Starting at 1st level, you can unleash a ray of heavenly fire as a standard action, targeting any foe within 30 feet as a ranged touch attack. Against evil creatures, this ray deals 1d4 points of damage + 1 for every two sorcerer levels you possess. This damage is divine and not subject to energy resistance or immunity. This ray heals good creatures of 1d4 points of damage + 1 for every two sorcerer levels you possess. A good creature cannot benefit from your heavenly fire more than once per day. Neutral creatures are neither harmed nor healed by this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nCelestial Resistances (Ex): At 3rd level, you gain resist acid 5 and resist cold 5. At 9th level, your resistances increase to 10.\\n\\nWings of Heaven (Su): At 9th level, you can sprout feathery wings and fly for a number of minutes per day equal to your sorcerer level, with a speed of 60 feet and good maneuverability. This duration does not need to be consecutive, but it must be used in 1 minute increments.\\n\\nConviction (Su): At 15th level, you can reroll any one ability check, attack roll, skill check, or saving throw you just made. You must decide to use this ability after the die is rolled, but before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability once per day.\\n\\nAscension (Su): At 20th level, you become infused with the power of the heavens. You gain immunity to acid, cold, and petrification. You also gain resist electricity 10, resist fire 10, and a +4 racial bonus on saves against poison. Finally, you gain unlimited use of the wings of heaven ability. Finally, you gain the ability to speak with any creature that has a language (as per the tongues spell)."},
{"bloodline": "Destined","description": "Your family is destined for greatness in some way. Your birth could have been foretold in prophecy, or perhaps it occurred during an especially auspicious event, such as a solar eclipse. Regardless of your bloodline's origin, you have a great future ahead.","class skill": "Knowledge (history)","bonus spells": "alarm (3rd), blur (5th), protection from energy (7th), freedom of movement (9th), break enchantment (11th), mislead (13th), spell turning (15th), moment of prescience (17th), foresight (19th)","bonus feats": "Arcane Strike, Diehard, Endurance, Leadership, Lightning Reflexes, Maximize Spell, Skill Focus (Knowledge [history]), Weapon Focus","bloodline arcana": "Whenever you cast a spell with a range of \"personal,\" you gain a luck bonus equal to the spell's level on all your saving throws for 1 round.","bloodline powers": "You are destined for great things, and the powers that you gain serve to protect you.\\n\\nTouch of Destiny (Sp): At 1st level, you can touch a creature as a standard action, giving it an insight bonus on attack rolls, skill checks, ability checks, and saving throws equal to 1/2 your sorcerer level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nFated (Su): Starting at 3rd level, you gain a +1 luck bonus on all of your saving throws and to your AC during surprise rounds (see Combat) and when you are otherwise unaware of an attack. At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level.\\n\\nIt Was Meant To Be (Su): At 9th level, you may reroll any one attack roll, critical hit confirmation roll, or level check made to overcome spell resistance. You must decide to use this ability after the first roll is made but before the results are revealed by the GM. You must take the second result, even if it is worse. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day.\\n\\nWithin Reach (Su): At 15th level, your ultimate destiny is drawing near. Once per day, when an attack or spell that causes damage would result in your death, you may attempt a DC 20 Will save. If successful, you are instead reduced to –1 hit points and are automatically stabilized. The bonus from your fated ability applies to this save.\\n\\nDestiny Realized (Su): At 20th level, your moment of destiny is at hand. Any critical threats made against you only confirm if the second roll results in a natural 20 on the die. Any critical threats you score with a spell are automatically confirmed. Once per day, you can automatically succeed at one caster level check made to overcome spell resistance. You must use this ability before making the roll."},
{"bloodline": "Draconic","description": "At some point in your family's history, a dragon interbred with your bloodline, and now its ancient power flows through your veins.","class skill": "Perception","bonus spells": "mage armor (3rd), resist energy (5th), fly (7th), fear (9th), spell resistance (11th), form of the dragon I (13th), form of the dragon II (15th), form of the dragon III (17th), wish (19th)","bonus feats": "Blind-Fight, Great Fortitude, Improved Initiative, Power Attack, Quicken Spell, Skill Focus (Fly), Skill Focus (Knowledge [arcana]), Toughness","bloodline arcana": "Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, that spell deals +1 point of damage per die rolled.","bloodline powers": "The power of dragons flows through you and manifests in a number of ways. At 1st level, you must select one of the chromatic or metallic dragon types. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your dragon type, as noted on the following table.\\n\\nDragon Type\\tEnergy Type\\tBreath Shape\\nBlack\\tAcid\\t60-foot line\\nBlue\\tElectricity\\t60-foot line\\nGreen\\tAcid\\t30-foot cone\\nRed\\tFire\\t30-foot cone\\nWhite\\tCold\\t30-foot cone\\nBrass\\tFire\\t60-foot line\\nBronze\\tElectricity\\t60-foot line\\nCopper\\tAcid\\t60-foot line\\nGold\\tFire\\t30-foot cone\\nSilver\\tCold\\t30-foot cone\\n\\nClaws (Su): Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. Each of these attacks deals 1d4 points of damage plus your Strength modifier (1d3 if you are Small). At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws deal an additional 1d6 points of damage of your energy type on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.\\n\\nDragon Resistances (Ex): At 3rd level, you gain resist 5 against your energy type and a +1 natural armor bonus. At 9th level, your energy resistance increases to 10 and natural armor bonus increases to +2. At 15th level, your natural armor bonus increases to +4.\\n\\nBreath Weapon (Su): At 9th level, you gain a breath weapon. This breath weapon deals 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of the breath receive a Reflex save for half damage. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The shape of the breath weapon depends on your dragon type (as indicated on the above chart). At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day.\\n\\nWings (Su): At 15th level, leathery dragon wings grow from your back as a standard action, giving you a fly speed of 60 feet with average maneuverability. You can dismiss the wings as a free action.\\n\\nPower of Wyrms (Su): At 20th level, your draconic heritage becomes manifest. You gain immunity to paralysis, sleep, and damage of your energy type. You also gain blindsense 60 feet."},
{"bloodline": "Elemental","description": "The power of the elements resides in you, and at times you can hardly control its fury. This influence comes from an elemental outsider in your family history or a time when you or your relatives were exposed to a powerful elemental force.","class skill": "Knowledge (planes)","bonus spells": "burning hands* (3rd), scorching ray* (5th), protection from energy (7th), elemental body I (9th), elemental body II (11th), elemental body III (13th), elemental body IV (15th), summon monster VIII (elementals only) (17th), elemental swarm (19th)\\n\\n*These spells always deal a type of damage determined by your element. In addition, the subtype of these spells changes to match the energy type of your element.","bonus feats": "Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse","bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to match the type of your bloodline. This also changes the spell's type to match the type of your bloodline.","bloodline powers": "One of the four elements infuses your being, and you can draw upon its power in times of need. At first level, you must select one of the four elements: air, earth, fire, or water. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your element, as noted below.\\n\\nElement\\tEnergy Type\\tElemental Movement\\nAir\\tElectricity\\tFly 60 feet (average)\\nEarth\\tAcid\\tBurrow 30 feet\\nFire\\tFire\\t+30 feet base speed\\nWater\\tCold\\tSwim 60 feet\\n\\nElemental Ray (Sp): Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of damage of your energy type + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nElemental Resistance (Ex): At 3rd level, you gain energy resistance 10 against your energy type. At 9th level, your energy resistance increases to 20.\\n\\nElemental Blast (Sp): At 9th level, you can unleash a blast of elemental power once per day. This 20-foot-radius burst does 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Creatures that fail their saves gain vulnerability to your energy type until the end of your next turn. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.\\n\\nElemental Movement (Su): At 15th level, you gain a special movement type or bonus. This ability is based on your chosen element, as indicated on the above chart.\\n\\nElemental Body (Su): At 20th level, elemental power surges through your body. You gain immunity to sneak attacks, critical hits, and damage from your energy type."},
{"bloodline": "Fey","description": "The capricious nature of the fey runs in your family due to some intermingling of fey blood or magic. You are more emotional than most, prone to bouts of joy and rage.","class skill": "Knowledge (nature)","bonus spells": "entangle (3rd), hideous laughter (5th), deep slumber (7th), poison (9th), tree stride (11th), mislead (13th), phase door (15th), irresistible dance (17th), shapechange (19th)","bonus feats": "Dodge, Improved Initiative, Lightning Reflexes, Mobility, Point Blank Shot, Precise Shot, Quicken Spell, Skill Focus (Knowledge [nature])","bloodline arcana": "Whenever you cast a spell of the compulsion subschool, increase the spell's DC by +2.","bloodline powers": "You have always had a tie to the natural world, and as your power increases, so does the influence of the fey over your magic.\\n\\nLaughing Touch (Sp): At 1st level, you can cause a creature to burst out laughing for 1 round as a melee touch attack. A laughing creature can only take a move action but can defend itself normally. Once a creature has been affected by laughing touch, it is immune to its effects for 24 hours. You can use this ability a number of times per day equal to 3 + your Charisma modifier. This is a mind-affecting effect.\\n\\nWoodland Stride (Ex): At 3rd level, you can move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at your normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect you.\\n\\nFleeting Glance (Sp): At 9th level, you can turn invisible for a number of rounds per day equal to your sorcerer level. This ability functions as greater invisibility. These rounds need not be consecutive.\\n\\nFey Magic (Su): At 15th level, you may reroll any caster level check made to overcome spell resistance. You must decide to use this ability before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability at will.\\n\\nSoul of the Fey (Su): At 20th level, your soul becomes one with the world of the fey. You gain immunity to poison and DR 10/cold iron. Creatures of the animal type do not attack you unless compelled to do so through magic. Once per day, you can cast shadow walk as a spell-like ability using your sorcerer level as your caster level."},
{"bloodline": "Infernal","description": "Somewhere in your family's history, a relative made a deal with a devil, and that pact has influenced your family line ever since. In you, it manifests in direct and obvious ways, granting you powers and abilities. While your fate is still your own, you can't help but wonder if your ultimate reward is bound to the Pit.","class skill": "Diplomacy","bonus spells": "protection from good (3rd), scorching ray (5th), suggestion (7th), charm monster (9th), dominate person (11th), planar binding (devils and creatures with the fiendish template only) (13th), greater teleport (15th), power word stun (17th), meteor swarm (19th)","bonus feats": "Blind-Fight, Combat Expertise, Deceitful, Extend Spell, Improved Disarm, Iron Will, Skill Focus (Knowledge [planes]), Spell Penetration","bloodline arcana": "Whenever you cast a spell of the charm subschool, increase the spell's DC by +2.","bloodline powers": "You can draw upon the power of Hell, although you must be wary of its corrupting influence. Such power does not come without a price.\\n\\nCorrupting Touch (Sp): At 1st level, you can cause a creature to become shaken as a melee touch attack. This effect persists for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Creatures shaken by this ability radiate an aura of evil, as if they were an evil outsider (see detect evil). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nInfernal Resistances (Ex): At 3rd level, you gain resist fire 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to fire increases to 10 and your bonus on poison saving throws increases to +4.\\n\\nHellfire (Sp): At 9th level, you can call down a column of hellfire. This 10-foot-radius burst does 1d6 points of fire damage per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Good creatures that fail their saves are shaken for a number of rounds equal to your sorcerer level. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.\\n\\nOn Dark Wings (Su): At 15th level, you can grow fearsome bat wings as a standard action, giving you a fly speed of 60 feet with average maneuverability. The wings can be dismissed as a free action.\\n\\nPower of the Pit (Su): At 20th level, your form becomes infused with vile power. You gain immunity to fire and poison. You also gain resistance to acid 10 and cold 10, and the ability to see perfectly in darkness of any kind to a range of 60 feet."},
{"bloodline": "Undead","description": "The taint of the grave runs through your family. Perhaps one of your ancestors became a powerful lich or vampire, or maybe you were born dead before suddenly returning to life. Either way, the forces of death move through you and touch your every action.","class skill": "Knowledge (religion)","bonus spells": "chill touch (3rd), false life (5th), vampiric touch (7th), animate dead (9th), waves of fatigue (11th), undeath to death (13th), finger of death (15th), horrid wilting (17th), energy drain (19th)","bonus feats": "Combat Casting, Diehard, Endurance, Iron Will, Skill Focus (Knowledge [religion]), Spell Focus, Still Spell, Toughness","bloodline arcana": "Some undead are susceptible to your mind-affecting spells. Corporeal undead that were once humanoids are treated as humanoids for the purposes of determining which spells affect them.","bloodline powers": "You can call upon the foul powers of the afterlife. Unfortunately, the more you draw upon them, the closer you come to joining them.\\n\\nGrave Touch (Sp): Starting at 1st level, you can make a melee touch attack as a standard action that causes a living creature to become shaken for a number of rounds equal to 1/2 your sorcerer level (minimum 1). If you touch a shaken creature with this ability, it becomes frightened for 1 round if it has fewer Hit Dice than your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nDeath's Gift (Su): At 3rd level, you gain resist cold 5 and DR 5/- against nonlethal damage. At 9th level, your resistance to cold increases to 10 and your DR increases to 10/- against nonlethal damage.\\n\\nGrasp of the Dead (Sp): At 9th level, you can cause a swarm of skeletal arms to burst from the ground to rip and tear at your foes. The skeletal arms erupt from the ground in a 20-foot-radius burst. Anyone in this area takes 1d6 points of slashing damage per sorcerer level. Those caught in the area receive a Reflex save for half damage. Those who fail the save are unable to move for 1 round. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The skeletal arms disappear after 1 round. The arms must burst up from a solid surface. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.\\n\\nIncorporeal Form (Sp): At 15th level, you can become incorporeal for 1 round per sorcerer level. While in this form, you gain the incorporeal subtype. You only take half damage from corporeal sources as long as they are magic (you take no damage from non-magic weapons and objects). Likewise, your spells deal only half damage to corporeal creatures. Spells and other effects that do not deal damage function normally. You can use this ability once per day.\\n\\nOne of Us (Ex): At 20th level, your form begins to rot (the appearance of this decay is up to you) and undead see you as one of them. You gain immunity to cold, nonlethal damage, paralysis, and sleep. You also gain DR 5/-. Unintelligent undead do not notice you unless you attack them. You receive a +4 morale bonus on saving throws made against spells and spell-like abilities cast by undead."},
{"bloodline": "Aquatic","description": "Your family traces its heritage back to the ocean depths, whether scions of undersea empires left in the wake of nomadic sea-tribes, or the spawn of creeping ichthyic infiltrators into remote seaside villages. The song of the sea hums in your blood, calling the waves and all those within to your command.","class skill": "Swim","bonus spells": "hydraulic push* (3rd), slipstream* (5th), aqueous orb* (7th), geyser* (9th), control water (11th), beast shape IV (13th), summon monster VII (15th), seamantle* (17th), world wave* (19th)","bonus feats": "Athletic, Brew Potion, Defensive Combat Training, Dodge, Mobility, Silent Spell, Skill Focus (Swim), Toughness","bloodline arcana": "Whenever you cast a spell of the water type, your effective caster level is increased by one, and summoned creatures with a swim speed or the aquatic or water type gain a +1 morale bonus on attack and damage rolls.","bloodline powers": "Your seaborn magical talents awaken changes in you, both mystical and physical, as you develop your powers.\\n\\nDehydrating Touch (Sp): Starting at 1st level, you can make a melee touch attack as a standard action that inflicts 1d6 points of nonlethal damage + 1 for every two sorcerer levels you possess and sickens the target for 1 round. Oozes, plants, and creatures with the aquatic or water subtypes suffer lethal damage instead. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nAquatic Adaptation (Ex): At 3rd level, you gain a swim speed of 30 feet. At 9th level, you gain the amphibious special quality and develop a fat layer that grants a +1 natural armor bonus and resist cold 5. When immersed in water, you gain blindsense 30 feet. At 15th level, you gain a swim speed of 60 feet and blindsense of 60 feet in water.\\n\\nAquatic Telepathy (Su): At 9th level, you gain telepathy (100 feet) and can communicate with creatures with a swim speed or the aquatic or water types regardless of intelligence. You may cast suggestion on such creatures a number of times per day equal to your Charisma modifier. This ability is telepathic and does not require audible or visual components. At 15th level, once per day you can telepathically call and request a service from an aquatic, water, or swimming creature as if using demand or greater planar ally.\\n\\nRaise the Deep (Sp): At 15th level, you raise water as per control water, but no water need be present. This created water is stationary and does not flow out of the area where you create it; it lasts 1 round per sorcerer level and then disappears. At 20th level, the dimensions of the effect are doubled. You may use this ability once per day.\\n\\nDeep One (Ex): At 20th level, you gain blindsense 60 feet and your body is covered with fine, slippery scales granting DR 10/piercing, resist cold 20, and continuous freedom of movement. Underwater, you gain evasion and blindsight 120 feet, and you are immune to pressure damage from deep water."},
{"bloodline": "Boreal","description": "Descended from inhabitants of the lands of ice and snow, you count among your ancestors giant-kin, troll-born, and frost-rimed spirits. Their savage and raw energies flow down through generations to infuse you to the marrow with the chill of the polar wind, crackling auroras, and the long winter's night.","class skill": "Survival","bonus spells": "enlarge person (3rd), rage (5th), elemental aura* (cold only) (7th), wall of ice (9th), cone of cold (11th), transformation (13th), giant form I (15th), polar ray (17th), meteor swarm (dealing cold damage) (19th)","bonus feats": "Arcane Strike, Diehard, Empower Spell, Endurance, Exotic Weapon Proficiency, Power Attack, Skill Focus (Intimidate), Toughness","bloodline arcana": "Whenever you cast a spell with the cold descriptor, increase the spell's save DC by 1.","bloodline powers": "Your connection to primeval winters grants you a mastery of cold magic that few can match, and a savagery that fewer still can withstand.\\n\\nCold Steel (Sp): At 1st level, you can touch a weapon or up to 50 pieces of ammunition as a standard action, giving it the frost property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the icy burst property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nIcewalker (Ex): At 3rd level, you gain resist cold 5 and can move across snow and icy surfaces without penalty and without leaving tracks. At 9th level, you gain resist cold 10 and can climb icy surfaces as if using spider climb.\\n\\nSnow Shroud (Su): At 9th level, you ignore concealment and Perception penalties in natural or magical snow, ice, fog, and similar weather conditions. In addition, you can surround yourself with a cloak of swirling snow for a number of rounds per day equal to your sorcerer level. This power acts and deals damage as a fire shield (chill shield) that sheds no light. It provides a 20% miss chance on attacks made against you and grants a bonus on Stealth checks equal to 1/2 your sorcerer level in snowy or icy areas. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.\\n\\nBlizzard (Sp): At 15th level, you can create a savage winter storm centered on you. This power acts as control winds, but in addition the entire area (not including the “eye” at the center of the storm) is affected as a sleet storm and all in the area are exposed to extreme cold. You may use this ability once per day.\\n\\nChild of Ancient Winters (Su): At 20th level, you gain the cold subtype and you become immune to fatigue and exhaustion. In addition, you gain immunity to sneak attacks and critical hits. This power causes you to gain vulnerability to fire."},
{"bloodline": "Deep Earth","description": "Knowledge (dungeoneering)","class skill": "Knowledge (dungeoneering)","bonus spells": "expeditious excavation* (3rd), darkvision (5th), shifting sand* (7th), stoneskin (9th), spike stones (11th), stone tell (13th), repel metal or stone (15th), earthquake (17th), clashing rocks* (19th)","bonus feats": "Acrobatic Steps, Alertness, Blind-Fight, Forge Ring, Nimble Moves, Skill Focus (Perception), Stealthy, Still Spell","bloodline arcana": "Whenever you and the target of your spell are both underground, increase the spell's save DC by +1.","bloodline powers": "The powers of the living rock are within you, and your communion with the strength of stone is refined and enhanced as your power grows.\\n\\nTremor (Sp): At 1st level, as a standard action, you can cause the ground to shake beneath a single creature within 30 feet, functioning as a trip maneuver using your sorcerer level plus your Charisma modifier in place of your CMB. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nRockseer (Su): At 3rd level, you gain the stonecunning trait as a dwarf; if already a dwarf, your bonus improves to +4. At 9th level, you gain tremorsense 30 feet. At 15th level, you can see through solid objects as if using a ring of x-ray vision for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive.\\n\\nCrystal Shard (Sp): At 9th level, you can touch a metal or stone weapon (or up to 50 pieces of ammunition) as a standard action, giving it the bane property against any creature with the earth subtype, oozes, or constructs made of stone or metal, for 1 minute. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.\\n\\nEarth Glide (Ex): At 15th level, you can glide through any sort of natural earth or stone as easily as a fish swims through water, with a burrow speed equal to half your normal speed. You do not leave a tunnel or trace of your passage. You can use this ability for 1 minute per sorcerer level each day. The duration need not be continuous, but it must be used in 1-minute increments.\\n\\nStrength of Stone (Su): At 20th level, your flesh becomes as hard as stone, giving you DR 10/adamantine, and you become immune to petrification. You suffer no penalties while squeezing through tight spaces and are immune to bull rush, drag, grapple, reposition, and trip maneuvers, and to push and pull effects as long as you are standing on the ground."},
{"bloodline": "Dreamspun","description": "Your family is a long line of dreamers, who dream not as ordinary mortals do but rather as those who reach through and touch the supernal realm of dreams and the farthest shores of night. Whether it is a gift or curse is not always clear, but your visions of the past and future call you ineluctably to a life of adventure.","class skill": "Sense Motive","bonus spells": "sleep (3rd), augury (5th), deep slumber (7th), divination (9th), dream (11th), shadow walk (13th), vision (15th), moment of prescience (17th), astral projection (19th)","bonus feats": "Alertness, Blind-Fight, Combat Expertise, Deceitful, Heighten Spell, Improved Feint, Persuasive, Skill Focus (Sense Motive)","bloodline arcana": "Whenever you target a single creature with a spell, you gain an insight bonus equal to half the spell's level (minimum +1) for 1 round to your AC and saving throws against any spell or attack made by that creature.","bloodline powers": "You reach out into and through the world of dreams to touch the minds and destinies of those around you.\\n\\nLullaby (Sp): At 1st level, you can use lullaby as a spell-like ability a number of times per day equal to 3 + your Charisma modifier. This effect lasts for 1 minute and does not require concentration. The penalty on saves versus sleep effects increases to –4.\\n\\nCombat Precognition (Su): Your insight into the future grants you an advantage in combat. At 3rd level and every 4 levels thereafter, you gain a +1 insight bonus on initiative checks.\\n\\nDreamshaper (Sp): At 9th level, you can manipulate the dreamscape of others, drawing forth or tampering with their subconscious minds. This power allows you to tamper with the target's memories as if using modify memory, or you may ask questions as if using speak with dead upon a corpse. A successful Will save negates the effect. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier, with further modifiers as the nightmare spell. You can use this ability once per day at 9th level. At 17th level you can use this ability twice per day, and at 20th, three times per day.\\n\\nEye of Somnus (Sp): At 15th level, you can project your consciousness as if using arcane eye. In addition, at any point you can cause the arcane eye to become visible. The eye can no longer be moved, but it acts as a symbol of sleep to all who see it. You may use this power once per day.\\n\\nSolipsism (Ex): At 20th level, you can drift into the dream world, fading from the world around you. You can become incorporeal for 1 minute per sorcerer level. You gain the incorporeal subtype and take only half damage from corporeal magical attacks (you take no damage from nonmagical weapons and objects). Your spells deal only half damage to corporeal creatures, but spells and abilities that do not deal damage function normally. The duration need not be continuous, but it must be used in 1-minute increments."},
{"bloodline": "Protean","description": "You have in your veins the ever-changing wildness of primal chaos, the raw essence of unbound creation. Your mind and spirit burst with the constant inspiration of consummate freedom, though you have difficulty following through on a task when another, new and exciting, catches your interest.","class skill": "Knowledge (planes)","bonus spells": "entropic shield (3rd), blur (5th), gaseous form (7th), confusion (9th), major creation (11th), disintegrate (13th), greater polymorph (15th), polymorph any object (17th), shapechange (19th)","bonus feats": "Agile Maneuvers, Defensive Combat Training, Enlarge Spell, Great Fortitude, Improved Great Fortitude, Skill Focus (Craft [any]), Spell Focus, Toughness","bloodline arcana": "Your magic of creation and changing is hard to unravel. The DC to dispel transmutation or conjuration (creation) spells that you cast is increased by +4.","bloodline powers": "Your ancestral immersion in primordial chaos begets your curiously warped magical talents.\\n\\nProtoplasm (Sp): At 1st level, you can create a ball of entropic protoplasm and hurl it at targets within 30 feet. This protoplasm acts as a tanglefoot bag that also inflicts 1 point of acid damage per round to a creature entangled by it. The protoplasm dissolves within 1d3 rounds. You may use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nProtean Resistances (Ex): At 3rd level, you gain resist acid 5 and a +2 bonus on saving throws against polymorph, petrification, and transmutation spells or effects. At 9th level, you gain resist acid 10 and your save bonus increases to +4.\\n\\nReality Wrinkle (Sp): At 9th level, you can surround yourself with a mobile, 10-foot-radius emanation of mutable reality. This rippling distortion is similar to solid fog but does not provide concealment or block line of sight. Your movement is not slowed by this aura. Attacks from outside the aura suffer a 20% miss chance against targets inside the aura. You may use this ability a number of rounds per day equal to your sorcerer level, though this duration need not be continuous.\\n\\nSpatial Tear (Sp): At 15th level, once per day, you can unravel the fibers of reality and ride along them as they snap back into place. This power functions as dimension door, while also creating a mass of black tentacles centered on your former location. Both of these effects use your sorcerer level as the caster level. At 20th level, you can use this ability twice per day.\\n\\nAvatar of Chaos (Ex): At 20th level, you are infused with the essence of raw chaos. You gain immunity to acid, petrification, and polymorph effects (except when cast on self), as well as a +2 bonus to save DCs and on checks to overcome spell penetration against creatures with the lawful subtype."},
{"bloodline": "Serpentine","description": "Your bloodline carries the lingering stain of ancient serpent races that ruled when the world was young; your forebears were likely favored slaves anointed by their reptilian masters and gifted with their cold cunning and subtle manipulation. While deception and a mesmeric charm are your birthright, you may struggle for truth in spite of your heritage.","class skill": "Diplomacy","bonus spells": "hypnotism (3rd), delay poison (5th), summon monster III (reptiles only) (7th), poison (9th), hold monster (11th), mass suggestion (13th), summon monster VII (reptiles only) (15th), irresistible dance (17th), dominate monster (19th)","bonus feats": "Combat Casting, Combat Reflexes, Deceitful, Deft Hands, Persuasive, Silent Spell, Skill Focus (Bluff), Stealthy","bloodline arcana": "Your powers of compulsion can affect even bestial creatures. Whenever you cast a mind-affecting or language-dependent spell, it affects animals, magical beasts, and monstrous humanoids as if they were humanoids who understood your language.","bloodline powers": "The treacherous and yet hypnotic serpent's blood that flows through you taints your magic with a sinuous and seductive grace.\\n\\nSerpent's Fang (Ex): At 1st level, you can grow fangs as a free action. These fangs are treated as a natural weapon inflicting 1d4 points of damage plus your Strength modifier (1d3 if you are Small) plus poison (Bite—injury; save Fort DC 10 + 1/2 your sorcerer level + your Constitution modifier; frequency 1/round for 6 rounds; effect 1 Con damage; cure 1 save). At 5th level, these fangs are considered magical for the purpose of overcoming DR and the poison damage increases to 1d2 Con. At 7th level, your poison requires 2 successful saves to cure. At 11th level, your poison damage increases to 1d4 Con. You can use your fangs for a number of rounds per day equal to 3 + your Charisma modifier.\\n\\nSerpentfriend (Ex): At 3rd level, you can use speak with animals at will with reptilian animals (including various forms of dinosaurs, lizards, and other cold-blooded creatures), and you gain a viper familiar using your sorcerer level –2 as your effective wizard level.\\n\\nSnakeskin (Ex): At 9th level, you gain a +1 bonus to natural armor, a +2 racial bonus on saves against poison, and a +2 bonus on Escape Artist checks. At 13th level and 17th level, these bonuses increase by +1.\\n\\nDen of Vipers (Sp): At 15th level, you may summon a host of writhing serpents. This power acts as creeping doom, but the swarms' poison inflicts Con damage and any creature other than you sharing a space with a swarm is entangled. You may use this ability once per day.\\n\\nScaled Soul (Su): At 20th level, you gain the shapechanger subtype, and you can assume the form of a reptilian humanoid (as alter self) or snake of Diminutive to Huge size (as beast shape III) at will. You retain the power of speech and the ability to use somatic spell components when transformed. You also become immune to poison and paralysis. You may use serpent's fang as often as desired, and you may choose to inflict damage to any ability score."},
{"bloodline": "Shadow","description": "Spirits from the shadow plane dally at times in the world of light, and such as these lay with your ancestors once upon a time, imparting the mystery of shadow-stuff into your lineage. You are often sullen and withdrawn, preferring to skulk at the fringes of social circles and keep to yourself, cultivating an air of mystery and majesty that is all your own.","class skill": "Stealth","bonus spells": "ray of enfeeblement (3rd), darkvision (5th), deeper darkness (7th), shadow conjuration (9th), shadow evocation (11th), shadow walk (13th), power word blind (15th), greater shadow evocation (17th), shades (19th)","bonus feats": "Acrobatic, Blind-Fight, Dodge, Quick Draw, Silent Spell, Skill Focus (Stealth), Stealthy, Weapon Finesse","bloodline arcana": "Whenever you cast a spell with the darkness descriptor or the shadow subschool, you gain a circumstance bonus on Stealth checks equal to the spell's level for 1d4 rounds.","bloodline powers": "Your benighted heritage infuses your mastery of magic with the essence of shadowstuff.\\n\\nShadowstrike (Sp): At 1st level, you can make a melee touch attack as a standard action that inflicts 1d4 points of nonlethal damage + 1 for every two sorcerer levels you possess. In addition, the target is dazzled for 1 minute. Creatures with low-light vision or darkvision are not dazzled by this ability. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nNighteye (Ex): At 3rd level, you gain darkvision 30 feet. At 9th level, you gain darkvision 60 feet. If you already possess darkvision, its range is increased by these amounts.\\n\\nShadow Well (Sp): At 9th level, you can use the Stealth skill even while being observed and without cover or concealment, as long as you are within 10 feet of a shadow other than your own. In addition, when within an area of darkness or dim light, as a standard action you may choose to switch places with a willing ally within 60 feet, who must also be in darkness or dim light. At 13th level, you can instead switch the positions of two willing allies, each of whom must be within 60 feet of you. Unless otherwise noted, this travel is identical to dimension door. You may use the ability to switch places once per day at 9th level, plus one additional time per day at 17th level and 20th level.\\n\\nEnveloping Darkness (Sp): At 15th level, you may create an area of deeper darkness that you can see through without penalty. All creatures except you are entangled within this darkness unless using freedom of movement or a similar effect. You may use this ability once per day.\\n\\nShadow Master (Su): At 20th level, you can see perfectly in natural or magical darkness. When you use shadow conjuration or shadow evocation spells, your creations are 20% more real, and any creatures you create gain the benefits of the Augment Summoning feat."},
{"bloodline": "Starsoul","description": "You come from a line of stargazers and explorers who delved deeply into the darkness beyond the stars. In touching the void, the void touched them, and your mind, spirit, and body yearn to span the gulf between worlds.","class skill": "Knowledge (nature)","bonus spells": "unseen servant (3rd), glitterdust (5th), blink (7th), call lightning storm (9th; dealing fire damage, damage increased outdoors at night), overland flight (11th), repulsion (13th), reverse gravity (15th), greater prying eyes (17th), meteor swarm (19th)","bonus feats": "Blind-Fight, Craft Rod, Dodge, Endurance, Improved Counterspell, Improved Iron Will, Iron Will, Quicken Spell, Skill Focus (Perception), Toughness","bloodline arcana": "Whenever you cast an evocation spell, targets that fail their saves are dazzled by tiny sparkling starlights for 1 round per level of the spell.","bloodline powers": "Your skyward gaze and communion with the heavens focus and enhance your magical talents.\\n\\nMinute Meteors (Sp): At 1st level, you can summon a rain of tiny meteorites as a standard action to fall in a 5-foot column, 30 feet high, with a range of 30 feet. The meteors inflict 1d4 points of fire damage + 1 per 2 sorcerer levels. A Reflex save negates this damage. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nVoidwalker (Ex): At 3rd level, you gain low-light vision and resist cold and fire 5. At 9th level, you no longer need to breathe, as if wearing a necklace of adaptation.\\n\\nAurora Borealis (Sp): At 9th level, you can create a sheet of cascading colors. This power acts as a wall of fire, but it inflicts cold damage and does not radiate heat. However, one side of the aurora designated by you fascinates creatures within 10 feet, up to a maximum of 2 HD of creatures per sorcerer level. A Will save negates this fascinate effect. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive.\\n\\nBreaching the Gulf (Sp): At 15th level, your caster level is increased by 3 when casting spells of the teleportation subschool. In addition, once per day you can teleport a single creature within 30 feet into the void of space if it fails a Will save. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The target can attempt a new saving throw as a full-round action each round to return. While trapped in the airless void, the target takes 6d6 points of cold damage per round and must hold its breath or begin to suffocate.\\n\\nStarborn (Ex): At 20th level, you gain immunity to cold and blindness, and you can see perfectly in natural or magical darkness. In addition, you gain fast healing 1 when you are outdoors at night."},
{"bloodline": "Stormborn","description": "You trace your heritage to fierce and proud spirits of storm and sky, and living lightning sings in your veins.","class skill": "Knowledge (nature)","bonus spells": "shocking grasp (3rd), gust of wind (5th), lightning bolt (7th), shout (9th), overland flight (11th), chain lightning (13th), control weather (15th), whirlwind (17th), storm of vengeance (19th)","bonus feats": "Deadly Aim, Dodge, Enlarge Spell, Far Shot, Great Fortitude, Point Blank Shot, Skill Focus (Fly), Wind Stance","bloodline arcana": "Whenever you cast a spell with the electricity or sonic descriptor, increase the save DC by 1.","bloodline powers": "Your mastery of the storm is reflected in the unique panoply of powers you manifest.\\n\\nThunderstaff (Sp): At 1st level, you can touch a weapon as a standard action, giving it the shock property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the shocking burst property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nStormchild (Ex): At 3rd level, you gain resist electricity 5 and resist sonic 5, and treat wind effects as being one step less severe. At 9th level, you treat wind effects as being two steps less severe and gain blindsense 60 feet against concealment from natural or magical fog, mist, or weather effects.\\n\\nThunderbolt (Sp): At 9th level, you can command a stroke of lightning to strike from above in a 5-foot-radius cylinder 60 feet high. The thunderbolt inflicts 1d6 points of damage per sorcerer level; half of this damage is electricity and half is sonic. A Reflex save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) halves this damage. Creatures failing their saves are deafened for 1 round. At 9th level, you can use this ability once per day, at 17th twice per day, and at 20th three times per day. This power has a range of 120 feet.\\n\\nRide the Lightning (Sp): At 15th level, as a full-round action you can become a living lightning bolt and move in a straight line up to 10 times your speed. You do not provoke attacks of opportunity while moving in this way. Creatures or objects in your path are affected as by your thunderbolt power. Creatures do not block your movement but solid barriers do unless they are reduced to 0 hit points. You can use this power once per day for a number of rounds equal to your sorcerer level.\\n\\nStorm Lord (Ex): At 20th level, you are one with the storm. You gain immunity to deafness, stunning, and wind effects and gain blindsight 120 feet against concealment from natural or magical fog, mist, or weather. Once per day, when attacked with an electricity or sonic effect, you may forgo your saving throw and absorb the energies of the attack, healing 1 point of damage for every 3 points of damage the attack would otherwise have dealt."},
{"bloodline": "Verdant","description": "Your progenitors infused themselves with raw plant life, binding it into their own tissue and passing it down to their literal seed, giving you innate communion with nature.","class skill": "Knowledge (nature)","bonus spells": "entangle (3rd), barkskin (5th), speak with plants (7th), command plants (9th), wall of thorns (11th), transport via plants (13th), plant shape III (15th), animate plants (17th), shambler (19th)","bonus feats": "Acrobatic Steps, Craft Staff, Endurance, Extend Spell, Fleet, Nimble Moves, Skill Focus (Knowledge [nature]), Toughness","bloodline arcana": "Whenever you cast a spell with a range of personal, your skin toughens, granting you a natural armor bonus equal to the spell's level for 1d4 rounds. This bonus does not stack with any other natural armor bonuses you might have.","bloodline powers": "The power of living things infuses every aspect of your magic, as you draw power from nature and its life energies flow through you.\\n\\nTanglevine (Sp): At 1st level, as a standard action, you can create a 15-foot-long, animated vine that springs from your hand. This vine lasts for 1 round and can be used to make a single disarm, steal, or trip combat maneuver, using your sorcerer level plus your Charisma modifier in place of your normal CMB. You can use this power a number of times per day equal to 3 + your Charisma modifier.\\n\\nPhotosynthesis (Ex): At 3rd level, you feed upon nature's raw essence. Your need to eat and sleep is reduced as if wearing a ring of sustenance, and you gain a +2 racial bonus on saving throws made against poison and sleep effects. At 9th level, these bonuses increase to +4.\\n\\nMassmorph (Sp): At 9th level, as a full-round action, you can alter the size and health of plant life, as if using plant growth or diminish plants. Alternatively, you can transform one willing non-plant creature per sorcerer level (no two of which can be more than 30 feet apart) as tree shape. You may transform creatures as plant shape I at 15th level, or plant shape II at 20th level. You can transform non-plant creatures using this power once per day.\\n\\nRooting (Ex): At 15th level, as a move action, you can extend roots into the ground. Your speed is reduced to 5 feet, but you gain a +4 bonus to natural armor and a +10 bonus to CMD against bull rush, overrun, reposition, and trip maneuvers. You also gain tremorsense 30 feet and fast healing 1. You can use this power for a number of minutes per day equal to your sorcerer level. This duration need not be consecutive, but it must be used in 1-minute increments.\\n\\nShepherd of the Trees (Su): At 20th level, your verdant heritage fully manifests. You gain a +4 natural armor bonus. You gain immunity to paralysis, poison, polymorph, sleep, and stunning, and you gain tremorsense 30 feet even when not rooted."},
{"bloodline": "Accursed","description": "Misfortune, pestilence, and nightmares follow your family like vermin drawn to carrion. Somewhere in your family history, a hag's foul influence entered your bloodline. You may actually be related to the hag, or you may still be suffering the effects of a curse that a hag laid upon your kin in generations past. Now the hag's powers are part of your heritage.","class skill": "Perception","bonus spells": "ray of enfeeblement (3rd), touch of idiocy (5th), ray of exhaustion (7th), bestow curse (9th), feeblemind (11th), eyebite (13th), insanity (15th), dimensional lock (17th), energy drain (19th)","bonus feats": "Alertness, Blind-Fight, Combat Casting, Deceitful, Defensive Combat Training, Endurance, Great Fortitude, Mounted Combat","bloodline arcana": "You count as a hag for the purpose of joining a hag's coven. The coven must contain at least one hag. In addition, whenever you are within 30 feet of another sorcerer with this bloodline or a witch with the coven hex, you can use the aid another action to grant a +1 bonus to the other spellcaster's caster level for 1 round.","bloodline powers": "The source of your power isn't pretty, but it does allow you to emulate the preternatural ugliness and toughness of a hag—though doing so won't help you make friends.\\n\\nHorrific Visage (Su): At 1st level, you can draw upon your hag ancestor to cause one target to perceive you as having a horrifying appearance. As a standard action, you can force one target within 30 feet to make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be shaken for 1 round for every 2 sorcerer levels you possess (minimum 1 round). This is a mind-affecting, fear-based ability. This fear does not stack with other fear effects. You may use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nWretched Endurance (Ex): At 3rd level, you gain a +2 bonus on all saving throws against charm, cold, fear, fire, and sleep effects. And 9th level, these bonuses increase to +4.\\n\\nDread Gaze (Su): At 9th level, you gain a form of the green hag's evil eye power. As a standard action, you may fix your gaze on any one creature within 60 feet. The target must make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be staggered for 1 round for every 2 sorcerer levels you possess. You may use this ability once per day at 9th level. At 17th level, you can use this ability twice per day. At 20th level, you may use this ability three times per day.\\n\\nDream Walking (Sp): At 15th level, you can enter the ethereal plane. This functions like ethereal jaunt, but with a duration of 1 minute for every 2 sorcerer levels you possess. Once during this trip, you may cast nightmare as a spell-like ability on a creature you see on the Material Plane. (This is an exception to the normal rule that ethereal creatures cannot affect targets on the Material Plane).\\n\\nFearsome Survival (Su): At 20th level, your hag-blood gives you considerable resilience. You gain DR 10/cold iron, and gain SR equal to 6 + your sorcerer level."},
{"bloodline": "Djinni","description": "You were born with the power of air genies, and the magic of the djinn is strong in you.","class skill": "Knowledge (planes)","bonus spells": "shocking grasp (3rd), invisibility (5th), fly (7th), minor creation (9th), overland flight (11th), chain lightning (13th), plane shift (15th), greater planar binding (17th), wish (19th)","bonus feats": "Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse","bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to electricity. This also changes the spell's descriptors to match this energy type.","bloodline powers": "Like a djinni, you have both natural power over air and several other genie-based abilities.\\n\\nElectricity Ray (Sp): Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of electricity damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nElemental Resistance (Ex): At 3rd level, you gain electricity resistance 10. Your electricity resistance increases to 20 at 9th level.\\n\\nWhirlwind (Su): At 9th level, you gain the ability to turn into a 10-foot-high whirlwind once per day for 1 round per sorcerer level.\\n\\nElemental Movement (Su): At 15th level, you gain a fly speed of 60 feet with average maneuverability.\\n\\nPower of the Djinn (Su): At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words \"\"I wish,\"\" and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.\\n\\nYou also become immune to electricity damage, and can use plane shift once per day to travel to or from the Plane of Air."},
{"bloodline": "Efreeti","description": "You were born with the power of fire genies, and the magic of the efreet is strong in you.","class skill": "Knowledge (planes)","bonus spells": "enlarge person (3rd), scorching ray (5th), fireball (7th), wall of fire (9th), persistent image (11th), planar binding (13th), plane shift (15th), giant form II (17th), wish (19th)","bonus feats": "Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse","bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to fire. This also changes the spell's descriptors to match this energy type.","bloodline powers": "Like an efreeti, you have both natural power over air and several other genie-based abilities.\\n\\nFire Ray (Sp): Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of fire damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nElemental Resistance (Ex): At 3rd level, you gain fire resistance 10. At 9th level, your fire resistance increases to 20.\\n\\nEfreeti Form (Su): At 9th level, you gain the ability to assume the form of an efreeti once per day. This acts like the spell giant form I, except you only use it to become an efreeti and its duration is 1 round per level. While in this form, you also gain an efreeti's heat ability.\\n\\nElemental Movement (Su): At 15th level, your base speed increases by +30 feet.\\n\\nPower of the Efreet (Su): At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words \"\"I wish,\"\" and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.\\n\\nYou also become immune to fire damage, and can use plane shift once per day to travel to or from the Plane of Fire."},
{"bloodline": "Maestro","description": "The spiritual power of art and song runs strongly through your family line. This may be the result of ancient pacts made with azata patrons, or even an inheritance from a lillend or trumpet archon ancestor. It could also be the lingering taint of a less savory heritage, such as from a harpy or a forefather driven to madness by the disquieting gibbering of a shoggoth. However it came to be, your family's artistic bent shows itself strongly in your magic.","class skill": "Perform","bonus spells": "ventriloquism (3rd), hideous laughter (5th), suggestion (7th), shout (9th), dominate person (11th), mass suggestion (13th), power word blind (15th), greater shout (17th), wail of the banshee (19th)","bonus feats": "Deceitful, Greater Spell Focus (enchantment), Lingering Performance, Persuasive, Skill Focus (Perform), Spell Focus (enchantment), Spellsong, Still Spell","bloodline arcana": "Whenever you cast a spell with a verbal component and no somatic or material component, you treat your caster level as if it were one higher.","bloodline powers": "You hear music whenever you cast spells, and can use the songs in your head to create magic effects.\\n\\nBeguiling Voice (Ex): At 1st level, you can use the sound of your voice to lull a target creature into taking no action. This ability acts as the daze spell, except it is language-dependent, has a duration of 1 round, and affects a living creature whose Hit Dice do not exceed your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nFascinate (Ex): At 3rd level, you gain the ability to use a Perform skill to cause one or more creatures to become fascinated with you. This acts as the fascinate bardic perform ability, except the save DC is 10 + 1/2 your sorcerer level + your Charisma bonus, and it lasts 1 round/level. You may use this ability once per day at 3rd level, twice per day at 8th level, three times per day at 13th level, and four times per day at 18th level.\\n\\nPerfect Voice (Su): At 9th level, you understand all efforts to communicate through sound, and can make yourself understood to any creature able to understand language. You can speak to, and understand the speech of, any creature that understands at least one spoken language. The save DCs of language-dependent spells you cast increase by +1.\\n\\nInspire (Sp): At 15th level, your artistic magic can inspire your allies to great accomplishments. You can use greater heroism as a spell-like ability. You can use this ability once per day at 15th level, twice per day at 17th level, and three times per day at 19th level.\\n\\nGrand Maestro (Su): At 20th level, the power of pure magic music flows through you. You cast any spell with a verbal component as if it had the Still Spell metamagic feat applied to it, with no increase to the casting time or spell slot required to cast it. You gain immunity to sonic damage and language-dependent spells."},
{"bloodline": "Marid","description": "You were born with the power of water genies, and the magic of the marids is strong in you.","class skill": "Knowledge (planes)","bonus spells": "obscuring mist (3rd), see invisibility (5th), gaseous form (7th), wall of ice (9th), persistent image (11th), elemental body III (13th), plane shift (15th), polar ray (17th), wish (19th)","bonus feats": "Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse","bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to cold. This also changes the spell's descriptors to match this energy type.","bloodline powers": "Like a marid, you have both natural power over water and several other genie-based abilities.\\n\\nFrost Ray (Sp): Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of cold damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nElemental Resistance (Ex): At 3rd level, you gain cold resistance 10. At 9th level, your cold resistance increases to 20.\\n\\nWater's Fury (Su): At 9th level, you gain the ability to summon a rushing jet of water from the elemental plane of water and direct it against your foes. As a standard action, you can create a jet of water in a 60-foot line that deals 1d6 points of damage per two sorcerer levels you possess, and blinds the target that was struck for 1d6 rounds. A Reflex save (DC 10 + 1/2 your sorcerer level + your Charisma bonus) reduces the damage by half and negates the blinding effect.\\n\\nElemental Movement (Su): At 15th level, you gain a swim speed of 60 feet.\\n\\nPower of the Marid (Su): At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words \"\"I wish,\"\" and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.\\n\\nYou become immune to cold damage, and can use plane shift once per day to travel to or from the Plane of Water."},
{"bloodline": "Rakshasa","description": "At some point in your family's history, one of your ancestors was tainted by the influence of a rakshasa. Though most of your family seem entirely normal, you have always felt your own skin is a prison from which magic allows you to escape. Your birthright is a secret you may be forced to keep from societies that would never deal with you if your heritage were known.","class skill": "Disguise","bonus spells": "charm person (3rd), invisibility (5th), suggestion (7th), detect scrying (9th), prying eyes (11th), mass suggestion (13th), greater polymorph (15th), mind blank (17th), dominate monster (19th)","bonus feats": "Arcane Armor Mastery, Arcane Armor Training, Deceitful, Detect Expertise, Empower Spell, Light Armor Proficiency, Martial Weapon Proficiency, Stealthy","bloodline arcana": "Add half your sorcerer level to the Spellcraft DC for others to identify spells you cast. If their checks fail by 5 or more, they mistakenly believe you are casting an entirely different spell (selected by you when you begin casting).","bloodline powers": "You can call upon the nearly divine power of your rakshasa ancestors, giving you the power to convincingly deceive your enemies.\\n\\nSilver Tongue (Su): At 1st level, you can draw upon your outsider heritage to spin amazingly convincing lies. Activating this ability is a swift action. You gain a +5 bonus on one Bluff check made to convince another of the truth of your words (similar to using glibness). If a magical effect is used against you that would detect your lies or force you to speak the truth, the user of the effect must succeed on a caster level check (DC 10 + your sorcerer level) to succeed. Failure means the effect does not detect your lies or force you to speak only the truth. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nMind Reader (Sp): At 3rd level, you can read minds as a spell-like ability. This ability acts like detect thoughts, except it lasts only 1 round, you use it on a single target as a standard action, and if the target fails its Will save, you gain information as if you had concentrated on it for 3 rounds. You may use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 20th level.\\n\\nHide Aura (Sp): At 9th level, you can conceal yourself from prying magic. This ability acts like a constant nondetection spell cast upon yourself. You can end or restore this protection as a move action.\\n\\nAlter Self (Sp): At 15th level, you can change your shape into that of any humanoid at will. This ability acts like alter self, except you may remain in a chosen form as long as you want.\\n\\nOutsider (Su): At 20th level, your natural form becomes an animal-headed humanoid, like a true rakshasa. This does not affect your ability to speak or cast spells. You can use your alter self or other disguise and polymorph abilities to assume your original form or other forms when it suits you. You are forevermore treated as a native outsider rather than as a humanoid (or whatever your original type was) for the purpose of spells and other magical effects. Unlike other outsiders, you can still be brought back from the dead as if you were a member of your previous creature type. You gain DR 10/piercing."},
{"bloodline": "Shaitan","description": "You were born with the power of earth genies, and the magic of the shaitans is strong in you.","class skill": "Knowledge (planes)","bonus spells": "true strike (3rd), glitterdust (5th), greater magic weapon (7th), stoneskin (9th), wall of stone (11th), wall of iron (13th), plane shift (15th), iron body (17th), wish (19th)","bonus feats": "Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse","bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to acid. This effect also changes the spell's descriptors to match this energy type.","bloodline powers": "Like a shaitan, you have both natural power over earth, and several other genie-based abilities.\\n\\nAcid Ray (Sp): Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.\\n\\nElemental Resistance (Ex): At 3rd level, you gain acid resistance 10. At 9th level, your acid resistance increases to 20.\\n\\nAvalanche (Su): At 9th level, whenever you hit a single target with a spell that deals damage, you may make a bull rush check as a swift action. Your CMB for this maneuver is equal to your sorcerer caster level + your Charisma bonus. You can make this maneuver even if the target is not in melee range, and you do not provoke an attack of opportunity for making this maneuver. If the target is in contact with earth, stone, or rock, you gain a +4 bonus on your CMB check.\\n\\nElemental Movement (Su): At 15th level, you gain a burrow speed of 30 feet.\\n\\nPower of the Shaitan (Su): At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words \"\"I wish,\"\" and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component.\\n\\nYou become immune to acid damage, and can use plane shift once per day to travel to or from the Plane of Earth."}
