{"class": "Barbarian","description": "For some, there is only rage. In the ways of their people, in the fury of their passion, in the howl of battle, conflict is all these brutal souls know. Savages, hired muscle, masters of vicious martial techniques, they are not soldiers or professional warriors—they are the battle possessed, creatures of slaughter and spirits of war. Known as barbarians, these warmongers know little of training, preparation, or the rules of warfare; for them, only the moment exists, with the foes that stand before them and the knowledge that the next moment might hold their death. They possess a sixth sense in regard to danger and the endurance to weather all that might entail. These brutal warriors might rise from all walks of life, both civilized and savage, though whole societies embracing such philosophies roam the wild places of the world. Within barbarians storms the primal spirit of battle, and woe to those who face their rage.","role": "Barbarians excel in combat, possessing the martial prowess and fortitude to take on foes seemingly far superior to themselves. With rage granting them boldness and daring beyond that of most other warriors, barbarians charge furiously into battle and ruin all who would stand in their way.","alignment": "Any nonlawful.","hit die": "d12","parent classes": "","class skills": "Acrobatics (Dex), Climb (Str), Craft (Int), Handle Animal (Cha), Intimidate (Cha), Knowledge (nature) (Int), Perception (Wis), Ride (Dex), Survival (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "core","cast ability": "","starting wealth": "3d6","average": 105},
{"class": "Bard","description": "Untold wonders and secrets exist for those skillful enough to discover them. Through cleverness, talent, and magic, these cunning few unravel the wiles of the world, becoming adept in the arts of persuasion, manipulation, and inspiration. Typically masters of one or many forms of artistry, bards possess an uncanny ability to know more than they should and use what they learn to keep themselves and their allies ever one step ahead of danger. Bards are quick-witted and captivating, and their skills might lead them down many paths, be they gamblers or jacks-of-all-trades, scholars or performers, leaders or scoundrels, or even all of the above. For bards, every day brings its own opportunities, adventures, and challenges, and only by bucking the odds, knowing the most, and being the best might they claim the treasures of each.","role": "Bards capably confuse and confound their foes while inspiring their allies to ever-greater daring. While accomplished with both weapons and magic, the true strength of bards lies outside melee, where they can support their companions and undermine their foes without fear of interruptions to their performances.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Disguise (Cha), Escape Artist (Dex), Intimidate (Cha), Knowledge (all) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Spellcraft (Int), Stealth (Dex), Use Magic Device (Cha)","skill ranks": 6,"prestige": "no","requirements": "","class type": "core","cast ability": "cha","starting wealth": "3d6","average": 105},
{"class": "Cleric","description": "In faith and the miracles of the divine, many find a greater purpose. Called to serve powers beyond most mortal understanding, all priests preach wonders and provide for the spiritual needs of their people. Clerics are more than mere priests, though; these emissaries of the divine work the will of their deities through strength of arms and the magic of their gods. Devoted to the tenets of the religions and philosophies that inspire them, these ecclesiastics quest to spread the knowledge and influence of their faith. Yet while they might share similar abilities, clerics prove as different from one another as the divinities they serve, with some offering healing and redemption, others judging law and truth, and still others spreading conflict and corruption. The ways of the cleric are varied, yet all who tread these paths walk with the mightiest of allies and bear the arms of the gods themselves.","role": "More than capable of upholding the honor of their deities in battle, clerics often prove stalwart and capable combatants. Their true strength lies in their capability to draw upon the power of their deities, whether to increase their own and their allies' prowess in battle, to vex their foes with divine magic, or to lend healing to companions in need.\\nAs their powers are influenced by their faith, all clerics must focus their worship upon a divine source. While the vast majority of clerics revere a specific deity, a small number dedicate themselves to a divine concept worthy of devotion—such as battle, death, justice, or knowledge—free of a deific abstraction. (Work with your GM if you prefer this path to selecting a specific deity.)","alignment": "A cleric's alignment must be within one step of her deity's, along either the law/chaos axis or the good/evil axis (see Additional Rules).","hit die": "d8","parent classes": "","class skills": "Appraise (Int), Craft (Int), Diplomacy (Cha), Heal (Wis), Knowledge (arcana) (Int), Knowledge (history) (Int), Knowledge (nobility) (Int), Knowledge (planes) (Int), Knowledge (religion) (Int), Linguistics (Int), Profession (Wis), Sense Motive (Wis), Spellcraft (Int)","skill ranks": 2,"prestige": "no","requirements": "","class type": "core","cast ability": "wis","starting wealth": "4d6","average": 140},
{"class": "Druid","description": "Within the purity of the elements and the order of the wilds lingers a power beyond the marvels of civilization. Furtive yet undeniable, these primal magics are guarded over by servants of philosophical balance known as druids. Allies to beasts and manipulators of nature, these often misunderstood protectors of the wild strive to shield their lands from all who would threaten them and prove the might of the wilds to those who lock themselves behind city walls. Rewarded for their devotion with incredible powers, druids gain unparalleled shape-shifting abilities, the companionship of mighty beasts, and the power to call upon nature's wrath. The mightiest temper powers akin to storms, earthquakes, and volcanoes with primeval wisdom long abandoned and forgotten by civilization.","role": "While some druids might keep to the fringe of battle, allowing companions and summoned creatures to fight while they confound foes with the powers of nature, others transform into deadly beasts and savagely wade into combat. Druids worship personifications of elemental forces, natural powers, or nature itself. Typically this means devotion to a nature deity, though druids are just as likely to revere vague spirits, animalistic demigods, or even specific awe-inspiring natural wonders.","alignment": "Any neutral.","hit die": "d8","parent classes": "","class skills": "Climb (Str), Craft (Int), Fly (Dex), Handle Animal (Cha), Heal (Wis), Knowledge (geography) (Int), Knowledge (nature) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Spellcraft (Int), Survival (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "core","cast ability": "wis","starting wealth": "2d6","average": 70},
{"class": "Fighter","description": "Some take up arms for glory, wealth, or revenge. Others do battle to prove themselves, to protect others, or because they know nothing else. Still others learn the ways of weaponcraft to hone their bodies in battle and prove their mettle in the forge of war. Lords of the battlefield, fighters are a disparate lot, training with many weapons or just one, perfecting the uses of armor, learning the fighting techniques of exotic masters, and studying the art of combat, all to shape themselves into living weapons. Far more than mere thugs, these skilled warriors reveal the true deadliness of their weapons, turning hunks of metal into arms capable of taming kingdoms, slaughtering monsters, and rousing the hearts of armies. Soldiers, knights, hunters, and artists of war, fighters are unparalleled champions, and woe to those who dare stand against them.","role": "Fighters excel at combat, defeating their enemies, controlling the flow of battle, and surviving such sorties themselves. While their specific weapons and methods grant them a wide variety of tactics, few can match fighters for sheer battle prowess.","alignment": "Any.","hit die": "d10","parent classes": "","class skills": "Climb (Str), Craft (Int), Handle Animal (Cha), Intimidate (Cha), Knowledge (dungeoneering) (Int), Knowledge (engineering) (Int), Profession (Wis), Ride (Dex), Survival (Wis), Swim (Str)","skill ranks": 2,"prestige": "no","requirements": "","class type": "core","cast ability": "","starting wealth": "5d6","average": 175},
{"class": "Monk","description": "For the truly exemplary, martial skill transcends the battlefield—it is a lifestyle, a doctrine, a state of mind. These warrior-artists search out methods of battle beyond swords and shields, finding weapons within themselves just as capable of crippling or killing as any blade. These monks (so called since they adhere to ancient philosophies and strict martial disciplines) elevate their bodies to become weapons of war, from battle-minded ascetics to self-taught brawlers. Monks tread the path of discipline, and those with the will to endure that path discover within themselves not what they are, but what they are meant to be.","role": "Monks excel at overcoming even the most daunting perils, striking where it's least expected, and taking advantage of enemy vulnerabilities. Fleet of foot and skilled in combat, monks can navigate any battlefield with ease, aiding allies wherever they are needed most.","alignment": "Any lawful.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Climb (Str), Craft (Int), Escape Artist (Dex), Intimidate (Cha), Knowledge (history) (Int), Knowledge (religion) (Int), Perception (Wis), Perform (Cha), Profession (Wis), Ride (Dex), Sense Motive (Wis), Stealth (Dex), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "core","cast ability": "","starting wealth": "1d6","average": 35},
{"class": "Paladin","description": "Through a select, worthy few shines the power of the divine. Called paladins, these noble souls dedicate their swords and lives to the battle against evil. Knights, crusaders, and law-bringers, paladins seek not just to spread divine justice but to embody the teachings of the virtuous deities they serve. In pursuit of their lofty goals, they adhere to ironclad laws of morality and discipline. As reward for their righteousness, these holy champions are blessed with boons to aid them in their quests: powers to banish evil, heal the innocent, and inspire the faithful. Although their convictions might lead them into conflict with the very souls they would save, paladins weather endless challenges of faith and dark temptations, risking their lives to do right and fighting to bring about a brighter future.","role": "Paladins serve as beacons for their allies within the chaos of battle. While deadly opponents of evil, they can also empower goodly souls to aid in their crusades. Their magic and martial skills also make them well suited to defending others and blessing the fallen with the strength to continue fighting.","alignment": "Lawful good.","hit die": "d10","parent classes": "","class skills": "Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Heal (Wis), Knowledge (nobility) (Int), Knowledge (religion) (Int), Profession (Wis), Ride (Dex), Sense Motive (Wis), Spellcraft (Int)","skill ranks": 2,"prestige": "no","requirements": "","class type": "core","cast ability": "cha","starting wealth": "5d6","average": 175},
{"class": "Ranger","description": "For those who relish the thrill of the hunt, there are only predators and prey. Be they scouts, trackers, or bounty hunters, rangers share much in common: unique mastery of specialized weapons, skill at stalking even the most elusive game, and the expertise to defeat a wide range of quarries. Knowledgeable, patient, and skilled hunters, these rangers hound man, beast, and monster alike, gaining insight into the way of the predator, skill in varied environments, and ever more lethal martial prowess. While some track man-eating creatures to protect the frontier, others pursue more cunning game, even fugitives among their own people.","role": "Rangers are deft skirmishers, either in melee or at range, capable of skillfully dancing in and out of battle. Their abilities allow them to deal significant harm to specific types of foes, but their skills are valuable against all manner of enemies.","alignment": "Any.","hit die": "d10","parent classes": "","class skills": "Climb (Str), Craft (Int), Handle Animal (Cha), Heal (Wis), Intimidate (Cha), Knowledge (dungeoneering) (Int), Knowledge (geography) (Int), Knowledge (nature) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Spellcraft (Int), Stealth (Dex), Survival (Wis), Swim (Str)","skill ranks": 6,"prestige": "no","requirements": "","class type": "core","cast ability": "wis","starting wealth": "5d6","average": 175},
{"class": "Rogue","description": "Life is an endless adventure for those who live by their wits. Ever just one step ahead of danger, rogues bank on their cunning, skill, and charm to bend fate to their favor. Never knowing what to expect, they prepare for everything, becoming masters of a wide variety of skills, training themselves to be adept manipulators, agile acrobats, shadowy stalkers, or masters of any of dozens of other professions or talents. Thieves and gamblers, fast talkers and diplomats, bandits and bounty hunters, and explorers and investigators all might be considered rogues, as well as countless other professions that rely upon wits, prowess, or luck. Although many rogues favor cities and the innumerable opportunities of civilization, some embrace lives on the road, journeying far, meeting exotic people, and facing fantastic danger in pursuit of equally fantastic riches. In the end, any who desire to shape their fates and live life on their own terms might come to be called rogues.","role": "Rogues excel at moving about unseen and catching foes unaware, and tend to avoid head-to-head combat. Their varied skills and abilities allow them to be highly versatile, with great variations in expertise existing between different rogues. Most, however, excel in overcoming hindrances of all types, from unlocking doors and disarming traps to outwitting magical hazards and conning dull-witted opponents.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Disable Device (Dex), Disguise (Cha), Escape Artist (Dex), Intimidate (Cha), Knowledge (dungeoneering) (Int), Knowledge (local) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Stealth (Dex), Swim (Str), Use Magic Device (Cha)","skill ranks": 8,"prestige": "no","requirements": "","class type": "core","cast ability": "","starting wealth": "4d6","average": 140},
{"class": "Sorcerer","description": "Scions of innately magical bloodlines, the chosen of deities, the spawn of monsters, pawns of fate and destiny, or simply flukes of fickle magic, sorcerers look within themselves for arcane prowess and draw forth might few mortals can imagine. Emboldened by lives ever threatening to be consumed by their innate powers, these magic-touched souls endlessly indulge in and refine their mysterious abilities, gradually learning how to harness their birthright and coax forth ever greater arcane feats. Just as varied as these innately powerful spellcasters' abilities and inspirations are the ways in which they choose to utilize their gifts. While some seek to control their abilities through meditation and discipline, becoming masters of their fantastic birthright, others give in to their magic, letting it rule their lives with often explosive results. Regardless, sorcerers live and breathe that which other spellcasters devote their lives to mastering, and for them magic is more than a boon or a field of study; it is life itself.","role": "Sorcerers excel at casting a selection of favored spells frequently, making them powerful battle mages. As they become familiar with a specific and ever-widening set of spells, sorcerers often discover new and versatile ways of making use of magics other spellcasters might overlook. Their bloodlines also grant them additional abilities, assuring that no two sorcerers are ever quite alike.","alignment": "Any.","hit die": "d6","parent classes": "","class skills": "Appraise (Int), Bluff (Cha), Craft (Int), Fly (Dex), Intimidate (Cha), Knowledge (arcana) (Int), Profession (Wis), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 2,"prestige": "no","requirements": "","class type": "core","cast ability": "cha","starting wealth": "2d6","average": 70},
{"class": "Wizard","description": "Beyond the veil of the mundane hide the secrets of absolute power. The works of beings beyond mortals, the legends of realms where gods and spirits tread, the lore of creations both wondrous and terrible—such mysteries call to those with the ambition and the intellect to rise above the common folk to grasp true might. Such is the path of the wizard. These shrewd magic-users seek, collect, and covet esoteric knowledge, drawing on cultic arts to work wonders beyond the abilities of mere mortals. While some might choose a particular field of magical study and become masters of such powers, others embrace versatility, reveling in the unbounded wonders of all magic. In either case, wizards prove a cunning and potent lot, capable of smiting their foes, empowering their allies, and shaping the world to their every desire.","role": "While universalist wizards might study to prepare themselves for any manner of danger, specialist wizards research schools of magic that make them exceptionally skilled within a specific focus. Yet no matter their specialty, all wizards are masters of the impossible and can aid their allies in overcoming any danger.","alignment": "Any.","hit die": "d6","parent classes": "","class skills": "Appraise (Int), Craft (Int), Fly (Dex), Knowledge (all) (Int), Linguistics (Int), Profession (Wis), Spellcraft (Int)","skill ranks": 2,"prestige": "no","requirements": "","class type": "core","cast ability": "int","starting wealth": "2d6","average": 70},
{"class": "Arcanist","description": "Some spellcasters seek the secrets of magic, pursuing the power to make the impossible possible. Others are born with magic in their blood, commanding unbelievable forces as effortlessly as they breathe. Yet still others seek to meld the science of arcane scholars with the natural might of innate casters. These arcanists seek to discover the mysterious laws of magic and through will and expertise bend those forces to their whims. Arcanists are the shapers and tinkers of the arcane world, and no magic can resist their control.","role": "Arcanists are scholars of all things magical. They constantly seek out new forms of magic to discover how they work, and in many cases, to collect the energy of such magic for their own uses. Many arcanists are seen as reckless, more concerned with the potency of magic than the ramifications of unleashing such power.","alignment": "Any.","hit die": "d6","parent classes": "sorcerer, wizard","class skills": "Appraise (Int), Craft (Int), Fly (Dex), Knowledge (all) (Int), Linguistics (Int), Profession (Wis), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 2,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "int","starting wealth": "2d6","average": 70},
{"class": "Bloodrager","description": "While many ferocious combatants can tap into a deep reservoir of buried rage, bloodragers have an intrinsic power that seethes within. Like sorcerers, bloodragers' veins surge with arcane power. While sorcerers use this power for spellcasting, bloodragers enter an altered state in which their bloodline becomes manifest, where the echoes of their strange ancestry lash out with devastating power. In these states, bloodragers can cast some arcane spells instinctively. The bloodrager's magic is as fast, violent, and seemingly unstoppable as their physical prowess.","role": "Masters of the battlefield, bloodragers unleash fearful carnage on their enemies using their bloodlines and combat prowess. The bloodrager's place is on the front lines, right in his enemies' faces, supplying tremendous martial force bolstered by a trace of arcane magic.","alignment": "Any.","hit die": "d10","parent classes": "barbarian, sorcerer","class skills": "Acrobatics (Dex), Climb (Str), Craft (Int), Handle Animal (Cha), Intimidate (Cha), Knowledge (arcana) (Int), Perception (Wis), Ride (Dex), Spellcraft (Int), Survival (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "cha","starting wealth": "3d6","average": 105},
{"class": "Brawler","description": "Deadly even with nothing in her hands, a brawler eschews the fighter's heavy armor and the monk's mysticism, focusing instead on perfecting many styles of brutal unarmed combat. Versatile, agile, and able to adapt to most enemy attacks, a brawler's body is a powerful weapon.","role": "Brawlers are maneuverable and well suited for creating flanking situations or dealing with lightly armored enemies, as well as quickly adapting to a rapidly changing battlefield.","alignment": "Any.","hit die": "d10","parent classes": "fighter, monk","class skills": "Acrobatics (Dex), Climb (Str), Craft (Int), Escape Artist (Dex), Handle Animal (Cha), Intimidate (Cha), Knowledge (dungeoneering) (Int), Knowledge (local) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Sense Motive (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "","starting wealth": "3d6","average": 105},
{"class": "Hunter","description": "Hunters are warriors of the wild that have forged close bonds with trusted animal companions. They focus their tactics on fighting alongside their companion animals, making a formidable team of two. Able to cast a wide variety of nature spells and take on the abilities and attributes of beasts, hunters magically improve both themselves and their animal companions.","role": "Hunters can adapt their tactics to many kinds of opponents, and they cherish their highly trained animal companions. As a team, the hunter and her companion can react to danger with incredible speed, making them excellent scouts, explorers, and saboteurs.","alignment": "Any neutral.","hit die": "d8","parent classes": "druid, ranger","class skills": "Climb (Str), Craft (Int), Handle Animal (Cha), Heal (Wis), Intimidate (Cha), Knowledge (dungeoneering) (Int), Knowledge (geography) (Int), Knowledge (nature) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Spellcraft (Int), Stealth (Dex), Survival (Wis), Swim (Str)","skill ranks": 6,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "wis","starting wealth": "4d6","average": 140},
{"class": "Investigator","description": "Whether on the trail of a fugitive, a long-lost treasure trove, or a criminal mastermind, an investigator is motivated by an intense curiosity about the world and uses knowledge of it as a weapon. Mixing gumption and learnedness into a personal alchemy of daring, investigators are full of surprises. Observing the world around them, they gain valuable knowledge about the situation they're in, process that information using inspiration and deduction, and cut to the quick of the matter in unexpected ways. Investigators are always evaluating situations they encounter, sizing up potential foes, and looking out for secret dangers, all while using their vast knowledge and powers of perception to find solutions to the most perplexing problems.","role": "Investigators live to solve mysteries and find inventive ways to get out of jams. They serve as advisors and support for their adventuring parties, but can take center stage when knowledge and cunning are needed. No slouches in battle, they know how to make surprise attacks and use inspiration to bring those attacks home.","alignment": "Any.","hit die": "d8","parent classes": "alchemist, rogue","class skills": "Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Disable Device (Dex), Disguise (Cha), Escape Artist (Dex), Heal (Wis), Intimidate (Cha), Knowledge (all) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Spellcraft (Int), Stealth (Dex), Use Magic Device (Cha)","skill ranks": 6,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "","starting wealth": "3d6","average": 105},
{"class": "Shaman","description": "While some heroes speak to gods or consort with otherworldly muses, shamans commune with the spirits of the world and the energies that exist in every living thing. These divine adventurers draw upon their power to shape the world and expand the influence of their spiritual patrons. Shamans have strong ties to natural spirits. They form powerful bonds with particular spirits, and as their power grows they learn to call upon other spirits in times of need.","role": "Shamans make for potent divine spellcasters, capable of using divine spells and the power of their spirits to aid their allies and destroy their foes. While they aren't the healers that clerics are, they can fill that role when needed.","alignment": "Any.","hit die": "d8","parent classes": "oracle, witch","class skills": "Craft (Int), Diplomacy (Cha), Fly (Dex), Handle Animal (Cha), Heal (Wis), Knowledge (nature) (Int), Knowledge (planes) (Int), Knowledge (religion) (Int), Profession (Wis), Ride (Dex), Spellcraft (Int), Survival (Wis)","skill ranks": 4,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "wis","starting wealth": "3d6","average": 105},
{"class": "Skald","description": "Skalds are poets, historians, and keepers of lore who use their gifts for oration and song to inspire allies into a frenzied rage. They balance a violent spirit with the veneer of civilization, recording events such as heroic battles and the deeds of great leaders, enhancing these stories in the retelling to earn bloodier victories in combat. The poetry of a skald is nuanced and often has multiple overlapping meanings, and he applies similar talents to emulate magic from other spellcasters.","role": "A skald inspires his allies, and often presses forward to fight enemies in melee. Outside combat, he's useful as a healer and a scholar, less versatile but more durable than a bard.","alignment": "Any.","hit die": "d8","parent classes": "barbarian, bard","class skills": "Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Escape Artist (Dex), Handle Animal (Cha), Intimidate (Cha), Knowledge (all) (Int), Linguistics (Int), Perception (Wis), Perform (oratory, percussion, sing, string, wind) (Cha), Profession (Wis), Ride (Dex), Sense Motive (Wis), Spellcraft (Int), Swim (Str), Use Magic Device (Cha)","skill ranks": 4,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "cha","starting wealth": "3d6","average": 105},
{"class": "Slayer","description": "Skilled at tracking down targets, slayers are consummate hunters, living for the chase and the deadly stroke that brings it to a close. Slayers spend most of their time honing their weapon skills, studying the habits and anatomy of foes, and practicing combat maneuvers.","role": "The slayer is elusive, and adept at finding the opportune time and location to strike. Combining the deadliest talents of rangers and rogues, a slayer's abilities are all about getting into combat, dealing with a target, and getting back out again.","alignment": "Any.","hit die": "d10","parent classes": "ranger, rogue","class skills": "Acrobatics (Dex), Bluff (Cha), Climb (Str), Craft (Int), Disguise (Cha), Heal (Wis), Intimidate (Cha), Knowledge (dungeoneering) (Int), Knowledge (geography) (Int), Knowledge (local) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Sense Motive (Wis), Stealth (Dex), Survival (Wis), Swim (Str)","skill ranks": 6,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "","starting wealth": "5d6","average": 175},
{"class": "Swashbuckler","description": "Whereas many warriors enter battle encased in suits of armor and wielding large and powerful weapons, swashbucklers rely on speed, agility, and panache. Swashbucklers dart in and out of the fray, wearing down opponents with lunges and feints, all while foiling powerful attacks against themselves with a flick of the wrist and a flash of the blade. Their deft parries and fatal ripostes are carnage elevated to an art form. Some swashbucklers may be arrogant and devil-may-care, but behind this veneer lie people deeply dedicated to their craft. Those of smaller races are particularly driven to prove that the right mix of discipline and daring is the perfect counter to size and strength, and they enjoy nothing more than taking down lumbering brutes and bullies.","role": "Combining fancy footwork with quick and precise lunges, swashbucklers dart in and out of battle, harassing and thwarting their opponents. These agile combatants serve as protectors for spellcasters and flanking partners for rogues and slayers, while waiting for the opportunity to demonstrate panache and score the killing blow on some lumbering hulk. Swashbucklers often face death with wry humor, mocking it with jabbing wit.","alignment": "Any.","hit die": "d10","parent classes": "fighter, gunslinger","class skills": "Acrobatics (Dex), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Escape Artist (Dex), Intimidate (Cha), Knowledge (local) (Int), Knowledge (nobility) (Int), Perception (Wis), Perform (Cha), Profession (Wis), Ride (Dex), Sense Motive (Wis), Sleight of Hand (Dex), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "","starting wealth": "5d6","average": 175},
{"class": "Warpriest","description": "Capable of calling upon the power of the gods in the form of blessings and spells, warpriests blend divine magic with martial skill. They are unflinching bastions of their faith, shouting gospel as they pummel foes into submission, and never shy away from a challenge to their beliefs. While clerics might be subtle and use diplomacy to accomplish their aims, warpriests aren't above using violence whenever the situation warrants it. In many faiths, warpriests form the core of the church's martial forces—reclaiming lost relics, rescuing captured clergy, and defending the church's tenets against all challenges.","role": "Warpriests can serve as capable healers or spellcasters, calling upon their divine powers from the center of the fight, where their armor and martial skills are put to the test.","alignment": "A warpriest's alignment must be within one step of his deity's, along either the law/chaos axis or the good/evil axis (Core Rulebook 166).","hit die": "d8","parent classes": "cleric, fighter","class skills": "Climb (Str), Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Heal (Wis), Intimidate (Cha), Knowledge (engineering) (Int), Knowledge (religion) (Int), Profession (Wis), Ride (Dex), Sense Motive (Wis), Spellcraft (Int), Survival (Wis), Swim (Str)","skill ranks": 2,"prestige": "no","requirements": "","class type": "hybrid","cast ability": "wis","starting wealth": "5d6","average": 175},
{"class": "Alchemist","description": "Whether secreted away in a smoky basement laboratory or gleefully experimenting in a well-respected school of magic, the alchemist is often regarded as being just as unstable, unpredictable, and dangerous as the concoctions he brews. While some creators of alchemical items content themselves with sedentary lives as merchants, providing tindertwigs and smokesticks, the true alchemist answers a deeper calling. Rather than cast magic like a spellcaster, the alchemist captures his own magic potential within liquids and extracts he creates, infusing his chemicals with virulent power to grant him impressive skill with poisons, explosives, and all manner of self-transformative magic.","role": "The alchemist's reputation is not softened by his exuberance (some would say dangerous recklessness) in perfecting his magical extracts and potion-like creations, infusing these substances with magic siphoned from his aura and using his own body as experimental stock. Nor is it mollified by the alchemist's almost gleeful passion for building explosive bombs and discovering strange new poisons and methods for their use. These traits, while making him a liability and risk for most civilized organizations and institutions of higher learning, seem to fit quite well with most adventuring groups.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Appraise (Int), Craft (any) (Int), Disable Device (Dex), Fly (Dex), Heal (Wis), Knowledge (arcana) (Int), Knowledge (nature) (Int), Perception (Wis), Profession (Wis), Sleight of Hand (Dex), Spellcraft (Int), Survival (Wis), Use Magic Device (Cha)","skill ranks": 4,"prestige": "no","requirements": "","class type": "base","cast ability": "","starting wealth": "3d6","average": 105},
{"class": "Cavalier","description": "While many warriors strive to perfect their art, spending all of their time honing their skill at martial arms, others spend as much effort dedicating themselves to a cause. These warriors, known as cavaliers, swear themselves to a purpose, serving it above all else. Cavaliers are skilled at fighting from horseback, and are often found charging across a battlefield, with the symbol of their order trailing on a long, fluttering banner. The cavalier's true power comes from the conviction of his ideals, the oaths that he swears, and the challenges he makes.","role": "Cavaliers tend to marshal forces on the battlefield, using their mounted talents and challenges to control the flow of the fight. Outside of battle, cavaliers can be found advancing their cause through diplomacy and, if needed, subterfuge. The cavalier is no stranger to courtly intrigue and can hold his own in even the most delicate of social situations.","alignment": "Any.","hit die": "d10","parent classes": "","class skills": "Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Intimidate (Cha), Profession (Wis), Ride (Dex), Sense Motive (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "base","cast ability": "","starting wealth": "5d6","average": 175},
{"class": "Inquisitor","description": "Grim and determined, the inquisitor roots out enemies of the faith, using trickery and guile when righteousness and purity is not enough. Although inquisitors are dedicated to a deity, they are above many of the normal rules and conventions of the church. They answer to their deity and their own sense of justice alone, and are willing to take extreme measures to meet their goals.","role": "Inquisitors tend to move from place to place, chasing down enemies and researching emerging threats. As a result, they often travel with others, if for no other reason than to mask their presence. Inquisitors work with members of their faith whenever possible, but even such allies are not above suspicion.","alignment": "An inquisitor's alignment must be within one step of her deity's, along either the law/chaos axis or the good/evil axis.","hit die": "d8","parent classes": "","class skills": "Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Disguise (Cha), Heal (Wis), Intimidate (Cha), Knowledge (arcana) (Int), Knowledge (dungeoneering) (Int), Knowledge (nature) (Int), Knowledge (planes) (Int), Knowledge (religion) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Sense Motive (Wis), Spellcraft (Int), Stealth (Dex), Survival (Wis), Swim (Str)","skill ranks": 6,"prestige": "no","requirements": "","class type": "base","cast ability": "","starting wealth": "4d6","average": 140},
{"class": "Oracle","description": "Although the gods work through many agents, perhaps none is more mysterious than the oracle. These divine vessels are granted power without their choice, selected by providence to wield powers that even they do not fully understand. Unlike a cleric, who draws her magic through devotion to a deity, oracles garner strength and power from many sources, namely those patron deities who support their ideals. Instead of worshiping a single source, oracles tend to venerate all of the gods that share their beliefs. While some see the powers of the oracle as a gift, others view them as a curse, changing the life of the chosen in unforeseen ways.","role": "Oracles do not usually associate with any one church or temple, instead preferring to strike out on their own, or with a small group of like-minded individuals. Oracles typically use their spells and revelations to further their understanding of their mystery, be it through fighting mighty battles or tending to the poor and sick.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Craft (Int), Diplomacy (Cha), Heal (Wis), Knowledge (history) (Int), Knowledge (planes) (Int), Knowledge (religion) (Int), Profession (Wis), Sense Motive (Wis), Spellcraft (Int)","skill ranks": 4,"prestige": "no","requirements": "","class type": "base","cast ability": "","starting wealth": "3d6","average": 105},
{"class": "Summoner","description": "While many who dabble in the arcane become adept at beckoning monsters from the farthest reaches of the planes, none are more skilled at it than the summoner. This practitioner of the arcane arts forms a close bond with one particular outsider, known as an eidolon, who gains power as the summoner becomes more proficient at his summoning. Over time, the two become linked, eventually even sharing a shard of the same soul. But this power comes with a price: the summoner's spells and abilities are limited due to his time spent enhancing the power and exploring the nature of his eidolon.","role": "Summoners spend much of their time exploring the arcane arts alongside their eidolons. While their power comes from within, they rely heavily on their eidolon companions in dangerous situations. While a summoner and his eidolon function as individuals, their true power lies in what they can accomplish together.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Craft (Int), Fly (Dex), Handle Animal (Cha), Knowledge (all) (Int), Linguistics (Int), Profession (Wis), Ride (Dex), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 2,"prestige": "no","requirements": "","class type": "base","cast ability": "","starting wealth": "2d6","average": 70},
{"class": "Witch","description": "Some gain power through study, some through devotion, others through blood, but the witch gains power from her communion with the unknown. Generally feared and misunderstood, the witch draws her magic from a pact made with an otherworldly power. Communing with that source, using her familiar as a conduit, the witch gains not only a host of spells, but a number of strange abilities known as hexes. As a witch grows in power, she might learn about the source of her magic, but some remain blissfully unaware. Some are even afraid of that source, fearful of what it might be or where its true purposes lie.","role": "While many witches are recluses, living on the edge of civilization, some live within society, openly or in hiding. The blend of witches' spells makes them adept at filling a number of different roles, from seer to healer, and their hexes grant them a number of abilities that are useful in a fight. Some witches travel about, seeking greater knowledge and better understanding of the mysterious powers that guide them.","alignment": "Any.","hit die": "d6","parent classes": "","class skills": "Craft (Int), Fly (Dex), Heal (Wis), Intimidate (Cha), Knowledge (arcana) (Int), Knowledge (history) (Int), Knowledge (nature) (Int), Knowledge (planes) (Int), Profession (Wis), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 2,"prestige": "no","requirements": "","class type": "base","cast ability": "","starting wealth": "3d6","average": 105},
{"class": "Battle Herald","description": "In every army there are leaders who surpass the average cold-hearted mercenary, battle-scarred veteran, or wizened drill instructor, not so much in their skill at arms but in their ability to inspire and lead others. Battle heralds are just such captains—skilled warriors to be sure, but ones who have honed the art of leadership to a keen edge and keep it as ready as their sword as a means to victory. Battle heralds tap into reservoirs of courage, skill, bravery, and perseverance that those who serve with them never knew they had, and their allies often find themselves ascending the mount of triumph following the battle herald's glorious (if often tattered) banner.","role": "","alignment": "","hit die": "d10","parent classes": "","class skills": "Bluff (Cha), Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Heal (Wis), Intimidate (Cha), Knowledge (engineering) (Int), Knowledge (history) (Int), Knowledge (local) (Int), Knowledge (nobility) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Sense Motive (Wis)","skill ranks": 4,"prestige": "yes","requirements": "Base Attack Bonus: +4\\nSpecial: Challenge and inspire courage class features.\\nSkills: Diplomacy 5 ranks, Intimidate 5 ranks, Perform (oratory) 5 ranks, Profession (soldier) 2 ranks.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Holy Vindicator","description": "Many faiths have within their membership an order of the church militant, be they holy knights or dark warriors, who put their lives and immortal souls on the line for their faith. They are paragons of battle, eschewing sermons for steel. These men and women are living conduits of divine power, down to their very blood, which they happily shed in a moment if it brings greater glory to their deity or judgment upon heretics, infidels, and all enemies of the faith.\\nHoly vindicators are usually clerics or fighter/clerics, though many paladins (or even paladin/clerics) are drawn to this class as well. In all cases, the class offers a further opportunity to fuse and refine their martial and ministerial powers and role.","role": "The holy vindicator has substantial spellcasting ability, though not so much as a focused cleric or paladin. His combat skills are considerable and his healing powers prodigious, and those whose religious views align well with the vindicator will find a ready ally.","alignment": "While lawful vindicators are somewhat more common, vindicators may be of any alignment.","hit die": "d10","parent classes": "","class skills": "Climb (Str), Heal (Wis), Intimidate (Cha), Knowledge (planes) (Int), Knowledge (religion) (Int), Ride (Dex), Sense Motive (Wis), Spellcraft (Int), Swim (Str)","skill ranks": 2,"prestige": "yes","requirements": "Base Attack Bonus: +5.\\nSpecial: Channel energy class feature.\\nSkills: Knowledge (religion) 5 ranks.\\nFeats: Alignment Channel or Elemental Channel.\\nSpells: Able to cast 1st-level divine spells.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Horizon Walker","description": "Those whose wanderlust drives them to push the boundary of safe environments sometimes seek the calling of the horizon walker. Horizon walkers are masters of travel, always seeking to find the safe ways through inhospitable terrain. They are comfortable in places others speak of only in hushed whispers, and they can both venture forth onto untrod paths themselves and guide the less-traveled through such hazardous lands.\\nThough rangers are most likely to be attracted to the ever-wandering life common to horizon walkers, barbarians, fighters, and rogues have also been known to find it appealing. Horizon walkers are most common in areas on the edge of civilization, where they can easily spend time away from the known and boring streets of settled lands.","role": "Horizon walkers have the accuracy and resilience to face frontline combat. They also have the skills and abilities to make excellent scouts, often taking the role of the first member of a group into danger and the last one out. Of course, walkers shine when adventuring in areas that match their many favored terrains, but many of the tricks they pick up in specific regions have application in a wide range of situations, allowing a horizon walker to be more mobile and resourceful than typical combatants.","alignment": "Anyone can crave new vistas and constant travel, and thus a horizon walker can be of any alignment.","hit die": "d10","parent classes": "","class skills": "Climb (Str), Diplomacy (Cha), Handle Animal (Cha), Knowledge (geography) (Int), Knowledge (nature) (Int), Knowledge (planes) (Int), Linguistics (Int), Perception (Wis), Stealth (Dex), Survival (Wis), Swim (Str)","skill ranks": 6,"prestige": "yes","requirements": "Skills: Knowledge (geography) 6 ranks.\\nFeats: Endurance.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Master Chymist","description": "When alchemists blithely use mutagens to turn themselves into hulking creatures of muscle and reflex, civilized folk often turn their heads and mutter that such transformations must have a price. For a few alchemists, that price is transformation into a master chymist, a creature able to take a monstrous brute form as an act of will.\\nMaster chymists become two personalities sharing a single body. Both the hulking \"mutagenic form\" of alchemical prowess and the original alchemist who created it think of themselves as the true form, and they must learn to work together to achieve their joint goals. More often than not, master chymists eventually become their mutagenic form, and the original alchemist's body and mind may only be brought forth when required by social custom or a need for obscurity and stealth arises. Unfortunately, the mutagenic form of a master chymist is often a more violent, unforgiving personality (which can lead to conflict between the two versions of the same character).","role": "Master chymists are rarely accepted by society once their nature is revealed, and thus they have a strong motivation to keep on the move. Adventuring is one of the few activities that their monstrous form can be useful for, leading many to constantly explore dangerous areas on the edge of civilization. A master chymist's resilience and ability to combine bomb-throwing mayhem with up-close melee carnage is a great benefit to many adventuring parties, buying the master chymist allies who are at least willing to overlook her more distasteful features.","alignment": "A master chymist actually has two alignments (see the mutagenic form ability). The only restriction on these alignments is that they cannot be exactly the same.","hit die": "d10","parent classes": "","class skills": "Acrobatics (Dex), Climb (Str), Escape Artist (Dex), Intimidate (Cha), Knowledge (dungeoneering) (Int), Sense Motive (Wis), Stealth (Dex), Swim (Str)","skill ranks": 2,"prestige": "yes","requirements": "Spells: Ability to create 3rd-level extracts.\\nSpecial: Mutagen class feature, feral mutagen or infuse mutagen discovery.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Master Spy","description": "Unparalleled practitioners of deception, master spies rely on deceit and trickery over brawn and spells. A master spy is an expert at both magical and nonmagical means of evading detection, and quick-witted when it comes to improvisation. Master spies may serve countries or private interests, or sell their services to the highest bidder without a thought to long-term loyalty.\\nBards and rogues, with their wide range of skills, are particularly well suited for the demands of spying. Rogues can easily pass themselves off as members of most nonmagical professions (though playing an armored warrior impedes their natural abilities), while bluffing bards can impersonate a wide range of other spellcasters well enough to fool a casual observer. Versatility and adaptability are the watchwords for espionage, and successful master spies let others complete their deception for them, subtly drawing targets into their machinations.","role": "Master spies rarely work with others unless they are under cover. The special skills that serve them so well in the field ironically make them exceptional leaders, but a master spy's natural inclination toward secrecy pushes her away from the limelight. Note that a master spy among adventurers may not intend to betray them; armed heroes provide excellent cover for a master spy's true mission, whether or not they know the spy's intent.","alignment": "The practice of espionage demands discipline and a certain amount of moral and ethical flexibility; more master spies are neutral than lawful or chaotic.","hit die": "d8","parent classes": "","class skills": "Bluff (Cha), Diplomacy (Cha), Disable Device (Dex), Disguise (Cha), Escape Artist (Dex), Knowledge (all) (Int), Linguistics (Int), Perception (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Stealth (Dex), Use Magic Device (Cha)","skill ranks": 6,"prestige": "yes","requirements": "Feats: Deceitful, Iron Will.\\nSkills: Bluff 7 ranks, Disguise 7 ranks, Perception 5 ranks, Sense Motive 5 ranks.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Nature Warden","description": "Nature wardens are guardians of the wild places of the world, hunters and explorers par excellence, highly skilled in negotiating their way among the nonhuman inhabitants of the wild. Nature wardens befriend and train a beast of the wild as a companion, and some call wardens \"beastmasters\" because of these pets, but nature wardens are much more than tamers of wild things. They are experts at navigating the harsh brutality of nature's fury and making do with whatever tools and weapons present themselves, but they go beyond being hardy survivalists to become cunning tacticians with keen analytical minds, able to adapt and prepare for any situation and make the absolute best use of the advantages that any terrain or environment can afford them.\\nNature wardens are usually druids or ranger/druids, though occasional ranger/clerics with the Animal domain or even single-classed high-level rangers or multiclassed rangers explore this class.","role": "The nature warden is a master of wilderness environments and is at her most powerful in any of the variety of environments that she has studied. She and her animal companion form a potent team. They are excellent scouts and versatile warriors, able to supplement their skills with spells to fulfill almost any role.","alignment": "Nature wardens tend toward nonevil alignments, as many pursue their profession out of a desire to help and protect others. Occasionally evil wardens can be found turning the bitter realities of the wild upon their enemies or guarding natural sites tainted by dark fey.","hit die": "d8","parent classes": "","class skills": "Climb (Str), Handle Animal (Cha), Heal (Wis), Knowledge (geography) (Int), Knowledge (nature) (Int), Perception (Wis), Ride (Dex), Sense Motive (Wis), Survival (Wis), Swim (Str)","skill ranks": 4,"prestige": "yes","requirements": "Base Attack Bonus: +4.\\nSpecial: Animal companion class feature*, favored terrain class feature, wild empathy class feature.\\nSkills: Handle Animal 5 ranks, Knowledge (geography) 5 ranks, Knowledge (nature) 5 ranks, Survival 5 ranks.\\nSpells: Able to cast 2nd-level divine spells.\\n* An oracle of nature's bonded mount ability counts as an animal companion class ability for the purpose of this prestige class.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Rage Prophet","description": "Throughout the wilderness, there are those warriors whose powers are infused by the spirits, who see and hear into the world beyond and draw unthinkable reserves of power from it. They are the chosen of the gods, and they often hold status nearly equal to that of a chief or shaman in a typical tribe, or sometimes even exceeding this. Rage prophets can dispense advice through their communion with the spirits and ability to divine the future.\\nRage prophets are always barbarian/oracles, though some have levels in other classes as well. The most popular oracle mystery among rage prophets is that of battle, for skill in battle is respected in barbarian society, but oracles of all mysteries find their way into positions as war-chiefs, counselors, and leaders. Some rage prophets choose to live apart or to act as wandering champions, belonging to all tribes and none, following the lead of their spirit guides rather than the dictates of any one tribal chief or council. Though sometimes looked at askance by tribal leaders, these wanderers are popular with many barbarians, who see them as the perfect exemplars of the strength, virtue, and power of the free folk, owing nothing to anyone but the sky above, the earth beneath, and the spirits within.","role": "The rage prophet has considerable spellcasting ability, but it usually serves as a conduit to enhance his fighting prowess. His combat skills are considerable and his ability to keep himself going in any fight and to focus his physical rage into supernatural power gives him an unexpected boost in power and versatility to overcome any challenge.","alignment": "Rage prophets may be of any nonlawful alignment, but chaotic alignments are more common, as they are in the barbarian tribes from which they hail. Wandering rage prophets are usually chaotic, living apart from any tribe and the tribal structure of their heritage as they take up the adventuring life.","hit die": "d10","parent classes": "","class skills": "Climb (Str), Heal (Wis), Intimidate (Cha), Knowledge (history) (Int), Knowledge (religion) (Int), Sense Motive (Wis), Spellcraft (Int), Swim (Str)","skill ranks": 4,"prestige": "yes","requirements": "Base Attack Bonus: +5.\\nSpecial: Oracle's curse class feature, moment of clarity rage power.\\nSkills: Knowledge (religion) 5 ranks.\\nSpells: Able to cast 1st-level divine spells.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Stalwart Defender","description": "Drawn from the ranks of guards, knights, mercenaries, and thugs alike, stalwart defenders are masters of claiming an area and refusing to relinquish it. This behavior is more than a tactical decision for stalwart defenders; it's an obsessive, stubborn expression of the need to be undefeated. When stalwart defenders set themselves in a defensive stance, they place their whole effort into weathering whatever foe, conflict, or threat comes their way.\\nMost stalwart defenders come from the ranks of fighters, often those desiring to be better guards for friends and allies. Dwarves are particularly suited to the role, though stalwart defenders of all races exist. More rarely, barbarians take the path of the stalwart defender as a matter of pride, to overcome some perceived shortcoming. Such characters often seem to suffer from dual personalities, flinging themselves recklessly into combat one moment, then calmly fending off all attackers the next.","role": "Stalwart defenders are masters of melee combat, striving to prove that the best offense is a good defense. Stalwart defenders are normally found on the front lines of battle, holding a position to cover their allies, leaping into breaches of opposing formations and holding them open for others, and guarding more vulnerable allies by acting as mobile fortifications, stable points in the ever-changing chaos of battle.","alignment": "Anyone can be as stubborn as a rock and dedicated to holding one point no matter the cost, so stalwart defenders can be of any alignment. The dedication and practice required to learn the talents of a stalwart defender come more easily to characters with a strong respect for order and organization, however, so lawful stalwart defenders are much more common than chaotic ones.","hit die": "d12","parent classes": "","class skills": "Acrobatics (Dex), Climb (Str), Intimidate (Cha), Perception (Wis), Sense Motive (Wis)","skill ranks": 2,"prestige": "yes","requirements": "Base Attack Bonus: +7.\\nFeats: Dodge, Endurance, Toughness.\\nSpecial: Proficiency with light and medium armor.","class type": "advanced prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Arcane Archer","description": "Many who seek to perfect the use of the bow sometimes pursue the path of the arcane archer. Arcane archers are masters of ranged combat, as they possess the ability to strike at targets with unerring accuracy and can imbue their arrows with powerful spells. Arrows fired by arcane archers fly at weird and uncanny angles to strike at foes around corners, and can pass through solid objects to hit enemies that cower behind such cover. At the height of their power, arcane archers can fell even the most powerful foes with a single, deadly shot.\\nThose who have trained as both rangers and wizards excel as arcane archers, although other multiclass combinations are not unheard of. Arcane archers may be found wherever elves travel, but not all are allies of the elves. Many, particularly half-elven arcane archers, use elven traditions solely for their own gain, or worse, against the elves whose very traditions they adhere to.","role": "Arcane archers deal death from afar, winnowing down opponents while their allies rush into hand-to-hand combat. With their capacity to unleash hails of arrows on the enemy, they represent the pinnacle of ranged combat.","alignment": "Arcane archers can be of any alignment. Elf or half-elf arcane arches tend to be free-spirited and are rarely lawful. Similarly, it is uncommon for elven arcane archers to be evil, and overall the path of the arcane archer is more often pursued by good or neutral characters.","hit die": "d10","parent classes": "","class skills": "Perception (Wis), Ride (Dex), Stealth (Dex), Survival (Wis)","skill ranks": 4,"prestige": "yes","requirements": "Base Attack Bonus: +6.\\nFeats: Point Blank Shot, Precise Shot, Weapon Focus (longbow or shortbow).\\nSpells: Ability to cast 1st-level arcane spells.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Arcane Trickster","description": "Few can match the guile and craftiness of arcane tricksters. These prodigious thieves blend the subtlest aspects of the arcane with the natural cunning of the bandit and the scoundrel, using spells to enhance their natural thieving abilities. Arcane tricksters can pick locks, disarm traps, and lift purses from a safe distance using their magical legerdemain, and as often as not seek humiliation as a goal to triumph over their foes than more violent solutions.\\nThe path to becoming an arcane trickster is a natural progression for rogues who have supplemented their talents for theft with the study of the arcane. Multiclass rogue/sorcerers and rogue/bards are the most common arcane tricksters, although other combinations are possible. Arcane tricksters are most often found in large, cosmopolitan cities where their talents for magical larceny can be most effectively put to use, prowling the streets and stealing from the unwary.","role": "With their mastery of magic, arcane tricksters can make for even more subtle or confounding opponents than standard rogues. Ranged legerdemain enhances their skill as thieves, and their ability to make sneak attacks without flanking or as part of a spell can make arcane tricksters formidable damage-dealers.","alignment": "All arcane tricksters have a penchant for mischief and thievery, and are therefore never lawful. Although they sometimes acquire their magical abilities through the studious path of wizardry, their magical aptitude more often stems from a sorcerous bloodline. As such, many arcane tricksters are of a chaotic alignment.","hit die": "d6","parent classes": "","class skills": "Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Diplomacy (Cha), Disable Device (Int), Disguise (Cha), Escape Artist (Dex), Knowledge (all) (Int), Perception (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Spellcraft (Int), Stealth (Dex), Swim (Str)","skill ranks": 4,"prestige": "yes","requirements": "Alignment: Any nonlawful.\\nSkills: Disable Device 4 ranks, Escape Artist 4 ranks, Knowledge (arcana) 4 ranks.\\nSpells: Ability to cast mage hand and at least one arcane spell of 2nd level or higher.\\nSpecial: Sneak attack +2d6.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Assassin","description": "A mercenary undertaking his task with cold, professional detachment, the assassin is equally adept at espionage, bounty hunting, and terrorism. At his core, an assassin is an artisan, and his medium is death. Trained in a variety of killing techniques, assassins are among the most feared classes.\\nWhile nearly any class is capable of becoming an assassin, rogues suit the part more than any other, from both an ability viewpoint and an ideological one. Though they make excellent allies during combat, assassins excel in more clandestine situations, and the best assassins are the ones the victims never knew existed.","role": "Assassins tend to be loners by nature, seeing companions as liabilities at best. Sometimes an assassin's missions put him in the company of adventurers for long stretches at a time, but few people are comfortable trusting a professional assassin to watch their backs in a fight, and are more likely to let the emotionless killer scout ahead or help prepare ambushes.","alignment": "Due to its necessary selfishness and callous indifference toward taking lives, the assassin class attracts those with evil alignments more than any others. Because the profession requires a degree of self-discipline, chaotic characters are ill suited to becoming these shadowy killers. Neutral characters sometimes become assassins, frequently thinking of themselves as simple professionals performing a job, yet the nature of their duties inevitably pushes them toward an evil alignment.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Bluff (Cha), Climb (Str), Diplomacy (Cha), Disable Device (Int), Disguise (Cha), Escape Artist (Dex), Intimidate (Cha), Linguistics (Int), Perception (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Stealth (Dex), Swim (Str), Use Magic Device (Cha)","skill ranks": 4,"prestige": "yes","requirements": "Alignment: Any evil.\\nSkills: Disguise 2 ranks, Stealth 5 ranks.\\nSpecial: The character must kill someone for no other reason than to become an assassin.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Dragon Disciple","description": "As some of the most ancient, powerful, and capricious creatures in existence, dragons occasionally enter into trysts with unsuspecting mortals or sire offspring with exceptional individuals. Likewise, the great power wielded by these creatures has long intrigued wizards and alchemists who have sought various magical methods to infuse their bodies with draconic power. As a result, the blood of dragons runs through the veins of many races. For some, this heritage manifests as a sorcerous bloodline and a predilection for magic; for others, however, the power of their draconic ancestors becomes an obsession.\\nSpellcasters who embrace their draconic heritage and learn to channel their abilities can become dragon disciples, fearsome warriors who possess not only the repertoire of an accomplished sorcerer but also the ability to unleash the furious power of dragons upon their foes. As dragon disciples discover the power of their forebears, they can learn to breathe fire, take flight on leathery wings, and—at the pinnacle of their abilities—assume the form of a dragon. Although they are rare, dragon disciples can be found in any land where dragons interact with mortals.","role": "With the magic of a spellcasting class at their disposal, dragon disciples can assume the typical role of a magic-user, hampering the movement of the enemy and hurling damage-dealing spells at their opponents. Dragon disciples' draconic abilities, however, make these versatile spellcasters even more formidable, as they use their breath weapons and flight to destroy their foes directly.","alignment": "Dragon disciples can be of any alignment, although they tend to be more chaotic than lawful. Those dragon disciples that assume the traits of chromatic dragons, such as bestial white and fearsome red dragons, have a proclivity for evil. Conversely, those that take after the metallic dragons, such as stoic brass and chivalric gold dragons, are often of good alignments.","hit die": "d12","parent classes": "","class skills": "Diplomacy (Cha), Escape Artist (Dex), Fly (Dex), Knowledge (all) (Int), Perception (Wis), Spellcraft (Int)","skill ranks": 2,"prestige": "yes","requirements": "Race: Any nondragon.\\nSkills: Knowledge (arcana) 5 ranks.\\nLanguages: Draconic.\\nSpellcasting: Ability to cast 1st-level arcane spells without preparation. If the character has sorcerer levels, he must have the draconic bloodline. If the character gains levels of sorcerer after taking this class, he must take the draconic bloodline.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Duelist","description": "Duelists represent the pinnacle of elegant swordplay. They move with a grace unmatched by most foes, parrying blows and countering attacks with swift thrusts of their blades. They may wear armor, but generally eschew such bulky protection as their grace allows them to dodge their opponents with ease. While others flounder on treacherous terrain, duelists charge nimbly across the battlefield, leaping and tumbling into the fray. They thrive in melee, where their skill with the blade allows them to make sudden attacks against clumsy foes and to cripple opponents with particularly well-placed thrusts of the blade.\\nThe path to the duelist is natural for rogues and bards, as those classes do not rely on armor for defense, although nearly as many duelists come from the ranks of fighters and rangers. They are often found in those regions that possess elaborate rules and etiquette for battle.","role": "The abilities of duelists complement those rogues or bards who wish to accentuate their fighting prowess but, because of their lack of heavy armor, are afraid to leap into combat. Duelists fight in the forefront alongside fighters, barbarians, and other melee combatants, deftly avoiding the blades of their opponents while expertly targeting their vulnerabilities.","alignment": "Duelists can be of any alignment, although since most hail from backgrounds as rogues or bards, they tend to eschew lawful behavior. Lawful duelists are not unheard of, however, and such duelists often adhere to a strict code of honor, refusing to attack unarmed or obviously inferior opponents.","hit die": "d10","parent classes": "","class skills": "Acrobatics (Dex), Bluff (Cha), Escape Artist (Dex), Perception (Wis), Perform (Cha), Sense Motive (Wis)","skill ranks": 4,"prestige": "yes","requirements": "Base Attack Bonus: +6.\\nSkills: Acrobatics 2 ranks, Perform 2 ranks.\\nFeats: Dodge, Mobility, Weapon Finesse.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Eldritch Knight","description": "Fearsome warriors and spellcasters, eldritch knights are rare among magic-users in their ability to wade into battle alongside fighters, barbarians, and other martial classes. Those who must face eldritch knights in combat fear them greatly, for their versatility on the battlefield is tremendous; against heavily armed and armored opponents they may level crippling spells, while opposing spellcasters meet their ends on an eldritch knight's blade.\\nBecause the road to becoming an eldritch knight requires both martial prowess and arcane power, eldritch knights almost always begin their paths as multiclassed characters, such as fighter/wizards or ranger/sorcerers. They may be found wherever studies of the arcane are as prevalent as martial training.","role": "Eldritch knights blend the abilities of fighting classes and spellcasters, hurling magic at the enemy one moment and hewing down their opponents with steel the next. They are just as comfortable fighting in the thick of combat as they are casting spells at foes while remaining safely behind their compatriots. Their versatility makes them valuable allies when the nature of an upcoming battle is unclear.","alignment": "The road to becoming an eldritch knight is as varied as the paths leading to apprenticeship under a wizard or a career as a soldier, and eldritch knights can therefore be of any alignment. Maintaining a balance between studies of arcane lore and martial techniques requires great discipline, however, and for that reason many favor lawful alignments.","hit die": "d10","parent classes": "","class skills": "Climb (Str), Knowledge (arcana) (Int), Knowledge (nobility) (Int), Linguistics (Int), Ride (Dex), Sense Motive (Wis), Spellcraft (Int), Swim (Str)","skill ranks": 2,"prestige": "yes","requirements": "Weapon Proficiency: Must be proficient with all martial weapons.\\nSpells: Able to cast 3rd-level arcane spells.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Loremaster","description": "The loremaster is a gatherer and keeper of secrets. He is often obsessed by the written word, with cryptic and arcane lore serving as his devoted mistress. Holding to the adage that knowledge is power, the loremaster often forsakes material wealth and personal glory for rare or unusual information, an endless quest that brings him ever closer to his unattainable goal: perfection through edification. Often rejecting what he views as the pointless affectations and transitory pleasures of his short-sighted neighbors, the loremaster believes that the only worthwhile goal in life is the acquisition of intellectual might. After all, wealth is spent, passions fade, and the power of the body is limited by age, while the mind's capacity to grow greater with time is infinite.\\nThe loremaster class holds little appeal for non-spellcasters—indeed, before one can devote a life to the studies and traditions of the loremaster, a character must first master several spells of the school of divination. Most loremasters begin their paths as clerics or wizards, but any character capable of casting enough divination spells can, eventually, become a loremaster.","role": "Loremasters' lives are spent in study, research, and fieldwork. While the first two lend themselves to the loremaster's reputation as a bookish recluse, the latter oftentimes forces a loremaster to seek out the aid of adventurers who, through a mutually beneficial arrangement, might provide a degree of protection to the scholar while he seeks whatever knowledge he is after. For his part, the loremaster provides a wealth of information and arcane firepower to a party. Some loremasters actively deride those of their kind who fear to leave the safety of the temple or library, pointing out that only old lore can be discovered in books—new lore must be sought out in the world. These more active loremasters might join up with an adventuring party for the benefit of the journey, content with whatever knowledge might be picked up along the way.","alignment": "Most loremasters cannot be bothered with distracting and pointless philosophies such as ethics, and so tend to be neutral, neutral good, or neutral evil.","hit die": "d6","parent classes": "","class skills": "Appraise (Int), Diplomacy (Cha), Handle Animal (Cha), Heal (Wis), Knowledge (all) (Int), Linguistics (Int), Perform (Cha), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 4,"prestige": "yes","requirements": "Skills: Knowledge (any two) 7 ranks in each.\\nFeats: Any three metamagic or item creation feats, plus Skill Focus (Knowledge [any individual Knowledge skill]).\\nSpells: Able to cast seven different divination spells, one of which must be 3rd level or higher.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Mystic Theurge","description": "Mystic theurges place no boundaries on their magical abilities and find no irreconcilable paradox in devotion to the arcane as well as the divine. They seek magic in all of its forms, finding no reason or logic in denying themselves instruction by limiting their knowledge to one stifling paradigm, though many are simply hungry for limitless power. No matter what their motivations, mystic theurges believe that perception is reality, and through the divine forces and astral energies of the multiverse, that perception can be used to manipulate and control not only the nature of this reality, but destiny itself.\\nMystic theurges are drawn from multiclass spellcasters who can already cast both arcane and divine spells, and the powers that they gain increase their mastery over both.","role": "The mystic theurge is a powerful component for any party, supplying magic for attack, defense, and healing. Mystic theurges travel the world in search of arcane and holy artifacts, magical lore, or divine revelations, and most have no qualms about teaming up with groups of adventurers so long as that group's goals do not directly conflict with their own.","alignment": "The motivations of a mystic theurge rarely stem from a sense of altruism or philanthropy, so most tend to be neutral, neutral good, or neutral evil. Lawful mystic theurges, whether good, neutral, or evil, are rarer, and often use their powers for either the benefit—or control—of society. Chaotic mystic theurges are rarer still, as the calling generally requires great personal discipline.","hit die": "d6","parent classes": "","class skills": "Knowledge (arcana) (Int), Knowledge (religion) (Int), Sense Motive (Wis), Spellcraft (Int)","skill ranks": 2,"prestige": "yes","requirements": "Skills: Knowledge (arcana) 3 ranks, Knowledge (religion) 3 ranks.\\nSpells: Able to cast 2nd-level divine spells and 2nd-level arcane spells.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Pathfinder Chronicler","description": "Brave explorers and scavengers of lost or forgotten knowledge, Pathfinder chroniclers are quintessential adventurers, exploring the world for esoteric truths, magical and mundane relics and artifacts, and new and mysterious vistas, be they wonderful or terrible. For some, this journey is purely about the wealth, for others the glory of discovery, and still more are stirred by the irresistible drive to uncover the bones of the ages and legends of forgotten epochs in an effort to chronicle the deeds of yesterday, today, and tomorrow.\\nThe Pathfinder chronicler class attracts any who see the world as a great mystery to be unraveled, and thus has a diverse and varied following, from fighters and bards to wizards and clerics, and everything in between. However, due to their role as historians and preservers of posterity, hopefuls must be literate and scholarly—for Pathfinder chroniclers are more than mere treasure hunters.","role": "The Pathfinder chronicler's missions often thrust her into the role of party leader, and adventures typically result from, and revolve around, his endless quests.","alignment": "A Pathfinder chronicler's alignment largely determines her motivations. Good characters tend to view their missions as noble ventures, neutral characters seek to preserve knowledge for knowledge's sake, and evil characters are driven by an urge to accumulate wealth and add to their own glory.","hit die": "d8","parent classes": "","class skills": "Appraise (Int), Bluff (Cha), Diplomacy (Cha), Disguise (Cha), Escape Artist (Dex), Intimidate (Cha), Knowledge (all) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Ride (Dex), Sense Motive (Wis), Sleight of Hand (Dex), Survival (Wis), Use Magic Device (Cha)","skill ranks": 8,"prestige": "yes","requirements": "Skills: Linguistics 3 ranks, Perform (oratory) 5 ranks, Profession (scribe) 5 ranks.\\nSpecial: Must have authored or scribed something (other than a magical scroll or other device) for which another person (not a PC) paid at least 50 gp.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Shadowdancer","description": "Civilized folk have always feared the night, barring themselves behind doors or comforting themselves with bonfires when the shadows grow long, rightfully wary of the creatures that prowl the darkness. Yet long ago, some learned that the best way to conquer an enemy is to embrace it. These were the first shadowdancers.\\nShadowdancers exist in the boundary between light and darkness, where they weave together the shadows to become half-seen artists of deception. Unbound by any specified morality or traditional code, shadowdancers encompass a wide variety of adventuring types who have seen the value of the dark. Spellcasters use their abilities to safely cast spells from hiding and then move quickly away, while classes devoted to hand-to-hand combat enjoy the ability to attack foes with the element of surprise. Some even take the name of their kind quite literally, becoming eerie and mysterious performers and dancers, though more often the temptation presented by their talents with deception and infiltration causes shadowdancers to turn to lives of thievery.","role": "Shadowdancers adventure for a wide variety of reasons. Many adventuring parties find shadowdancers valuable members of their teams due to their incredible stealth and ability to surprise enemies with lightning-quick attacks where they're least expected. For this reason, their services are often sought out by those groups in need of scouts or spies.","alignment": "Because of their nature as visually duplicitous tricksters, shadowdancers do not fit comfortably into the lawful category, as many use their talents to avoid the eyes of legitimate authority. Yet though they are allies of darkness, shadowdancers are neither inherently evil nor predisposed to good. To them, the darkness is simply the darkness, without any of the usual moral connotations made by the unenlightened.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Bluff (Cha), Diplomacy (Cha), Disguise (Cha), Escape Artist (Dex), Perception (Wis), Perform (Cha), Sleight of Hand (Dex), Stealth (Dex)","skill ranks": 6,"prestige": "yes","requirements": "Skills: Stealth 5 ranks, Perform (dance) 2 ranks.\\nFeats: Combat Reflexes, Dodge, Mobility.","class type": "prestige","cast ability": "","starting wealth": 0,"average": 0},
{"class": "Kineticist","description": "Kineticists are living channels for elemental matter and energy, manipulating the world around them by drawing upon inner reserves from their own bodies. Kineticists often awaken to their kinetic abilities during a violent or traumatic experience, releasing their power involuntarily. As kinetic power is seldom inherited, kineticists are rarely able to find mentors to guide them, so they must delve into these mysteries on their own to learn to control their gifts.","role": "Kineticists generally use their powers to assail their foes from range, but based on the way their talents develop, they can channel their kinetic abilities for a variety of situations. Kineticists are usually quite different from their families and friends, so they often strike out on their own or alongside others with extraordinary talents.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Craft (Int), Heal (Wis), Intimidate (Cha), Perception (Wis), Profession (Wis), Stealth (Dex), Use Magic Device (Cha)","skill ranks": 4,"prestige": "no","requirements": "","class type": "occult","cast ability": "","starting wealth": "1d6","average": 35},
{"class": "Medium","description": "Mediums channel spirits into themselves, using their own bodies as vessels for astral entities spawned from myths and legends. A medium balances his need for the spirits' power with the danger of allowing such beings influence over his mind.","role": "Mediums are very versatile, filling whatever role the party needs at the moment by channeling the right spirit.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Bluff (Cha), Craft (Int), Diplomacy (Cha), Fly (Dex), Heal (Wis), Intimidate (Cha), Knowledge (arcana) (Int), Knowledge (planes) (Int), Knowledge (religion) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Spellcraft (Int), Use Magic Device (Wis)","skill ranks": 4,"prestige": "no","requirements": "","class type": "occult","cast ability": "cha","starting wealth": "4d6","average": 140},
{"class": "Mesmerist","description": "Experts at charm and deceit, mesmerists compel others to heed their words and bend to their will. Psychic powers, primarily those of enchantment and illusion, give mesmerists the tools they need to manipulate others—usually for their own personal gain. The very gaze of a mesmerist can hypnotize someone into following his whims. Mesmerists frequently form cults of personality around themselves, and they develop skills and contingency plans in case their ploys are discovered. They draw their magic from the Astral Plane, and many consider their minds to be conduits to enigmatic spaces others can't comprehend.","role": "Mesmerists wield power over lesser minds, suppressing foes' wills to weaken them. Priding themselves on their trickery and inventiveness, they also support their allies—and often themselves—with magical tricks, most of which offer protection. Their limited healing ability primarily provides temporary hit points, so mesmerists aren't the strongest primary healers, but they can easily remove conditions that typically affect the mind.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Appraise (Int), Bluff (Cha), Craft (Int), Diplomacy (Cha), Disguise (Cha), Escape Artist (Dex), Intimidate (Cha), Knowledge (arcana) (Int), Knowledge (dungeoneering) (Int), Knowledge (history) (Int), Knowledge (local) (Int), Knowledge (nobility) (Int), Knowledge (religion) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Spellcraft (Int), Stealth (Dex), Use Magic Device (Cha)","skill ranks": 6,"prestige": "no","requirements": "","class type": "occult","cast ability": "cha","starting wealth": "3d6","average": 105},
{"class": "Occultist","description": "The occultist focuses on the world around him, grounded in the powers that flow throughout his environment. He studies the magic that infuses everything, from psychic resonances left in everyday items to powerful incantations that fuel the mightiest spells.\\nThe occultist channels his psychic might through implements—items that allow him to focus his power and produce incredible effects. For him, implements are more than simple tools. They are a repository of history and a tie to the events of the past. The occultist uses these implements to influence and change the present, adding his legend to theirs. Though some of these implements might be magic items in their own right, most of them are merely of historical or personal significance to the occultist.","role": "Occultists are always eager to travel in the company of adventurers, explorers, and archaeologists, as those three groups of people have a knack for finding items with rich histories and great significance.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Appraise (Int), Craft (Int), Diplomacy (Cha), Disable Device (Dex), Disguise (Cha), Fly (Dex), Knowledge (arcana) (Int), Knowledge (engineering) (Int), Knowledge (history) (Int), Knowledge (planes) (Int), Knowledge (religion) (Int), Linguistics (Int), Perception (Wis), Profession (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 4,"prestige": "no","requirements": "","class type": "occult","cast ability": "int","starting wealth": "4d6","average": 140},
{"class": "Psychic","description": "Within the mind of any sentient being lies power to rival that of the greatest magical artifact or holy site. By accessing these staggering vaults of mental energy, the psychic can shape the world around her, the minds of others, and pathways across the planes. No place or idea is too secret or remote for a psychic to access, and she can pull from every type of psychic magic. Many methods allow psychics to tap into their mental abilities, and the disciplines they follow affect their abilities.","role": "With a large suite of spells, psychics can handle many situations, but they excel at moving and manipulating objects, as well as reading and influencing thoughts.","alignment": "Any.","hit die": "d6","parent classes": "","class skills": "Bluff (Cha), Craft (Int), Diplomacy (Cha), Fly (Dex), Intimidate (Cha), Knowledge (all) (Int), Linguistics (Int), Perception (Wis), Profession (Wis), Sense Motive (Wis), Spellcraft (Int)","skill ranks": 2,"prestige": "no","requirements": "","class type": "occult","cast ability": "int","starting wealth": "2d6","average": 70},
{"class": "Spiritualist","description": "Becoming a spiritualist is not a calling—it's a phenomenon. When a creature dies, its spirit flees its body and begins the next stage of its existence. Debilitating emotional attachments during life and other psychic corruptions cause some spirits to drift into the Ethereal Plane and descend toward the Negative Energy Plane. Some of these spirits are able to escape the pull of undeath and make their way back to the Material Plane, seeking refuge in a psychically attuned mind. Such a fusing of consciousnesses creates a spiritualist—the master of a single powerful phantom whom the spiritualist can manifest to do her bidding.","role": "The spiritualist seeks the occult and esoteric truth about life, death, and the passage beyond, using her phantom as a guide and tool. The connection with her phantom allows her to harness the powers of life and death, thought and nightmare, shadow and revelation.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Bluff (Cha), Craft (Int), Fly (Dex), Heal (Wis), Intimidate (Cha), Knowledge (all) (Int), Linguistics (Int), Profession (Wis), Sense Motive (Wis), Spellcraft (Int), Use Magic Device (Cha)","skill ranks": 4,"prestige": "no","requirements": "","class type": "occult","cast ability": "wis","starting wealth": "2d6","average": 70},
{"class": "Gunslinger","description": "For a renegade few, battle sounds different than it does for the typical fighter. The clash of steel and the sizzle of spell energy are drowned out by the thunderous rhythm of gunfire—the pounding beat of the gunslinger.\\nGunslingers are a bold and mysterious lot. While many treat the secrets of black powder with the same care and reverence that a wizard typically reserves for his spellbook, most gunslingers know that firearms are a secret that cannot remain concealed forever. While current firearms are simple, often imprecise, and even dangerous devices, they are a technology on the move, and one that will become even more powerful when it is fully fused with magic.","role": "Gunslingers are thunderous artillery, often found where the fighting is fiercest. Brave, clever, and frequently foolhardy, many gunslingers push to position themselves at close range, barrels blazing, to take down their foes and demoralize their enemies. Other gunslingers are masters of distant death, picking off enemies from afar with their strange and wondrous weapons.","alignment": "Any.","hit die": "d10","parent classes": "","class skills": "Acrobatics (Dex), Bluff (Cha), Climb (Str), Craft (Int), Handle Animal (Cha), Heal (Wis), Intimidate (Cha), Knowledge (engineering) (Int), Knowledge (local) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Sleight of Hand (Dex), Survival (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "ultimate combat","cast ability": "","starting wealth": "5d6","average": 175},
{"class": "Ninja","description": "When the wealthy and the powerful need an enemy eliminated quietly and without fail, they call upon the ninja. When a general needs to sabotage the siege engines of his foes before they can reach the castle walls, he calls upon the ninja. And when fools dare to move against a ninja or her companions, they will find the ninja waiting for them while they sleep, ready to strike. These shadowy killers are masters of infiltration, sabotage, and assassination, using a wide variety of weapons, practiced skills, and mystical powers to achieve their goals.","role": "The ninja spends almost all of her time honing her skills, practicing her art, or working on her next assignment. Even when not specifically working, the ninja is ever vigilant and ready for the situation to turn deadly. Her line of work earns her many enemies, but it is a list that she frequently reduces through assassination and misdirection. The ninja is an alternate class for the rogue core class.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Disable Device (Dex), Disguise (Cha), Escape Artist (Dex), Intimidate (Cha), Knowledge (local) (Int), Knowledge (nobility) (Int), Linguistics (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Sleight of Hand (Dex), Stealth (Dex), Swim (Str), Use Magic Device (Cha)","skill ranks": 8,"prestige": "no","requirements": "","class type": "ultimate combat","cast ability": "","starting wealth": "4d6","average": 140},
{"class": "Samurai","description": "Few warriors are more dedicated to honor and the code of the warrior than the samurai. Trained from an early age in the art of war and sworn to the service of a lord, the samurai holds a position of power and respect in many lands, often serving as the voice and justice of the local noble. The samurai takes on his training with zeal, learning the way of the blade (typically a katana), the bow, and the horse. Some even learn how to effectively use firearms, if they are available. The samurai is often the most trusted soldier in his lord's employ. In him, the common folk see honor and sacrifice. He is an honorable warrior, dedicated to the realm and the leaders that guide it.","role": "While typically sworn to the service of a lord, a samurai is usually given free reign as to how he performs that service. As such, samurai can sometimes be found with other adventurers, taking the fight to the enemies of their masters. Other samurai become ronin, striving to serve an ideal without paying fealty to a lord. In either case, samurai make powerful allies, capable of withstanding nearly any harm while dispatching their foes with deadly precision. The samurai is an alternate class for the cavalier base class.","alignment": "Any.","hit die": "d10","parent classes": "","class skills": "Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Intimidate (Cha), Profession (Wis), Ride (Dex), Sense Motive (Wis), Swim (Str)","skill ranks": 4,"prestige": "no","requirements": "","class type": "ultimate combat","cast ability": "","starting wealth": "5d6","average": 175},
{"class": "Magus","description": "There are those who spend their lives poring over ancient tomes and texts, unlocking the power of magic, and there are those who spend their time perfecting the use of individual weapons, becoming masters without equal. The magus is at once a student of both philosophies, blending magical ability and martial prowess into something entirely unique, a discipline in which both spell and steel are used to devastating effect. As he grows in power, the magus unlocks powerful forms of arcana that allow him to merge his talents further, and at the pinnacle of his art, the magus becomes a blur of steel and magic, a force that few foes would dare to stand against.","role": "Magi spend much of their time traveling the world, learning whatever martial or arcane secrets they can find. They might spend months learning a new sword-fighting style from a master warrior, while simultaneously moonlighting in the local library, poring through tomes of ancient lore. Most who take this path dabble in all sorts of lore, picking up anything that might aid them in their search for perfection.","alignment": "Any.","hit die": "d8","parent classes": "","class skills": "Climb (Str), Craft (Int), Fly (Dex), Intimidate (Cha), Knowledge (arcana) (Int), Knowledge (dungeoneering) (Int), Knowledge (planes) (Int), Profession (Wis), Ride (Dex), Spellcraft (Int), Swim (Str), Use Magic Device (Cha)","skill ranks": 2,"prestige": "no","requirements": "","class type": "ultimate magic","cast ability": "int","starting wealth": "4d6","average": 140}
