{"race": "Dwarf","trait": "Ancient Enmity","replacement": "hatred","text": "Dwarves have long been in conflict with elves, especially the hated drow. Dwarves with this racial trait receive a +1 racial bonus on attack rolls against humanoid creatures of the elf subtype. This racial trait replaces hatred."},
{"race": "Dwarf","trait": "Craftsman","replacement": "greed","text": "Dwarves are known for their superior craftsmanship when it comes to metallurgy and stonework. Dwarves with this racial trait receive a +2 racial bonus on all Craft or Profession checks related to metal or stone. This racial trait replaces greed."},
{"race": "Dwarf","trait": "Deep Warrior","replacement": "defensive training","text": "Dwarves with this racial trait grew up facing the abominations that live deep beneath the surface. They receive a +2 dodge bonus to AC against monsters of the aberration type and a +2 racial bonus on combat maneuver checks made to grapple such creatures (or to continue a grapple). This racial trait replaces defensive training."},
{"race": "Dwarf","trait": "Giant Hunter","replacement": "hatred","text": "Dwarves with this racial trait gain a +1 bonus on attack rolls against humanoids with the giant subtype. Furthermore, they gain a +2 bonus on Survival checks to find and follow tracks made by humanoids with the giant subtype. This racial trait replaces the hatred racial trait."},
{"race": "Dwarf","trait": "Lorekeeper","replacement": "greed","text": "Dwarves keep extensive records about their history and the world around them. Dwarves with this racial trait receive a +2 racial bonus on Knowledge (history) checks that pertain to dwarves or their enemies. They can make such skill checks untrained. This racial trait replaces greed."},
{"race": "Dwarf","trait": "Magic Resistant","replacement": "hardy","text": "Some of the older dwarven clans are particularly resistant to magic. Dwarves with this racial trait gain spell resistance equal to 5 + their character level. This resistance can be lowered for 1 round as a standard action. Dwarves with this racial trait take a –2 penalty on all concentration checks made in relation to arcane spells. This racial trait replaces hardy."},
{"race": "Dwarf","trait": "Minesight","replacement": "darkvision","text": "Dwarves with this racial trait increase the range of their darkvision to 90 feet; however, they are automatically dazzled in bright light and take a –2 penalty on saving throws against effects with the light descriptor. This racial trait replaces darkvision."},
{"race": "Dwarf","trait": "Mountaineer","replacement": "stability","text": "Mountain dwarves are skilled at climbing and navigating narrow ledges. Dwarves with this racial trait are immune to altitude sickness and do not lose their Dexterity bonus to AC when making Climb or Acrobatics checks to cross narrow or slippery surfaces. This racial trait replaces stability."},
{"race": "Dwarf","trait": "Relentless","replacement": "stability","text": "Dwarves are skilled at pushing their way through a battlefield, tossing aside lesser foes with ease. Dwarves with this racial trait receive a +2 bonus on combat maneuver checks made to bull rush or overrun an opponent. This bonus only applies while both the dwarf and his opponent are standing on the ground. This racial trait replaces stability."},
{"race": "Dwarf","trait": "Rock Stepper","replacement": "stonecutting","text": "Dwarves with this racial trait can skillfully negotiate rocky terrain. They can ignore difficult terrain created by rubble, broken ground, or steep stairs when they take a 5-foot step. This racial trait replaces stonecunning."},
{"race": "Dwarf","trait": "Saltbeard","replacement": "defensive training, hatred, stonecunning","text": "Dwarves occasionally found iron cities along rugged seacoasts, and natives of such cities gain a +2 bonus on Profession (sailor) and Survival checks while at sea. They gain a +1 racial bonus on attack rolls and a +2 dodge bonus to AC against creatures with the aquatic or water subtype. Their greed racial trait applies only to treasure found in or under the water, but applies to all such treasure regardless of whether or not it contains metal or gemstones. This racial trait replaces defensive training, hatred, and stonecunning."},
{"race": "Dwarf","trait": "Sky Sentinel","replacement": "defensive training, hatred, stonecunning","text": "As creatures with a deep affinity for the ground, dwarves are wary of attacks from above. Enemies on higher ground gain no attack roll bonus against dwarves with this racial trait, and they gain a +1 racial bonus on attack rolls, a +2 dodge bonus to AC, and a +2 bonus on Perception checks against flying creatures. This racial trait replaces defensive training, hatred, and stonecunning."},
{"race": "Dwarf","trait": "Stonesinger","replacement": "stonecunning","text": "Some dwarves' affinity for the earth grants them greater powers. Dwarves with this racial trait are treated as one level higher when casting spells with the earth descriptor or using granted powers of the Earth domain, the bloodline powers of the deep earth bloodline or earth elemental bloodline, and revelations of the oracle's stone mystery. This ability does not give them early access to level-based powers; it only affects the powers they could use without this ability. This racial trait replaces stonecunning."},
{"race": "Dwarf","trait": "Stubborn","replacement": "hardy","text": "Dwarves are renowned for their stubbornness. Dwarves with this racial trait receive a +2 racial bonus on Will saves to resist spells and spell-like abilities of the enchantment (charm) and enchantment (compulsion) schools. In addition, if they fail such a save, they receive another save 1 round later to prematurely end the effect (assuming it has a duration greater than 1 round). This second save is made at the same DC as the first. If the dwarf has a similar ability from another source (such as a rogue's slippery mind), he can only use one of these abilities per round, but he can try the other on the second round if the first reroll ability fails. This racial trait replaces hardy."},
{"race": "Dwarf","trait": "Surface Survivalist","replacement": "darkvision","text": "Some dwarves have dwelt so long aboveground they have lost their ability to see at night. However, their adaptation to extreme environments allows them to treat wind conditions (when determining whether or not they are checked or blown away) and either hot or cold climates (choose one) as one step less severe. This racial trait replaces darkvision."},
{"race": "Dwarf","trait": "Xenophobic","replacement": "languages SPECIAL","text": "Isolationist dwarves despise non-dwarven humanoids. They speak only Dwarven and do not gain any bonus languages from possessing a high Intelligence score. In addition, they learn only one language per 2 ranks of Linguistics they possess. However, their untrusting nature gives them a +1 bonus against mind-affecting effects, except for fear affects. This racial trait replaces a dwarf's normal languages."},
{"race": "Dwarf","trait": "Wyrmscourged","replacement": "defensive training, hatred, stonecunning","text": "Dwarves with this racial trait gain a +1 bonus on attack rolls and a +2 dodge bonus to AC and on saving throws against the exceptional, supernatural, and spell-like abilities of dragons. They also gain a +2 racial bonus on Knowledge (arcana) checks to identify dragons and can make such checks untrained. This racial trait replaces defensive training, hatred, and stonecunning."},
{"race": "Elf","trait": "Arcane Focus","replacement": "weapon familiarity","text": "Some elven families have such long traditions of producing wizards (and other arcane spellcasters) that they raise their children with the assumption each is destined to be a powerful magic-user, with little need for mundane concerns such as skill with weapons. Elves with this racial trait gain a +2 racial bonus on concentration checks made to cast arcane spells defensively. This racial trait replaces weapon familiarity."},
{"race": "Elf","trait": "Darkvision","replacement": "low-light vision ","text": "Though uncommon, some groups of elves are born with darkvision, rather than low-light vision. In many cases this is taken as a sign of a drow in the elf's ancestry, and can lead to persecution within the elf's home community. Elves with this racial trait gain darkvision with a range of 60 feet, but also gain sensitivity to light and are dazzled in areas of bright light or within the radius of a daylight spell. This racial trait replaces low-light vision. "},
{"race": "Elf","trait": "Desert Runner ","replacement": "elven magic ","text": "Some elves thrive in the deepest deserts, forever roaming across burned and parched lands. Elves with this racial trait receive a +4 racial bonus on Constitution checks and Fortitude saves to avoid fatigue, exhaustion, or ill effects from running, forced marches, starvation, thirst, or hot or cold environments. This racial trait replaces elven magic. "},
{"race": "Elf","trait": "Dreamspeaker ","replacement": "elven immunities ","text": "A few elves have the ability to tap into the power of sleep, dreams, and prescient reverie. Elves with this racial trait add +1 to the saving throw DCs of spells of the divination school and sleep effects they cast. In addition, elves with Charisma scores of 15 or higher may use dream once per day as a spell-like ability (caster level is equal to the elf's character level). This racial trait replaces elven immunities. "},
{"race": "Elf","trait": "Elemental Resistance ","replacement": "elven immunities ","text": "Elves who dwell in the most extreme environments, from arctic wastelands to volcanic plains, develop natural resistance to the dangers of their homelands over the course of a few generations. Elves with this racial trait gain elemental resistance 5 to acid, cold, electricity, or fire. This choice is made at character creation, and once made it cannot be changed. This racial trait replaces elven immunities. "},
{"race": "Elf","trait": "Envoy ","replacement": "elven magic ","text": "Elves often have trouble relating to neighbors of other races, especially those with much shorter lifespans. As a result, some are trained in minor magics that are particularly useful when dealing with non-elves. Elves with this racial trait and an Intelligence score of 11 or higher gain the following spell-like abilities once per day: comprehend languages, detect magic, detect poison, and read magic. The caster level for these effects is equal to the elf's level. This racial trait replaces elven magic. "},
{"race": "Elf","trait": "Eternal Grudge ","replacement": "elven magic ","text": "Some elves grow up in secluded, isolationist communities where generations-old slights and quarrels linger as eternal blood feuds. Elves with this racial trait receive a +1 bonus on attack rolls against humanoids of the dwarf and orc subtypes because of special training against these hated foes. This racial trait replaces elven magic. "},
{"race": "Elf","trait": "Fleet-Footed ","replacement": "keen senses, weapon familiarity ","text": "While all elves are naturally lithe and agile, some also are naturally speedy and have a strong desire to rush into situations rather than worrying about looking ahead. Elves with this racial trait receive Run as a bonus feat and a +2 racial bonus on initiative checks. This racial trait replaces keen senses and weapon familiarity. "},
{"race": "Elf","trait": "Lightbringer ","replacement": "elven immunities, elven magic","text": "Many elves revere the sun, moon, and stars, but some are literally infused with the radiant power of the heavens. Elves with this racial trait are immune to light-based blindness and dazzle effects, and are treated as one level higher when determining the effects of any light-based spell or effect they cast (including spell-like and supernatural abilities). Elves with Intelligence scores of 10 or higher may use light at will as a spell-like ability. This racial trait replaces the elven immunities and elven magic racial traits. "},
{"race": "Elf","trait": "Silent Hunter ","replacement": "elven magic ","text": "Elves are renowned for their subtlety and skill. Elves with this racial trait reduce the penalty for using Stealth while moving by 5 and can make Stealth checks while running at a –20 penalty (this number includes the penalty reduction from this racial trait). This racial trait replaces elven magic. "},
{"race": "Elf","trait": "Spirit of the Waters ","replacement": "elven magic, weapon familiarity","text": "Some elves have adapted to life in tune with the sea or along the reedy depths of wild rivers and lakes. They gain a +4 racial bonus on Swim checks, can always take 10 while swimming, and may choose Aquan as a bonus language. They are proficient with longspear, trident, and net. This racial trait replaces elven magic and weapon familiarity. "},
{"race": "Elf","trait": "Urbanite ","replacement": "keen senses ","text": "Elves who live in cities for more than a century can grow to know the ebb and flow of social situations just as their forest-dwelling cousins know the rules of the wild. Elves with this racial trait gain a +2 racial bonus on Diplomacy checks made to gather information and Sense Motive checks made to get a hunch about a social situation. This racial trait replaces keen senses. "},
{"race": "Elf","trait": "Woodcraft ","replacement": "elven magic ","text": "Elves know the deep secrets of the wild like no others, especially secrets of the forests. Elves with this racial trait gain a +1 racial bonus on Knowledge (nature) and Survival checks. In forest terrain, these bonuses improve to +2. This racial trait replaces elven magic. "},
{"race": "Gnome","trait": "Academician ","replacement": "obsessive","text": "Some gnomes are more academically inclined than their kin. Gnomes with this racial trait gain a +2 bonus on any single Knowledge skill. This racial trait replaces the obsessive racial trait. "},
{"race": "Gnome","trait": "Bond to the Land ","replacement": "defensive training, hatred","text": "Some gnomes have strong ties to specific kinds of terrain, as a holdover from their fey origins. These gnomes gain a +2 dodge bonus to AC when in a specific terrain type selected from the ranger list of favored terrains. This choice is made at character creation, and cannot be changed. This racial trait replaces defensive training and hatred. "},
{"race": "Gnome","trait": "Darkvision ","replacement": "low-light vision, keen senses","text": "Some gnome strains have lived in the underground depths for so long they have given up on light entirely and gained darkvision with a range of 60 feet. This racial trait replaces low-light vision and keen senses. "},
{"race": "Gnome","trait": "Eternal Hope ","replacement": "replaces defensive training, hatred","text": "Gnomes rarely lose hope and are always confident that even hopeless situations will work out. Gnomes with this racial trait receive a +2 racial bonus on saving throws against fear and despair effects. Once per day, after rolling a 1 on a d20, the gnome may reroll and use the second result. This racial trait replaces defensive training and hatred. "},
{"race": "Gnome","trait": "Explorer ","replacement": "hatred, obsessive","text": "Many gnomes are obsessed with seeing as much of the world as possible, rather than perfecting some specific talent or vocation. These gnomes gain a +2 racial bonus on Climb checks and checks for one Knowledge skill of their choice. This racial trait replaces hatred and obsessive. "},
{"race": "Gnome","trait": "Fell Magic ","replacement": "gnome magic ","text": "Gnomes add +1 to the DC of any saving throws against necromancy spells that they cast. Gnomes with Wisdom scores of 11 or higher also gain the following spell-like abilities: 1/day—bleed, chill touch, detect poison, and touch of fatigue. The caster level for these effects is equal to the gnome's level. The DC for these spells is equal to 10 + the spell's level + the gnome's Wisdom modifier. This racial trait replaces gnome magic. "},
{"race": "Gnome","trait": "Gift of Tongues ","replacement": "defensive training, hatred","text": "Gnomes love languages and learning about those they meet. Gnomes with this racial trait gain a +1 bonus on Bluff and Diplomacy checks, and they learn one additional language every time they put a rank in the Linguistics skill. This racial trait replaces defensive training and hatred. "},
{"race": "Gnome","trait": "Knack with Poison ","replacement": "illusion resistance, obsessive","text": "Some gnomes have an instinctive understanding of poisons and their uses. Gnomes gain a +2 racial bonus on Fortitude saves against poison and a +2 bonus on Craft (alchemy) checks to make poison. The bonus on Fortitude saving throws against poisons increases to +4 if the gnome accidentally poisons himself when applying or readying the substance. This racial trait replaces illusion resistance and obsessive. "},
{"race": "Gnome","trait": "Magical Linguist ","replacement": "gnome magic, illusion resistance ","text": "Gnomes study languages in both their mundane and supernatural manifestations. Gnomes with this racial trait add +1 to the DC of spells they cast with the language-dependent descriptor or those that create glyphs, symbols, or other magical writings. They gain a +2 racial bonus on saving throws against such spells. Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—arcane mark, comprehend languages, message, read magic. The caster level for these effects is equal to the gnome's level. This racial trait replaces gnome magic and illusion resistance. "},
{"race": "Gnome","trait": "Master Tinker ","replacement": "defensive training, hatred ","text": "Gnomes experiment with all manner of mechanical devices. Gnomes with this racial trait gain a +1 bonus on Disable Device and Knowledge (engineering) checks. They are treated as proficient with any weapon they have personally crafted. This racial trait replaces defensive training and hatred. "},
{"race": "Gnome","trait": "Pyromaniac ","replacement": "gnome magic, illusion resistance ","text": "Gnomes with this racial trait are treated as one level higher when casting spells with the fire descriptor, using granted powers of the Fire domain, using the bloodline powers of the fire elemental bloodline or the revelations of the oracle's flame mystery, and determining the damage of alchemist bombs that deal fire damage (this ability does not give gnomes early access to level-based powers; it only affects the powers they could use without this ability). Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—dancing lights, flare, prestidigitation, produce flame. The caster level for these effects is equal to the gnome's level; the DCs are Charisma-based. This racial trait replaces gnome magic and illusion resistance. "},
{"race": "Gnome","trait": "Warden of Nature ","replacement": "defensive training, hatred ","text": "Gnomes must often protect their homes against unnatural or pestilential infestations. Gnomes with this racial trait gain a +2 dodge bonus to AC against aberrations, oozes, and vermin, and a +1 bonus on attack rolls against them because of their special training. This racial trait replaces defensive training and hatred. "},
{"race": "Half-elf","trait": "Ancestral Arms ","replacement": "adaptability","text": "Some half-elves receive training in an unusual weapon. Half-elves with this racial trait receive Exotic Weapon Proficiency or Martial Weapon Proficiency with one weapon as a bonus feat at 1st level. This racial trait replaces the adaptability racial trait. "},
{"race": "Half-elf","trait": "Arcane Training ","replacement": "multitalented","text": "Half-elves occasionally seek tutoring to help them master the magic in their blood. Half-elves with this racial trait have only one favored class, and it must be an arcane spellcasting class. They can use spell trigger and spell completion items for their favored class as if one level higher (or as a 1st-level character if they have no levels in that class). This racial trait replaces the multitalented racial trait. "},
{"race": "Half-elf","trait": "Drow-Blooded ","replacement": "low-light vision","text": "Some half-elves born of drow parents exhibit more drow traits than others—particularly many of the physical features of the drow—and have darkvision 60 feet and light blindness. This racial trait replaces the low-light vision racial trait. "},
{"race": "Half-elf","trait": "Drow Magic ","replacement": "adaptability, multitalented","text": "A few half-elves with drow ancestry exhibit the innate magic of that race. Half-elves with this trait have drow blood somewhere in their background, and can cast dancing lights, darkness, and faerie fire each once per day, using the half-elf's character level as the caster level for these spell-like abilities. This racial trait replaces the adaptability and multitalented racial traits. "},
{"race": "Half-elf","trait": "Dual Minded ","replacement": "adaptability","text": "The mixed ancestry of some half-elves makes them resistant to mental attacks. Half-elves with this racial trait gain a +2 bonus on all Will saving throws. This racial trait replaces the adaptability racial trait. "},
{"race": "Half-elf","trait": "Integrated ","replacement": "adaptability","text": "Many half-elves are skilled in the art of ingratiating themselves into a community as if they were natives. Half-elves with this racial trait gain a +1 bonus on Bluff, Disguise, and Knowledge (local) checks. This racial trait replaces the adaptability racial trait. "},
{"race": "Half-elf","trait": "Sociable ","replacement": "adaptability","text": "Half-elves are skilled at charming others and recovering from faux pas. If half-elves with this racial trait attempt to change a creature's attitude with a Diplomacy check and fail by 5 or more, they can try to influence the creature a second time even if 24 hours have not passed. This racial trait replaces the adaptability racial trait. "},
{"race": "Half-elf","trait": "Wary ","replacement": "keen senses","text": "Many half-elves have spent their long lives moving from place to place, often driven out by the hostility of others. Such experiences have made them wary of others' motivations. Half-elves with this trait gain a +1 racial bonus on Sense Motive and Bluff checks. This racial trait replaces the keen senses racial trait. "},
{"race": "Half-elf","trait": "Water Child ","replacement": "adaptability, multitalented","text": "Some half-elves are born of elves adapted to life on or near the water. These half-elves gain a +4 racial bonus on Swim checks, can always take 10 while swimming, and may choose Aquan as a bonus language. This racial trait replaces the adaptability and multitalented racial traits. "},
{"race": "Half-orc","trait": "Acute Darkvision","replacement": "orc ferocity ","text": "Some half-orcs have exceptionally sharp darkvision, gaining darkvision 90 feet. This racial trait replaces orc ferocity."},
{"race": "Half-orc","trait": "Beastmaster","replacement": "orc ferocity ","text": "Some half-orcs have a spiritual kinship with fantastical beasts, capturing them for sport or living and hunting with them. A half-orc with this trait treats whips and nets as martial weapons and gains a +2 racial bonus on Handle Animal checks. This racial trait replaces orc ferocity."},
{"race": "Half-orc","trait": "Bestial","replacement": "orc ferocity ","text": "The orc blood of some half-orcs manifests in the form of particularly prominent orc features, exacerbating their bestial appearances but improving their already keen senses. They gain a +2 racial bonus on Perception checks. This racial trait replaces orc ferocity."},
{"race": "Half-orc","trait": "Cavewight","replacement": "intimidating ","text": "Some half-orcs live far below the surface, seeking freedom in winding cave complexes. Half-orcs with this racial trait gain a +1 racial bonus on Knowledge (dungeoneering) and Survival checks made underground. This racial trait replaces the intimidating trait."},
{"race": "Half-orc","trait": "Chain Fighter","replacement": "weapon familiarity ","text": "Some half-orcs have escaped from slavery and reforged the chains of their imprisonment into deadly weapons. Half-orcs with this racial trait are proficient with flails and heavy flails, and treat dire flails and spiked chains as martial weapons. This racial trait replaces weapon familiarity."},
{"race": "Half-orc","trait": "City-Raised","replacement": "weapon familiarity ","text": "Half-orcs with this trait know little of their orc ancestry and were raised among humans and other half-orcs in a large city. City-raised half-orcs are proficient with whips and longswords, and receive a +2 racial bonus on Knowledge (local) checks. This racial trait replaces weapon familiarity."},
{"race": "Half-orc","trait": "Forest Walker","replacement": "darkvision ","text": "More at home in the forests and jungles of the world, these half-orcs are well adapted to their surroundings. Half-orcs with this trait have low-light vision and gain a +2 racial bonus on Climb checks. This racial trait replaces darkvision."},
{"race": "Half-orc","trait": "Gatecrasher","replacement": "orc ferocity ","text": "Many half-orcs revel in acts of wanton destruction. Half-orcs with this racial trait gain a +2 racial bonus on Strength checks to break objects and on sunder combat maneuver checks. This racial trait replaces orc ferocity."},
{"race": "Half-orc","trait": "Rock Climber","replacement": "intimidating ","text": "Half-orcs from mountainous regions are excellent climbers, and sometimes ambush prey by leaping down from above. Half-orcs with this racial trait gain a +1 racial bonus on Acrobatics and Climb checks. This racial trait replaces the intimidating trait."},
{"race": "Half-orc","trait": "Sacred Tattoo","replacement": "orc ferocity ","text": "Many half-orcs decorate themselves with tattoos, piercings, and ritual scarification, which they consider sacred markings. Half-orcs with this racial trait gain a +1 luck bonus on all saving throws. This racial trait replaces orc ferocity."},
{"race": "Half-orc","trait": "Scavenger","replacement": "intimidating ","text": "Some half-orcs eke out a leaving picking over the garbage heaps of society, and must learn to separate rare finds from the inevitable dross. Half-orcs with this racial trait receive a +2 racial bonus on Appraise checks and on Perception checks to find hidden objects (including traps and secret doors), determine whether food is spoiled, or identify a potion by taste. This racial trait replaces the intimidating trait."},
{"race": "Half-orc","trait": "Shaman's Apprentice","replacement": "intimidating ","text": "Only the most stalwart survive the years of harsh treatment that an apprenticeship to an orc shaman entails. Half-orcs with this trait gain Endurance as a bonus feat. This racial trait replaces the intimidating trait."},
{"race": "Half-orc","trait": "Skilled","replacement": "darkvision ","text": "Second- and third-generation half-orcs often favor their human heritage more than their orc heritage. Half-orcs with this trait gain 1 additional skill rank per level. This racial trait replaces darkvision."},
{"race": "Half-orc","trait": "Toothy","replacement": "orc ferocity ","text": "Some half-orcs' tusks are large and sharp, granting a bite attack. This is a primary natural attack that deals 1d4 points of piercing damage. This racial trait replaces orc ferocity."},
{"race": "Half-orc","trait": "Squalid","replacement": "orc ferocity ","text": "Some orcs exist in surroundings so filthy and pestilent that even other orcs would have difficulty living in them. Orcs with this racial trait gain a +2 racial bonus on saving throws made to resist nausea, the sickened condition, and disease. This racial trait replaces ferocity."},
{"race": "Halfling","trait": "Adaptable Luck","replacement": "halfling luck ","text": "Some halflings have greater control over their innate luck. This ability gives them more options for how they can apply their good fortune from day to day, but also narrows its scope. Three times per day, a halfling can gain a +2 luck bonus on an ability check, attack roll, saving throw, or skill check. If halflings choose to use the ability before they make the roll or check, they gain the full +2 bonus; if they choose to do so afterward, they only gain a +1 bonus. Using adaptive luck in this way is not an action. This racial trait replaces halfling luck."},
{"race": "Halfling","trait": "Craven","replacement": "fearless, halfling luck ","text": "While most halflings are fearless, some are skittish, making them particularly alert. Halflings with this racial trait gain a +1 bonus on initiative checks and a +1 bonus on attack rolls when flanking. They take a –2 penalty on saves against fear effects and gain no benefit from morale bonuses on such saves. When affected by a fear effect, their base speed increases by 10 feet and they gain a +1 dodge bonus to Armor Class. This racial trait replaces fearless and halfling luck."},
{"race": "Halfling","trait": "Fleet of Foot","replacement": "slow speed, sure-footed ","text": "Some halflings are quicker than their kin but less cautious. Halflings with this racial trait move at normal speed and have a base speed of 30 feet. This racial trait replaces slow speed and sure-footed."},
{"race": "Halfling","trait": "Ingratiating","replacement": "keen senses, sure-footed ","text": "Halflings often survive at the whims of larger, more aggressive races. Because of this, they go out of their way to make themselves more useful, or at least entertaining, to larger folk. Halflings with this racial trait gain a +2 bonus on skill checks for a single Perform skill of their choice, and Perform is always a class skill for them. They also gain a +2 bonus on Craft and Profession checks. This racial trait replaces keen senses and sure-footed."},
{"race": "Halfling","trait": "Low Blow","replacement": "keen senses ","text": "Some halflings train extensively in the art of attacking larger creatures. Halflings with this racial trait gain a +1 bonus on critical confirmation rolls against opponents larger than themselves. This racial trait replaces keen senses."},
{"race": "Halfling","trait": "Outrider","replacement": "sure-footed ","text": "Some halflings specialize in mounted combat. Halflings with this racial trait gain a +2 bonus on Handle Animal and Ride checks. This racial trait replaces sure-footed."},
{"race": "Halfling","trait": "Polyglot","replacement": "keen senses SPECIAL","text": "Some halflings, especially those who spend a lot of time traveling, develop a talent for learning new languages. These halflings gain a +2 racial bonus on Linguistics checks, and it is always a class skill for them. Halflings with this racial trait also begin play with the ability to speak Common, Halfling, and any one other language of their choice (except for secret languages, such as Druidic) in addition to bonus languages due to high Intelligence. They still gain the normal list of halfling bonus languages. This racial trait replaces keen senses and alters the halfling language racial trait."},
{"race": "Halfling","trait": "Practicality","replacement": "fearless, sure-footed ","text": "Halflings value hard work and common sense. Halflings with this racial trait gain a +2 bonus on any one Craft or Profession skill, as well as on Sense Motive checks and saves against illusions. This racial trait replaces fearless and sure-footed."},
{"race": "Halfling","trait": "Shiftless","replacement": "sure-footed ","text": "Halflings have a reputation for larceny and guile—and sometimes it's well deserved. Halflings with this racial trait gain a +2 racial bonus on Bluff and Sleight of Hand checks, and Sleight of Hand is always a class skill for them. This racial trait replaces sure-footed."},
{"race": "Halfling","trait": "Swift as Shadows","replacement": "sure-footed ","text": "Halflings possess incredible stealth even while moving through obstructed areas. Halflings with this racial trait reduce the penalty for using Stealth while moving by 5, and reduce the Stealth check penalty for sniping by 10. This racial trait replaces sure-footed."},
{"race": "Halfling","trait": "Underfoot","replacement": "halfling luck ","text": "Halflings must train hard to effectively fight bigger opponents. Halflings with this racial trait gain a +1 dodge bonus to AC against foes larger than themselves and a +1 bonus on Reflex saving throws to avoid trample attacks. This racial trait replaces halfling luck."},
{"race": "Halfling","trait": "Wanderlust","replacement": "replaces fearless, halfling luck ","text": "Halflings love travel and maps. Halflings with this racial trait receive a +2 bonus on Knowledge (geography) and Survival checks. When casting spells or using abilities that provide or enhance movement, halflings treat their caster level as +1 higher than normal. This racial trait replaces fearless and halfling luck."},
{"race": "Halfling","trait": "Warslinger","replacement": "sure-footed ","text": "Halflings are experts at the use of the sling. Halflings with this racial trait can reload a sling as a free action. Reloading a sling still requires two hands and provokes attacks of opportunity. This racial trait replaces sure-footed."},
{"race": "Human","trait": "Adoptive Parentage","replacement": "bonus feat ","text": "Humans are sometimes orphaned and adopted by other races. Choose one humanoid race without the human subtype. You start play with that race's languages and gain that race's weapon familiarity racial trait (if any). If the race does not have weapon familiarity, you gain either Skill Focus or Weapon Focus as a bonus feat that is appropriate for that race instead. This racial trait replaces the bonus feat trait."},
{"race": "Human","trait": "Dual Talent","replacement": "skilled","text": "Some humans are uniquely skilled at maximizing their natural gifts. These humans pick two ability scores and gain a +2 racial bonus in each of those scores. This racial trait replaces the +2 bonus to any one ability score, the bonus feat, and the skilled traits."},
{"race": "Human","trait": "Eye for Talent","replacement": "bonus feat ","text": "Humans have great intuition for hidden potential. They gain a +2 racial bonus on Sense Motive checks. In addition, when they acquire an animal companion, bonded mount, cohort, or familiar, that creature gains a +2 bonus to one ability score of the character's choice. This racial trait replaces the bonus feat trait."},
{"race": "Human","trait": "Focused Study","replacement": "bonus feat ","text": "All humans are skillful, but some, rather than being generalists, tend to specialize in a handful of skills. At 1st, 8th, and 16th level, such humans gain Skill Focus in a skill of their choice as a bonus feat. This racial trait replaces the bonus feat trait."},
{"race": "Human","trait": "Heart of the Fields","replacement": "skilled","text": "Humans born in rural areas are used to hard labor. They gain a racial bonus equal to half their character level to any one Craft or Profession skill, and once per day they may ignore an effect that would cause them to become fatigued or exhausted. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Mountains","replacement": "skilled","text": "Humans born in the mountains are skilled at negotiating heights and precipices. They gain a +2 racial bonus on Climb checks and Acrobatics checks to move on narrow surfaces and uneven ground. Furthermore, they are considered acclimated to the effects of high altitude. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Sea","replacement": "skilled","text": "Humans born near the sea are always drawn to it. They gain a +2 racial bonus on Profession (sailor) and Swim checks, and these are always class skills for them. They can hold their breath twice as long as normal, and spellcasters gain a +4 racial bonus on concentration checks when attempting to cast spells underwater. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Slums","replacement": "skilled","text": "Humans who eke out a life in a city's teeming slums must be quick and clever. They gain a +2 racial bonus on Sleight of Hand and Stealth checks, and a +4 racial bonus on Survival checks in urban and underground settings. In addition, they may roll twice when saving against disease, taking the better roll. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Snows","replacement": "skilled","text": "Humans born in chilly climes treat cold climates as one category less severe. They gain a +2 racial bonus on Fortitude saving throws against the effects of cold climates, on any check or saving throw to avoid slipping and falling, and to CMD against trip combat maneuvers. This bonus applies on Acrobatics and Climb checks made in slippery conditions. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Streets","replacement": "skilled","text": "Humans from bustling cities are skilled with crowds. They gain a +1 racial bonus on Reflex saves and a +1 dodge bonus to Armor Class when adjacent to at least two other allies. Crowds do not count as difficult terrain for them. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Sun","replacement": "skilled","text": "Humans born in tropical climates treat hot climates as one category less severe. They also gain a +2 racial bonus on Fortitude saving throws against the effects of a hot climate, as well as against the poison and distraction ability of swarms and vermin. This racial trait replaces skilled."},
{"race": "Human","trait": "Heart of the Wilderness","replacement": "skilled","text": "Humans raised in the wild learn the hard way that only the strong survive. They gain a racial bonus equal to half their character level on Survival checks. They also gain a +5 racial bonus on Constitution checks to stabilize when dying and add half their character level to their Constitution score when determining the negative hit point total necessary to kill them. This racial trait replaces skilled."},
{"race": "Human","trait": "Heroic","replacement": "bonus feat ","text": "Some humans are born heroes. In campaigns that use the optional hero point system, each time these humans gain a level, they gain 2 hero points instead of 1. If they take the Blood of Heroes feat, they gain 3 hero points each level instead of 2. This racial trait replaces the bonus feat trait."},
{"race": "Human","trait": "Mixed Heritage","replacement": "bonus feat ","text": "Often human civilization is defined by more than one characteristic. A human with this trait may select a second \"Heart of the\" racial trait. This replaces the bonus feat racial trait."},
{"race": "Human","trait": "Silver Tongued","replacement": "skilled","text": "Human are often adept at subtle manipulation and putting even sworn foes at ease. Humans with this trait gain a +2 bonus on Diplomacy and Bluff checks. In addition, when they use Diplomacy to shift a creature's attitude, they can shift up to three steps up rather than just two. This racial trait replaces skilled."},
{"race": "Aasimar","trait": "Celestial Crusader","replacement": "celestial resistance, skilled ","text": "Some aasimars follow their destiny to war against the powers of ultimate evil. These individuals gain a +1 insight bonus on attack rolls and to AC against evil outsiders and a +2 racial bonus on Knowledge (planes) and Spellcraft checks to identify evil outsiders or items or effects created by evil outsiders; they may use these skills untrained for this purpose. This racial trait replaces celestial resistance and skilled."},
{"race": "Aasimar","trait": "Deathless Spirit","replacement": "celestial resistance ","text": "Particularly strong-willed aasimars possess celestial spirits capable of resisting the powers of death. They gain resistance 5 against negative energy damage. They do not lose hit points when they gain a negative level, and they gain a +2 racial bonus on saving throws against death effects, energy drain, negative energy, and spells or spell-like abilities of the necromancy school. This racial trait replaces celestial resistance."},
{"race": "Aasimar","trait": "Exalted Resistance","replacement": "celestial resistance ","text": "An aasimar with this racial trait gains spell resistance equal to 5 + her level against spells and spell-like abilities with the evil descriptor, as well as any spells and spell-like abilities cast by evil outsiders. This racial trait replaces celestial resistance."},
{"race": "Aasimar","trait": "Halo","replacement": "darkvision ","text": "Some aasimars possess the ability to manifest halos. An aasimar with this racial trait can create light centered on her head at will as a spell-like ability. When using her halo, she gains a +2 circumstance bonus on Intimidate checks against evil creatures and on saving throws against becoming blinded or dazzled. This racial trait replaces the darkvision racial trait."},
{"race": "Aasimar","trait": "Heavenborn","replacement": "skilled, spell-like ability ","text": "Born in the celestial realms, aasimars with this racial trait gain a +2 bonus on Knowledge (planes) checks and they cast spells with the good or light descriptor at +1 caster level. This racial trait replaces the skilled and spell-like ability racial traits."},
{"race": "Aasimar","trait": "Immortal Spark","replacement": "skilled, spell-like ability ","text": "Aasimars with this racial trait defy the powers of death. They gain a +2 bonus on Knowledge (history) checks and saving throws against death effects and can use lesser age resistance once per day as a spell-like ability. This racial trait replaces the skilled and spell-like ability racial traits."},
{"race": "Aasimar","trait": "Incorruptible","replacement": "spell-like ability ","text": "Occasionally, aasimars arise with the ability to further ward away evil. Aasimars with this racial trait can cast corruption resistance against evil once per day as a spell-like ability. If an aasimar uses this ability on herself, the duration increases to 1 hour per level. This racial trait replaces the spell-like ability racial trait."},
{"race": "Aasimar","trait": "Scion of Humanity","replacement": "SPECIAL","text": "Some aasimars' heavenly ancestry is extremely distant. An aasimar with this racial trait counts as an outsider (native) and a humanoid (human) for any effect related to race, including feat prerequisites and spells that affect humanoids. She can pass for human without using the Disguise skill. This racial trait replaces the Celestial language and alters the native subtype."},
{"race": "Aasimar","trait": "Truespeaker","replacement": "skilled ","text": "There are some aasimars whose language transcends all boundaries. They gain a +2 bonus on Linguistics and Sense Motive checks, and they learn two languages each time they gain a rank in Linguistics. This racial trait replaces skilled."},
{"race": "Catfolk","trait": "Cat's Claws","replacement": "natural hunter","text": "Some catfolk have stronger and more developed claws than other members of their race, and can use them to make attacks. Catfolk with this racial trait have a pair of claws they can use as natural weapons. These claws are primary attacks that deal 1d4 points of damage. This racial trait replaces natural hunter."},
{"race": "Catfolk","trait": "Clever Cat","replacement": "natural hunter","text": "Catfolk's generally friendly disposition doesn't preclude craftiness. Some of them see social obstacles as games to be played and won. These catfolk receive a +2 racial bonus on Bluff, Diplomacy, and Sense Motive checks. This racial trait replaces natural hunter."},
{"race": "Catfolk","trait": "Climber","replacement": "sprinter","text": "Catfolk hunters excel at hunting prey from trees and other high vantage points. Catfolk with this racial trait possess a climb speed of 20 feet (along with the +8 racial bonus on Climb checks a climb speed affords). This racial trait replaces sprinter."},
{"race": "Catfolk","trait": "Curiosity","replacement": "natural hunter","text": "Catfolk are naturally inquisitive about the world around them, though some are more curious than others. Such catfolk gain a +4 bonus on Diplomacy checks to gather information, and Knowledge (history) and Knowledge (local) are always class skills for them. If they choose a class that has either of these Knowledge skills as class skills, they gain a +2 racial bonus on those skills instead. This racial trait replaces natural hunter."},
{"race": "Catfolk","trait": "Nimble Faller","replacement": "sprinter","text": "Some catfolk have an amazing sense of balance and keen knowledge of their own center of gravity. Catfolk with this trait land on their feet even when they take lethal damage from a fall. Furthermore, catfolk with this trait gain a +1 bonus to their CMD against trip maneuvers. This racial trait replaces sprinter."},
{"race": "Catfolk","trait": "Scent","replacement": "low-light vision","text": "Some catfolk favor a keen sense of smell over sensitive sight. Catfolk with this racial trait gain the scent ability. This racial trait replaces the low-light vision racial trait."},
{"race": "Dhampir","trait": "Dayborn","replacement": "spell-like ability","text": "A few fortunate dhampirs were born during the day under the blessings of priests, and their blood has weaker ties to their undead bloodline than others of their kind. Such dhampirs are unhindered by daylight and lose the light sensitivity racial trait. This racial trait replaces the spell-like ability racial trait."},
{"race": "Dhampir","trait": "Fangs","replacement": "spell-like ability","text": "On occasion, a dhampir may inherit his father's lengthy canines. Whenever the dhampir makes a grapple combat maneuver check to damage an opponent, he can choose to bite his opponent, dealing 1d3 points of damage as if using a natural bite attack. As a standard action, the dhampir can bite a creature that is bound, helpless, paralyzed, or similarly unable to defend itself. This racial trait replaces the spell-like ability racial trait."},
{"race": "Dhampir","trait": "Vampiric Empathy","replacement": "manipulative","text": "Though dhampirs often relate poorly to humanoids, some share an affinity with baser creatures. These dhampirs gain the ability to communicate with bats, rats, and wolves as if under the effects of a speak with animals spell (caster level equal to 1/2 the dhampir's Hit Dice). In addition, they gain a +2 racial bonus on Diplomacy checks when dealing with these animals. Whenever these dhampirs initiate an exchange, animals begin with a starting attitude of indifferent. This is a supernatural ability. This racial trait replaces manipulative."},
{"race": "Drow","trait": "Ambitious Schemer","replacement": "keen sight","text": "Seduction and treachery are tools for advancement in drow society, even for the martially inclined. Drow with this racial trait may choose either Bluff or Diplomacy as a class skill, and gain a +2 bonus on such skill checks. This racial trait replaces keen sight."},
{"race": "Drow","trait": "Ancestral Grudge","replacement": "poison use","text": "The enmity between the drow and elves and dwarves is long-standing and deeply entrenched. Drow with this racial trait gain a +1 bonus on attack rolls against humanoids with the dwarf or elf subtypes (with the exception of drow) because of their special training against these reviled foes. This racial trait replaces poison use."},
{"race": "Drow","trait": "Blasphemous Covenant","replacement": "keen senses, poison use","text": "Since their twisted beginnings, the drow have consorted with demons. Some drow have strong ties with these creatures and may call upon ancient and obscene associations to sway demonic cooperation. Drow with this racial trait gain a +2 bonus on Diplomacy checks made against unbound creatures with the demon subtype. Furthermore, demons conjured with any summon spell gain +2 hit points per Hit Die. Lastly, the cost of bribes or offerings for any planar ally spell cast by these drow to summon a demon is reduced by 20%. This racial trait replaces keen senses and poison use."},
{"race": "Drow","trait": "Darklands Stalker","replacement": "spell-like abilities","text": "The lands outside of drow cities, from rough-hewn tunnels to rocky caverns, are treacherous to navigate. Drow with this racial trait may move through difficult terrain without penalty while underground. In addition, drow with a Dexterity of 13 or higher gain Nimble Moves as a bonus feat. This racial trait replaces the spell-like abilities racial trait."},
{"race": "Drow","trait": "Seducer","replacement": "drow immunities","text": "Certain drow possess an innate understanding of the darkest desires that lurk in every heart. Drow with this racial trait add +1 to the saving throw DCs for spells and spell-like abilities of the enchantment school. In addition, drow with a Wisdom score of 15 or higher may use charm person once per day as a spell-like ability (caster level equal to the drow's character level). This racial trait replaces drow immunities."},
{"race": "Drow","trait": "Surface Infiltrator","replacement": "darkvision, light blindness","text": "Some drow dwell close to the surface lands, either because they serve drow causes or they were exiled. Drow with this racial trait gain low-light vision, allowing them to see twice as far as humans in conditions of dim light. This racial trait replaces the darkvision and light blindness racial traits."},
{"race": "Fetchling","trait": "Emissary","replacement": "shadow blending","text": "Rare fetchlings excel in the role of emissary between the Shadow Plane and the Material Plane. Once per day, such a fetchling can roll twice when making a Bluff or Diplomacy check and take the better roll. This racial trait replaces shadow blending."},
{"race": "Fetchling","trait": "Gloom Shimmer","replacement": "modifies spell-like ability SPECIAL","text": "Some fetchlings can manipulate shadowy energy in order to displace their location instead of transporting between shadows. Upon reaching 9th level, instead of gaining shadow walk as a spell-like ability, these fetchlings gain displacement as a spell-like ability usable twice per day. For this ability, a fetchling's caster level is equal to his total Hit Dice. This racial trait modifies the spell-like ability racial trait."},
{"race": "Fetchling","trait": "Shadow Magic","replacement": "skilled","text": "Fetchlings who spend their time studying the subtle magic of their adopted plane gain arcane insights on the use of shadow spells. These fetchlings gain a +1 racial bonus to the DC of any illusion (shadow) spells they cast. This racial trait replaces the skilled racial trait."},
{"race": "Fetchling","trait": "Subtle Manipulator","replacement": "modifies spell-like ability SPECIAL","text": "Rather than taking on the forms of others, some fetchling are adept at destroying the memories of other creatures. Instead of gaining disguise self as a spell-like ability, such fetchlings can use memory lapse once per day as a spell-like ability. For this ability, a fetchling's caster level is equal to his total Hit Dice. This racial trait modifies the spell-like ability racial trait."},
{"race": "Fetchling","trait": "World Walker","replacement": "modifies skilled SPECIAL","text": "Fetchlings who have spent most of their lives on the Material Plane can become more acclimated to their new environments. Instead of gaining a +2 racial bonus on Knowledge (planes) checks, these fetchlings gain a +1 racial bonus on Knowledge (nature) and Knowledge (local) checks. This racial trait modifies the skilled racial trait."},
{"race": "Goblin","trait": "Cave Crawler","replacement": "fast movement","text": "Some goblins are born and raised in caves and rarely see the light of day. Goblins with this trait gain a climb speed of 10 feet and the +8 racial bonus on Climb checks associated with having a climb speed. Goblins with this racial trait have a base speed of 20 feet and lose the fast movement racial trait."},
{"race": "Goblin","trait": "City Scavenger","replacement": "skilled","text": "Goblins who live within the boundaries of human cities survive by scavenging for refuse and hunting stray animals. Goblins with this trait gain a +2 racial bonus on Perception and Survival checks, and can use Survival to forage for food while in a city. This racial trait replaces skilled."},
{"race": "Goblin","trait": "Eat Anything","replacement": "skilled","text": "Raised with little or no proper food, many goblins have learned to survive by eating whatever they happen across and can digest nearly anything without getting sick. Goblins with this trait gain a +4 on Survival checks to forage for food and a +4 racial bonus on saves versus effects that cause the nauseated or sickened conditions. This racial trait replaces skilled."},
{"race": "Goblin","trait": "Hard Head, Big Teeth","replacement": "skilled","text": "Goblins are known for their balloonlike heads and enormous maws, but some have even more exaggeratedly large heads filled with razor-sharp teeth. Goblins with this trait gain a bite attack as a primary natural attack that deals 1d4 points of damage. This racial trait replaces skilled."},
{"race": "Goblin","trait": "Over-Sized Ears","replacement": "skilled","text": "While goblins' ears are never dainty, these goblins have freakishly large ears capable of picking up even the smallest sounds. Goblins with this racial trait gain a +4 bonus on Perception checks. This racial trait replaces skilled."},
{"race": "Goblin","trait": "Tree Runner","replacement": "skilled","text": "In trackless rain forests and marshes, it can be difficult to find dry ground to build on. Goblin tribes living in such areas have learned to live in the treetops. These goblins gain a +4 racial bonus on Acrobatics and Climb checks. This racial trait replaces skilled."},
{"race": "Goblin","trait": "Weapon Familiarity","replacement": "skilled","text": "Goblins' traditional weapons are the dogslicer and the horsechopper, weapons designed specifically to bring down their most hated foes. Goblins with this trait are proficient with the dogslicer and the horsechopper, and treat any weapon with the word \"goblin\" in it as martial weapons. This racial trait replaces skilled."},
{"race": "Hobgoblin","trait": "Bandy-Legged","replacement": "SPECIAL","text": "Bandy-legged hobgoblins have an even more exaggerated stature than other hobgoblins, with bowed legs and massive shoulders. Hobgoblins with this racial trait gain a +2 racial bonus on Climb and Ride checks, and a +2 racial bonus to their CMD against bull rush or trip attempts while on solid ground. The base speed of bandy-legged hobgoblins is reduced to 20 feet."},
{"race": "Hobgoblin","trait": "Battle-Hardened","replacement": "sneaky","text": "Incessant drills make defense second nature to some hobgoblins. Hobgoblins with this racial trait gain a +1 bonus to CMD. This racial trait replaces sneaky."},
{"race": "Hobgoblin","trait": "Engineer","replacement": "sneaky","text": "Hobgoblin engineers tinker endlessly with fire, explosives, and the engines of war. Hobgoblins with this racial trait gain a +2 racial bonus on Craft (alchemy) and Knowledge (engineering) checks. This racial trait replaces sneaky."},
{"race": "Hobgoblin","trait": "Fearsome","replacement": "sneaky","text": "Some hobgoblins scorn caution and subtlety for swagger and bluster. Hobgoblins with this racial trait gain a +4 racial bonus on Intimidate checks. This racial trait replaces sneaky."},
{"race": "Hobgoblin","trait": "Magehunter","replacement": "sneaky","text": "Hobgoblins hate and fear arcane casters. A magehunter gains a +2 racial bonus on Spellcraft checks made to identify a spell being cast and a +1 racial bonus on attack rolls against arcane spellcasters. He only gains this bonus against creatures that use spells, and not against those that only use spell-like abilities. This racial trait replaces sneaky."},
{"race": "Hobgoblin","trait": "Pit Boss","replacement": "sneaky","text": "Slave blood fuels the hobgoblin war machine. Pit bosses extract the last breath of labor from their charges with a liberal touch of the lash. Hobgoblins with this racial trait gain proficiency with whips and a +1 racial bonus on combat maneuver checks made to disarm or trip with a whip. This racial trait replaces sneaky."},
{"race": "Hobgoblin","trait": "Scarred","replacement": "darkvision","text": "A hobgoblin can scar himself with both blade and fire to toughen his hide into a mass of horny scars. Hobgoblins with this racial trait gain a +1 natural armor bonus to Armor Class. However, the repeated exposure to fire permanently damages their eyes. This racial trait replaces the darkvision racial trait."},
{"race": "Hobgoblin","trait": "Slave Hunter","replacement": "sneaky","text": "Hobgoblin slavers excel at tracking down runaway slaves and surviving in filthy conditions. Hobgoblins with this racial trait gain a +2 racial bonus on Survival checks and a +2 racial bonus on Fortitude saves against disease. This racial trait replaces sneaky."},
{"race": "Hobgoblin","trait": "Unfit","replacement": "sneaky","text": "Hobgoblins who failed to secure a position in the military hold the lowest status in hobgoblin society, and quickly learn the value of currying favor with their betters. Hobgoblins with this racial trait gain proficiency in a single martial weapon and +1 racial bonus on Bluff and Diplomacy checks. This racial trait replaces sneaky."},
{"race": "Ifrit","trait": "Desert Mirage","replacement": "fire affinity","text": "Ifrits thrive in the deserts of the world, where their keen instincts and resistance to heat give them a huge edge over their competitors. Those with this trait gain a +2 racial bonus on Stealth checks in desert environments and on saves to resist starvation and thirst. This racial trait replaces fire affinity."},
{"race": "Ifrit","trait": "Efreeti Magic","replacement": "spell-like ability","text": "Some ifrits inherit an efreeti ancestor's ability to magically change a creature's size. They can cast either enlarge person or reduce person (the ifrit chooses when using this ability) once per day as a spell-like ability (caster level equals the ifrit's level). The ifrit can use this ability to affect other ifrits as though they were humanoid creatures. This racial trait replaces the spell-like ability racial trait."},
{"race": "Ifrit","trait": "Fire in the Blood","replacement": "fire affinity","text": "Ifrits with this racial trait mimic the healing abilities of the mephits, gaining fast healing 2 for 1 round anytime they take fire damage (whether or not this fire damage gets through their fire resistance). The ifrits can heal up to 2 hit points per level per day with this ability, after which it ceases to function. This racial trait replaces fire affinity."},
{"race": "Ifrit","trait": "Fire Insight","replacement": "fire affinity","text": "Ifrit spellcasters sometimes find that their elemental heritage makes creatures of fire more willing to serve them. Summon monster and summon nature's ally spells that the ifrit casts last 2 rounds longer than normal when used to summon creatures with the fire subtype. This racial trait replaces fire affinity."},
{"race": "Ifrit","trait": "Fire-Starter","replacement": "fire affinity","text": "Ifrits with this racial trait derive sadistic satisfaction from watching others burn. Anytime the ifrit causes a creature to catch fire, he gains a +1 morale bonus on the next single attack roll, saving throw, skill check, or ability check that he makes in the next round. The ifrit only gains this bonus the first time he causes a particular creature to catch fire; subsequent times the creature catches fire provide no bonus. This racial trait replaces fire affinity."},
{"race": "Ifrit","trait": "Forge-Hardened","replacement": "spell-like ability","text": "Not all ifrits are descended from efreet—some instead descend from azers or even salamanders. Such ifrits gain a +2 racial bonus on Craft (armor and weapons) checks and saves to resist fatigue and exhaustion. This racial trait replaces the spell-like ability racial trait."},
{"race": "Ifrit","trait": "Hypnotic","replacement": "fire affinity","text": "Ifrits with this racial trait evoke the entrancing nature of flame, adding +1 to the DC for all saving throws against spells or effects they cast that inflict the fascinated condition. Once per day, when a creature rolls a saving throw against such an effect from the ifrit, the ifrit can spend an immediate action to force that creature to reroll the saving throw and use the second result, even if it is worse. The ifrit must announce he is using this ability before the results of the first roll are revealed. This racial trait replaces fire affinity."},
{"race": "Ifrit","trait": "Wildfire Heart","replacement": "energy resistance","text": "Ifrits with this trait are as swift and dangerous as a blazing wildfire. They gain a +4 racial bonus on initiative checks. This racial trait replaces energy resistance."},
{"race": "Kobold","trait": "Beast Bond","replacement": "crafty","text": "Some kobolds have a talent for training animals and beasts to help them both on and off the battlefield. Kobolds with this racial trait gain a +2 racial bonus on Handle Animal and Ride checks. Handle Animal and Ride are always class skills for them. This racial trait replaces crafty."},
{"race": "Kobold","trait": "Dragon-Scaled","replacement": "armor","text": "Some kobolds are hatched with scales of such vivid color that their connection to a particular sort of chromatic dragon seems undeniable. Whether this coloration is just a quirk of a stray egg or a trait shared by all the members of a tribe, these kobolds gain a resistance that makes them especially suited to work alongside dragons matching the color of the kobold's scales. Black-scaled and green-scaled kobolds with this racial trait gain acid resistance 5. Blue-scaled kobolds with this racial trait gain electricity resistance 5. Red-scaled kobolds with this racial trait gain fire resistance 5. White-scaled kobolds with this racial trait gain cold resistance 5. This racial trait replaces the armor racial trait."},
{"race": "Kobold","trait": "Gliding Wings","replacement": "crafty","text": "Some kobolds are born with wings that, while too weak for actual flying, do allow them to fall at a very slow and safe pace. A kobold with wings can use them to glide. It can make a DC 15 Fly check to fall safely from any height without taking falling damage, as if using feather fall. When falling safely, it may make an additional DC 15 Fly check to glide, moving 5 feet laterally for every 20 feet it falls. This racial trait replaces crafty."},
{"race": "Kobold","trait": "Jester","replacement": "crafty","text": "Some kobolds swallow their pride and survive by groveling, placating, and amusing the powerful. Kobolds with this racial trait gain a +2 racial bonus on Diplomacy and Perform checks. Diplomacy and Perform are always class skills for them. This racial trait replaces crafty."},
{"race": "Orc","trait": "Dayrunner","replacement": "light sensitivity","text": "Orcs refuse to yield to any foe, including the sun. Some spend hour upon hour glaring at the sun until their ruined eyes acclimatize to bright light. Orcs with this racial trait take a –2 penalty on all ranged attack rolls. This racial trait replaces light sensitivity."},
{"race": "Orc","trait": "Feral","replacement": "orc's weapon familiarity, automatic languages, SPECIAL","text": "Orcs have the ability to fend for themselves long before they master the rudiments of their language and culture. Having needed to hunt bugs and tiny animals for food to survive while still infants, feral orcs fight all the harder to survive when at the brink of death. Orcs with this racial trait gain Survival as a class skill and gain a +1 racial bonus on melee weapon attack and damage rolls when at negative hit points. This racial trait replaces the orc's weapon familiarity and automatic languages. Feral orcs without additional languages due to high Intelligence scores or ranks in Linguistics can only communicate with grunts and gestures."},
{"race": "Orc","trait": "Smeller","replacement": "ferocity, weapon familiarity","text": "Orcs with this racial trait gain a limited scent ability with half the normal range. This racial trait replaces ferocity and weapon familiarity."},
{"race": "Orc","trait": "Squalid","replacement": "ferocity","text": "Some orcs exist in surroundings so filthy and pestilent that even other orcs would have difficulty living in them. Orcs with this racial trait gain a +2 racial bonus on saving throws made to resist nausea, the sickened condition, and disease. This racial trait replaces ferocity."},
{"race": "Oread","trait": "Crystalline Form","replacement": "earth affinity","text": "Oreads with this trait gain a +2 racial bonus to AC against rays thanks to their reflective crystalline skin. In addition, once per day, they can deflect a single ray attack targeted at them as if they were using the Deflect Arrows feat. This racial trait replaces earth affinity."},
{"race": "Oread","trait": "Earth Insight","replacement": "earth affinity","text": "Oread spellcasters sometimes find that their elemental heritage makes creatures of earth more willing to serve them. Summon monster and summon nature's ally spells that such oreads cast last 2 rounds longer than normal when used to summon creatures with the earth subtype. This racial trait replaces earth affinity."},
{"race": "Oread","trait": "Ferrous Growth","replacement": "spell-like ability","text": "Oreads with this racial trait learn how to mimic the magic of their shaitan ancestors. Once per day, such an oread can cause a touched piece of nonmagical iron or steel to grow into an object up to 10 pounds in weight, such as a sword, crowbar, or light steel shield. This object remains in this form for 10 minutes or until broken or destroyed, at which point it shrinks back to its original size and shape. This racial trait replaces the spell-like ability racial trait."},
{"race": "Oread","trait": "Fertile Soil","replacement": "earth affinity","text": "Oread sorcerers with the verdant bloodline treat their Charisma score as 2 points higher for all sorcerer spells and class abilities. Oread clerics with the Plant domain use their domain powers and spells at +1 caster level. This racial trait replaces earth affinity."},
{"race": "Oread","trait": "Granite Skin","replacement": "energy resistance","text": "Rocky growths cover the skin of oreads with this racial trait. They gain a +1 racial bonus to natural armor. This racial trait replaces energy resistance."},
{"race": "Oread","trait": "Mountain-Born","replacement": "spell-like ability","text": "Oreads are drawn to mountains and other high places, and after many generations they've grown well suited to their environment. Oreads with this racial trait gain a +2 racial bonus on Acrobatics checks made to cross narrow ledges and on saves against altitude fatigue and sickness. This racial trait replaces the spell-like ability racial trait."},
{"race": "Oread","trait": "Stone in the Blood","replacement": "earth affinity","text": "Oreads with this racial trait mimic the healing abilities of the mephits, gaining fast healing 2 for 1 round anytime they are subject to acid damage (the acid damage does not need to overcome the oread's resistances or immunities to activate this ability). The oread can heal up to 2 hit points per level per day with this ability, after which it ceases to function. This racial trait replaces earth affinity."},
{"race": "Oread","trait": "Treacherous Earth","replacement": "spell-like ability","text": "Once per day, an oread with this racial trait can will the earth to rumble and shift, transforming a 10-foot-radius patch of earth, unworked stone, or sand into an area of difficult terrain, centered on an area the oread touches. This lasts for a number of minutes equal to the oread's level, after which the ground returns to normal. This racial trait replaces the spell-like ability racial trait."},
{"race": "Ratfolk","trait": "Cornered Fury","replacement": "swarming","text": "Ratfolk can fight viciously when cut off from friends and allies. Whenever a ratfolk with this racial trait is reduced to half or fewer of his hit points, and has no conscious ally within 30 feet, he gains a +2 racial bonus on melee attack rolls and to Armor Class. This racial trait replaces swarming."},
{"race": "Ratfolk","trait": "Scent","replacement": "tinker","text": "Some ratfolk have much more strongly developed senses of smell, instead of keen eyes and ears. These ratfolk have the scent ability, but take a –2 penalty on all Perception checks based primarily on sight or hearing. This racial trait replaces tinker."},
{"race": "Ratfolk","trait": "Skulk","replacement": "tinker","text": "Some ratfolk can blend easily into their environments, and move with surprising grace. Ratfolk gain a +2 racial bonus on Stealth checks, and take only a –5 penalty on Stealth checks made to hide from creatures they have distracted with a Bluff check (rather than the normal –10 penalty). This racial trait replaces tinker."},
{"race": "Ratfolk","trait": "Unnatural","replacement": "rodent empathy","text": "Some ratfolk unnerve normal animals, and train to defend themselves against the inevitable attacks from such creatures. These ratfolk take a –4 penalty on all Charisma-based skill checks to affect creatures of the animal type, and receive a +2 dodge bonus to AC against animals. An animal's starting attitude toward ratfolk is one step worse than normal. This racial trait replaces rodent empathy."},
{"race": "Sylph","trait": "Air Insight","replacement": "air affinity","text": "Sylph spellcasters sometimes find that their elemental heritage makes creatures of air more willing to serve them. Summon monster and summon nature's ally spells that the sylph casts last 2 rounds longer than normal when used to summon creatures with the air subtype. This racial trait replaces air affinity."},
{"race": "Sylph","trait": "Breeze-Kissed","replacement": "air affinity","text": "Breezes seem to follow most sylphs wherever they go, but some sylphs are better able to control these winds than others. A sylph with this racial trait surrounds herself with swirling winds, gaining a +2 racial bonus to AC against nonmagical ranged attacks. The sylph can calm or renew these winds as a swift action. Once per day, the sylph can channel this wind into a single gust, making a bull rush or trip combat maneuver attempt against one creature within 30 feet. Whether or not the attempt succeeds, the winds are exhausted and no longer provide a bonus to the sylph's AC for 24 hours. This is a supernatural ability. This racial trait replaces air affinity."},
{"race": "Sylph","trait": "Like the Wind","replacement": "energy resistance","text": "A sylph with this racial trait gains a +5 foot bonus to her base speed. This racial trait replaces energy resistance."},
{"race": "Sylph","trait": "Sky Speaker","replacement": "spell-like ability","text": "Sylphs with this racial trait feel kinship toward the creatures of the air, and can use speak with animals once per day to speak to birds or other flying animals. Her caster level for these effects is equal to her level. This racial trait replaces the sylph's spell-like ability racial trait."},
{"race": "Sylph","trait": "Storm in the Blood","replacement": "air affinity","text": "A sylph with this racial trait gains fast healing 2 for 1 round anytime she takes electricity damage (whether or not this electricity damage gets through her electricity resistance). The sylph can heal up to 2 hit points per level per day with this ability, after which it ceases to function. This racial trait replaces air affinity."},
{"race": "Sylph","trait": "Thunderous Resilience","replacement": "energy resistance","text": "Sylphs with this racial trait gain sonic resistance 5. This racial trait replaces energy resistance."},
{"race": "Sylph","trait": "Weather Savvy","replacement": "spell-like ability","text": "Some sylphs are so in tune with the air and sky that they can sense the slightest change in atmospheric conditions. Sylphs with this trait can spend a full-round action to predict the weather in an area for the next 24 hours. The sylph's prediction is always accurate, but cannot account for spells or supernatural effects that might alter the forecast. This racial trait replaces the sylph's spell-like ability racial trait."},
{"race": "Sylph","trait": "Whispering Wind","replacement": "spell-like ability","text": "Some sylphs are especially thin and wispy, as though they were made more of air than flesh. Sylphs with this racial trait gain a +4 racial bonus on Stealth checks. This racial trait replaces the sylph's spell-like ability racial trait."},
{"race": "Tengu","trait": "Carrion Sense","replacement": "gifted linguist","text": "Many tengus have a natural ability to sniff out carrion. While their sense of smell isn't as keen as that of other species, it is particularly attuned to the scent of injuries or death. Tengus with this racial trait have a limited scent ability, which only functions for corpses and badly wounded creatures (50% or fewer hit points). This racial trait replaces gifted linguist."},
{"race": "Tengu","trait": "Claw Attack","replacement": "swordtrained","text": "Tengus with this racial trait have learned to use their claws as natural weapons. They gain two claw attacks as primary natural attacks that deal 1d3 points of damage, and are treated as having the Improved Unarmed Strike feat for the purpose of qualifying for other feats. This racial trait replaces swordtrained."},
{"race": "Tengu","trait": "Exotic Weapon Training","replacement": "swordtrained","text": "Instead of swords, some tengus are trained in exotic weaponry. Such tengus choose a number of eastern weapons equal to 3 + their Intelligence bonus, and gain proficiency with these weapons. This racial trait replaces swordtrained."},
{"race": "Tengu","trait": "Glide","replacement": "gifted linguist","text": "Some tengus can use their feathered arms and legs to glide. Tengus with this racial trait can make a DC 15 Fly check to fall safely from any height without taking falling damage, as if using feather fall. When falling safely, a tengu may make an additional DC 15 Fly check to glide, moving 5 feet laterally for every 20 feet he falls. This racial trait replaces gifted linguist."},
{"race": "Tiefling","trait": "Beguiling Liar","replacement": "skilled","text": "Many tieflings find that the best way to get along in the world is to tell others what they want to hear. These tieflings' practice of telling habitual falsehoods grants them a +4 racial bonus on Bluff checks to convince an opponent that what they are saying is true when they tell a lie. This racial trait replaces skilled."},
{"race": "Tiefling","trait": "Fiendish Sprinter","replacement": "skilled","text": "Some tieflings have feet that are more bestial than human. Whether their feet resemble those of a clawed predator or are the cloven hooves common to many of their kind, tieflings with this trait gain a 10-foot racial bonus to their speed when using the charge, run, or withdraw actions. This racial trait replaces skilled."},
{"race": "Tiefling","trait": "Maw or Claw","replacement": "spell-like ability","text": "Some tieflings take on the more bestial aspects of their fiendish ancestors. These tieflings exhibit either powerful, toothy maws or dangerous claws. The tiefling can choose a bite attack that deals 1d6 points of damage or two claws that each deal 1d4 points of damage. These attacks are primary natural attacks. This racial trait replaces the spell-like ability racial trait."},
{"race": "Tiefling","trait": "Prehensile Tail","replacement": "fiendish sorcery","text": "Many tieflings have tails, but some have long, flexible tails that can be used to carry items. While they cannot wield weapons with their tails, they can use them to retrieve small, stowed objects carried on their persons as a swift action. This racial trait replaces fiendish sorcery."},
{"race": "Tiefling","trait": "Scaled Skin","replacement": "fiendish resistance","text": "The skin of these tieflings provides some energy resistance, but is also as hard as armor. Choose one of the following energy types: cold, electricity, or fire. A tiefling with this trait gains resistance 5 in the chosen energy type and also gains a +1 natural armor bonus to AC. This racial trait replaces fiendish resistance."},
{"race": "Tiefling","trait": "Soul Seer","replacement": "spell-like ability, fiendish sorcerys","text": "Rare tieflings have a peculiar sight that allows them to see the state of a creature's soul. They can use deathwatch at will as spell-like ability. This racial trait replaces the spell-like ability and fiendish sorcery racial traits."},
{"race": "Tiefling","trait": "Vestigial Wings","replacement": "skilled","text": "Some tieflings possess a pair of undersized, withered, or stunted wings like a mockery of those of their fiendish forbearer. Sometimes these wings are leathery, like those of a bat. Other times they are covered with a scattering of black, red, or violet feathers. Rare manifestations can take even more bizarre forms. These wings do not provide the lift required for actual flight, but do have enough power to aid flight attained by some other method, and grant a +4 racial bonus on Fly skill checks. This racial trait replaces skilled."},
{"race": "Undine","trait": "Acid Breath","replacement": "spell-like ability","text": "Undines whose outsider heritage can be traced to a water mephit can wield acid as a weapon. Such an undine has a breath weapon that is a 5-foot cone of acidic water usable once per day. The breath deals 1d8 points of acid damage per two character levels (maximum 5d8). A Reflex saving throw (DC 10 + 1/2 the undine's level + the undine's Constitution modifier) halves the damage. This racial trait replaces the spell-like ability racial trait."},
{"race": "Undine","trait": "Amphibious","replacement": "spell-like ability","text": "Some undines are born with a permanent bond to water. Undines with this racial trait gain the aquatic subtype and amphibious special quality. This racial trait replaces the spell-like ability racial trait."},
{"race": "Undine","trait": "Deepsight","replacement": "darkvision","text": "The eyes of some undines are especially adapted to the lightless depths of the oceans, but not to air-filled environments. An undine with this racial trait has darkvision 120 feet when underwater, but otherwise has no darkvision at all. This racial trait replaces darkvision."},
{"race": "Undine","trait": "Flesh Chameleon","replacement": "energy resistance","text": "Some undines can change their coloration to match human skin tones. As a standard action, an undine with this racial trait can change her natural blue hue to match any normal human skin tone, and can revert to normal as a free action. This grants a +4 racial bonus on Disguise checks to appear human. This racial trait replaces energy resistance."},
{"race": "Undine","trait": "Hydrated Vitality","replacement": "water affinity","text": "An undine with this racial trait gains fast healing 2 for 1 round anytime she submerges completely within a body of natural salt water, fresh water, or brackish water. Stagnant, poisoned, or trapped water (such as an artificial pit or a bag of holding) does not activate this ability. The undine can heal up to 2 hit points per level per day with this ability, after which it ceases to function. This racial trait replaces water affinity."},
{"race": "Undine","trait": "Nereid Fascination","replacement": "spell-like ability","text": "Some undines can trace their ancestry to nereids as well as to outsiders. Once per day as a standard action, such an undine can create a 20-foot-radius aura that causes humanoids within the aura's range to become fascinated with her for a number of rounds equal to 1/2 the undine's character level (minimum 1). Targets may resist with a Will save (DC 10 + 1/2 the undine's level + the undine's Charisma modifier). This is a supernatural ability. This racial trait replaces the spell-like ability racial trait."},
{"race": "Undine","trait": "Ooze Breath","replacement": "spell-like ability","text": "Some undines' outsider heritage can be traced to ooze mephits. These undines have a breath weapon that is a 5-foot cone of slime usable once per day. The slime deals 1d4 points of acid damage per two character levels (maximum 5d4) and sickens creatures in the area for 3 rounds. A successful Reflex saving throw (DC 10 + 1/2 the undine's level + the undine's Constitution modifier) halves the damage and negates the sickened effect. This racial trait replaces the spell-like ability racial trait."},
{"race": "Undine","trait": "Terrain Chameleon","replacement": "energy resistance","text": "Some undines can change their coloration to blend in with underwater terrain, mixing browns, grays, and greens to resemble kelp or other natural water plants. As a standard action, an undine with this racial trait can change her coloration, gaining a +4 bonus on Stealth checks in underwater environments. She can return to normal as a free action. This racial trait replaces energy resistance."},
{"race": "Undine","trait": "Water Sense","replacement": "energy resistance","text": "Undines with this racial trait can sense vibrations in water, granting them blindsense 30 feet against creatures in contact with the same body of water. This racial trait replaces energy resistance."},
{"race": "Changeling","trait": "Mist Child","replacement": "hulking changeling","text": "When the changeling has concealment or total concealment, the miss chance of attacks against her increases by 5%. This racial trait replaces hulking changeling."},
{"race": "Changeling","trait": "Object of Desire","replacement": "green widow","text": "The changeling adds +1 to her caster level when casting charm person and charm monster. This replaces green widow."},
{"race": "Changeling","trait": "Ocean's Daughter","replacement": "sea lungs","text": "The changeling gains a +1 trait bonus on Swim checks. She automatically succeeds at Swim checks made to avoid nonlethal damage from swimming. This racial trait replaces sea lungs."},
{"race": "Duergar","trait": "Blood Enmity","replacement": "invisibility spell-like ability","text": "Duergar have long warred against their dwarven cousins and the hated drow. Duergar with this racial trait receive a +1 racial bonus on attack rolls against humanoid creatures of the dwarf or elf subtypes. This racial trait replaces the invisibility spell-like ability."},
{"race": "Duergar","trait": "Daysighted","replacement": "SPECIAL","text": "The cruel light of the sun harms some duergar less than others. Such duergar lack the light sensitivity racial trait, but have darkvision of only 60 feet."},
{"race": "Duergar","trait": "Deep Magic","replacement": "spell-like abilities","text": "Duergar spellcasters labor long to overcome the inborn spell resistance held by so many of their underground foes. Duergar with this racial trait receive a +2 racial bonus on caster level checks made to overcome spell resistance and a +2 racial bonus on dispel checks. This racial trait replaces the enlarge person and invisibility spell-like abilities."},
{"race": "Duergar","trait": "Dwarf Traits","replacement": "SPECIAL","text": "Duergar can select any dwarf racial trait that replaces stability. They can select dwarf racial traits that replace the hardy dwarf racial trait by giving up duergar immunities instead."},
{"race": "Gillman","trait": "Riverfolk","replacement": "water dependent","text": "Some gillmen groups live in colonies along vast riverways, and have adapted to living on land for much longer periods. Gillmen with this trait have a thin coating of natural oil that keeps their skin from cracking even without water. However, this natural oil also makes such gillmen particularly susceptible to flames, and they gain vulnerability to fire. This racial trait replaces water dependent."},
{"race": "Gillman","trait": "Slimehunter","replacement": "enchantment resistance","text": "Gillmen with this trait are from lineages that have fought against aboleths since the aberrations rescued their human ancestors. They receive a +2 racial bonus on saving throws against aboleth spells, spell-like abilities, and supernatural abilities. This racial trait replaces enchantment resistance."},
{"race": "Gillman","trait": "Throwback","replacement": "SPECIAL","text": "Some gillmen are throwbacks to their land-dwelling human ancestors. Gillmen with this racial trait do not have the amphibious trait, have the human subtype instead of the aquatic subtype, have no swim speed or bonuses to the Swim skill, cannot breathe water, and do not have the water dependent racial trait."},
{"race": "Grippli","trait": "Glider","replacement": "swamp stride","text": "Gripplis' aerodynamic bodies and thick webbing between the toes enable a falling grippli to treat the distance fallen as half the actual distance. The grippli can steer himself while falling, moving horizontally up to a number of feet equal to half the vertical distance fallen. The grippli cannot use this trait if it is wearing heavy armor, is carrying a heavy load, or is unable to react to the fall (such as being helpless). This racial trait replaces swamp stride."},
{"race": "Grippli","trait": "Jumper","replacement": "camouflage","text": "Gripplis with this trait are always considered to have a running start when making Acrobatics checks to jump. This racial trait replaces camouflage."},
{"race": "Grippli","trait": "Princely","replacement": "swamp stride, weapon familiarity","text": "The grippli gains proficiency with rapiers and a +2 racial bonus on Diplomacy and Intimidate checks. This racial trait replaces swamp stride and weapon familiarity."},
{"race": "Grippli","trait": "Toxic Skin (Ex)","replacement": "swamp stride, camouflage","text": "Once per day as a swift action, a grippli can create a poison that can be applied to a weapon or delivered as a touch attack. Alternatively, the grippli can smear the poison on its own body as a standard action, affecting the first creature to hit it with an unarmed strike or natural weapon. The poison loses its potency after 1 hour. The grippli is immune to its own poison. This racial trait replaces swamp stride and camouflage.\\nGrippli Poison Skin or weapon—contact or injury; save Fort DC 10 + 1/2 the grippli's Hit Dice plus its Constitution modifier; frequency 1/round for 6 rounds; effect 1d2 Dexterity damage; cure 1 save."},
{"race": "Kitsune","trait": "Fast Shifter (Su)","replacement": "kitsune magic","text": "You were born with an innate talent for switching between your natural forms. Using your racial change shape ability is a move action instead of a standard action. This racial trait replaces kitsune magic."},
{"race": "Kitsune","trait": "Gregarious (Ex)","replacement": "agile","text": "Even among your own kind, your gift for making friends stands out. Whenever you successfully use Diplomacy to win over an individual, that creature takes a –2 penalty to resist any of your Charisma-based skill checks for the next 24 hours. This racial trait replaces agile."},
{"race": "Merfolk","trait": "Darkvision","replacement": "low-light vision","text": "Some merfolk favor the lightless depths over shallower waters. Merfolk with this racial trait gain darkvision with a range of 60 feet and light sensitivity. This racial trait replaces low-light vision."},
{"race": "Merfolk","trait": "Seasinger","replacement": "low-light vision","text": "The beautiful voices of the merfolk are legendary. A seasinger gains a +2 racial bonus on Perform (sing) checks and a +1 racial bonus to the save DC of language-dependent spells. This racial trait replaces low-light vision."},
{"race": "Merfolk","trait": "Strongtail","replacement": "SPECIAL","text": "A few merfolk have broad, strong tails that are more suited for land travel than the typical merfolk tail. Merfolk with this racial trait have a land speed of 15 feet and a swim speed of 30 feet."},
{"race": "Nagaji","trait": "Hypnotic Gaze (Sp)","replacement": "serpent's sense","text": "The nagaji's gaze is so intense it stops others in their tracks. Once per day, it can attempt to hypnotize a single target, as per the spell hypnotism (caster level equal to the nagaji's Hit Dice). The DC of this effect is equal to 11 + the nagaji's Charisma modifier. The effects of the hypnotic gaze only last a single round. This racial trait replaces serpent's sense."},
{"race": "Samsaran","trait": "Mystic Past Life (Su)","replacement": "shards of past","text": "You can add spells from another spellcasting class to the spell list of your current spellcasting class. You add a number of spells equal to 1 + your spellcasting class's key ability score bonus (Wisdom for clerics, and so on). The spells must be the same type (arcane or divine) as the spellcasting class you're adding them to. For example, you could add divine power to your druid class spell list, but not to your wizard class spell list because divine power is a divine spell. These spells do not have to be spells you can cast as a 1st-level character. The number of spells granted by this ability is set at 1st level. Changes to your ability score do not change the number of spells gained. This racial trait replaces shards of the past."},
{"race": "Strix","trait": "Dayguard","replacement": "nocturnal","text": "Familiar with watching over its tribe during the day, the strix gains a +2 racial bonus on Perception checks and treats Perception as a class skill. This racial trait replaces nocturnal."},
{"race": "Strix","trait": "Frightening","replacement": "nocturnal","text": "The strix looks particularly menacing and use this to its advantage, gaining a +2 racial bonus on Intimidate checks. This racial trait replaces nocturnal."},
{"race": "Strix","trait": "Nimble","replacement": "suspicious","text": "The strix receives a +1 racial bonus on Reflex saves. This replaces the suspicious racial trait."},
{"race": "Strix","trait": "Tough","replacement": "suspicious","text": "The strix receives a +1 racial bonus on Fortitude saves. This racial trait replaces suspicious."},
{"race": "Strix","trait": "Wing-Clipped","replacement": "SPECIAL","text": "The flight of wing-clipped strix is weaker than normal, whether from deformity or injury. Their fly speed is 20 feet (poor) instead of the normal fly speed, and they must make a DC 30 Fly check to fly upward. Ostracized by their tribes and forced to deal with other races, these strix compensate for their weakness by gaining a +2 racial bonus on Bluff, Climb, and Diplomacy checks."},
{"race": "Suli","trait": "Energy Strike (Su)","replacement": "elemental assault","text": "A suli with this racial trait has a stronger connection to one energy type than to the other three used by sulis. Choose one energy type: acid, cold, electricity, or fire. The suli's elemental assault ability can only deal energy damage of this type. The suli has resistance 5 to this energy type and no racial resistance to the other three types. While her elemental assault is active, the suli gains an additional ability based on the chosen energy type.\\n\\nEarthfoot (acid): Whenever the suli moves through difficult terrain related to earth and stone (rubble, mud, sand, and so on), she may move through 5 feet of that difficult terrain each round as if it were normal terrain. This allows the suli to take a 5-foot step into that difficult terrain. Other kinds of difficult terrain (ice, caltrops, foliage, and so on) affect the suli normally.\\n\\nFirehand (fire): Instead of adding damage to a melee attack, the suli may hurl a piece of her arm-flames as if it were a thrown weapon. The suli makes a ranged touch attack; if the attack hits, the target takes 1d6 points of fire damage. The flames have a range increment of 10 feet.\\n\\nIcewalk (cold): The suli can walk on water-based liquids as if using water walk, except instead of hovering above the surface, she creates a temporary layer of ice that supports her and immediately melts once she moves away from it. This ice is not slippery to the suli and does not affect her balance or speed, though other ice affects her normally. Other creatures cannot travel on this ice, but the suli may carry a creature while moving.\\n\\nShockshield (electricity): Once per round as an immediate action, the suli can shock a creature that touches or attacks her with a natural attack, unarmed strike, or metal melee weapon, dealing 1d6 points of electricity damage to the creature.\\n\\nThis racial trait otherwise works like and replaces elemental assault."},
{"race": "Svirfneblin","trait": "Healthy","replacement": "fortunate","text": "Svirfneblin gain a +4 bonus on Fortitude saves against disease and poison, including magical diseases. This racial trait replaces fortunate."},
{"race": "Svirfneblin","trait": "Stoneseer","replacement": "svirfneblin magic","text": "Svirfneblin add +1 to the caster level of any spells with the earth descriptor they cast. Svirfneblin also gain the following spell-like abilities: Constant—nondetection; 1/day—magic stone, stone shape, stone tell; caster level equals the svirfneblin's class levels. This racial trait replaces svirfneblin magic."},
{"race": "Vanara","trait": "Tree Stranger","replacement": "SPECIAL","text": "Some vanaras have spent their lives among humans in centers of learning instead of traditional treetop homes. These vanaras treat all Knowledge skills as class skills, but lose their climb speed racial trait."},
{"race": "Vanara","trait": "Whitecape","replacement": "prehensile tail","text": "The rare whitecape vanara clans have more in common with savanna-dwelling baboons than the jungle-dwelling monkeys that most vanaras resemble. Their stooping build grants them a +4 racial bonus to CMD when resisting a bull rush or trip. These vanaras usually have a thick mane of hair on the head and shoulders (called a \"cape\") and shorter tails. This racial trait replaces prehensile tail."},
{"race": "Vishkanya","trait": "Sensual","replacement": "keen senses","text": "You are trained in drawing attention to yourself. You gain a +2 bonus on any one Perform skill. This racial trait replaces keen senses."},
{"race": "Vishkanya","trait": "Subtle Appearance","replacement": "low-light vision","text": "You have normal (humanlike) eyes, and your beauty is more conventional. You gain a +4 bonus on Disguise checks to look fully human. This racial trait replaces low-light vision."},
{"race": "Wayang","trait": "Dissolution's Child","replacement": "shadow magic","text": "Once per day, you may change your appearance to look as if you were little more than a 4-foot-tall area of shadow. Your physical form still exists and you are not incorporeal—only your appearance changes. This works like invisibility, except it only lasts 1 round per level (maximum 5 rounds). This is a supernatural ability. This racial trait replaces shadow magic."}
