{"race": "Dwarf","trait": "Medium","text": "Dwarves are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Dwarf","trait": "Slow and Steady","text": "Dwarves have a base speed of 20 feet, but their speed is never modified by armor or encumbrance."},
{"race": "Dwarf","trait": "Darkvision","text": "Dwarves can see in the dark up to 60 feet."},
{"race": "Dwarf","trait": "Defensive Training","text": "Dwarves gain a +4 dodge bonus to AC against monsters of the giant subtype."},
{"race": "Dwarf","trait": "Greed","text": "Dwarves gain a +2 racial bonus on Appraise checks made to determine the price of nonmagical goods that contain precious metals or gemstones."},
{"race": "Dwarf","trait": "Hatred","text": "Dwarves gain a +1 racial bonus on attack rolls against humanoid creatures of the orc and goblinoid subtypes because of their special training against these hated foes."},
{"race": "Dwarf","trait": "Hardy","text": "Dwarves gain a +2 racial bonus on saving throws against poison, spells, and spell-like abilities."},
{"race": "Dwarf","trait": "Stability","text": "Dwarves gain a +4 racial bonus to their Combat Maneuver Defense when resisting a bull rush or trip attempt while standing on the ground."},
{"race": "Dwarf","trait": "Stonecunning","text": "Dwarves gain a +2 bonus on Perception checks to notice unusual stonework, such as traps and hidden doors located in stone walls or floors. They receive a check to notice such features whenever they pass within 10 feet of them, whether or not they are actively looking."},
{"race": "Dwarf","trait": "Weapon Familiarity","text": "Dwarves are proficient with battleaxes, heavy picks, and warhammers, and treat any weapon with the word \"dwarven\" in its name as a martial weapon."},
{"race": "Dwarf","trait": "Languages","text": "Dwarves begin play speaking Common and Dwarven. Dwarves with high Intelligence scores can choose from the following: Giant, Gnome, Goblin, Orc, Terran, and Undercommon."},
{"race": "Elf","trait": "Medium","text": "Elves are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Elf","trait": "Normal Speed","text": "Elves have a base speed of 30 feet."},
{"race": "Elf","trait": "Low-Light Vision","text": "Elves can see twice as far as humans in conditions of dim light."},
{"race": "Elf","trait": "Elven Immunities","text": "Elves are immune to magic sleep effects and gain a +2 racial saving throw bonus against enchantment spells and effects."},
{"race": "Elf","trait": "Elven Magic","text": "Elves receive a +2 racial bonus on caster level checks made to overcome spell resistance. In addition, elves receive a +2 racial bonus on Spellcraft skill checks made to identify the properties of magic items."},
{"race": "Elf","trait": "Keen Senses","text": "Elves receive a +2 racial bonus on Perception checks."},
{"race": "Elf","trait": "Weapon Familiarity","text": "Elves are proficient with longbows (including composite longbows), longswords, rapiers, and shortbows (including composite shortbows), and treat any weapon with the word \"elven\" in its name as a martial weapon."},
{"race": "Elf","trait": "Languages","text": "Elves begin play speaking Common and Elven. Elves with high Intelligence scores can choose from the following: Celestial, Draconic, Gnoll, Gnome, Goblin, Orc, and Sylvan."},
{"race": "Gnome","trait": "Small","text": "Gnomes are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty to their Combat Maneuver Bonus and Combat Maneuver Defense, and a +4 size bonus on Stealth checks."},
{"race": "Gnome","trait": "Slow Speed","text": "Gnomes have a base speed of 20 feet."},
{"race": "Gnome","trait": "Low-Light Vision","text": "Gnomes can see twice as far as humans in conditions of dim light."},
{"race": "Gnome","trait": "Defensive Training","text": "Gnomes gain a +4 dodge bonus to AC against monsters of the giant subtype."},
{"race": "Gnome","trait": "Gnome Magic","text": "Gnomes add +1 to the DC of any saving throws against illusion spells that they cast. Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—dancing lights, ghost sound, prestidigitation, and speak with animals. The caster level for these effects is equal to the gnome's level. The DC for these spells is equal to 10 + the spell's level + the gnome's Charisma modifier."},
{"race": "Gnome","trait": "Hatred","text": "Gnomes receive a +1 bonus on attack rolls against humanoid creatures of the reptilian and goblinoid subtypes because of their special training against these hated foes."},
{"race": "Gnome","trait": "Illusion Resistance","text": "Gnomes gain a +2 racial saving throw bonus against illusion spells and effects."},
{"race": "Gnome","trait": "Keen Senses","text": "Gnomes receive a +2 racial bonus on Perception checks."},
{"race": "Gnome","trait": "Obsessive","text": "Gnomes receive a +2 racial bonus on a Craft or Profession skill of their choice."},
{"race": "Gnome","trait": "Weapon Familiarity","text": "Gnomes treat any weapon with the word \"gnome\" in its name as a martial weapon."},
{"race": "Gnome","trait": "Languages","text": "Gnomes begin play speaking Common, Gnome, and Sylvan. Gnomes with high Intelligence scores can choose from the following: Draconic, Dwarven, Elven, Giant, Goblin, and Orc."},
{"race": "Half-elf","trait": "Medium","text": "Half-elves are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Half-elf","trait": "Normal Speed","text": "Half-elves have a base speed of 30 feet."},
{"race": "Half-elf","trait": "Low-Light Vision","text": "Half-elves can see twice as far as humans in conditions of dim light."},
{"race": "Half-elf","trait": "Adaptability","text": "Half-elves receive Skill Focus as a bonus feat at 1st level."},
{"race": "Half-elf","trait": "Elf Blood","text": "Half-elves count as both elves and humans for any effect related to race."},
{"race": "Half-elf","trait": "Elven Immunities","text": "Half-elves are immune to magic sleep effects and gain a +2 racial saving throw bonus against enchantment spells and effects."},
{"race": "Half-elf","trait": "Keen Senses","text": "Half-elves receive a +2 racial bonus on Perception checks."},
{"race": "Half-elf","trait": "Multitalented","text": "Half-elves choose two favored classes at first level and gain +1 hit point or +1 skill point whenever they take a level in either one of those classes."},
{"race": "Half-elf","trait": "Languages","text": "Half-elves begin play speaking Common and Elven. Half-elves with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic)."},
{"race": "Half-orc","trait": "Medium","text": "Half-orcs are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Half-orc","trait": "Normal Speed","text": "Half-orcs have a base speed of 30 feet."},
{"race": "Half-orc","trait": "Darkvision","text": "Half-orcs can see in the dark up to 60 feet."},
{"race": "Half-orc","trait": "Intimidating","text": "Half-orcs receive a +2 racial bonus on Intimidate checks due to their fearsome nature."},
{"race": "Half-orc","trait": "Orc Blood","text": "Half-orcs count as both humans and orcs for any effect related to race."},
{"race": "Half-orc","trait": "Orc Ferocity","text": "Once per day, when a half-orc is brought below 0 hit points but not killed, he can fight on for 1 more round as if disabled. At the end of his next turn, unless brought to above 0 hit points, he immediately falls unconscious and begins dying."},
{"race": "Half-orc","trait": "Weapon Familiarity","text": "Half-orcs are proficient with greataxes and falchions and treat any weapon with the word \"orc\" in its name as a martial weapon."},
{"race": "Half-orc","trait": "Languages","text": "Half-orcs begin play speaking Common and Orc. Half-orcs with high Intelligence scores can choose from the following: Abyssal, Draconic, Giant, Gnoll, and Goblin."},
{"race": "Halfling","trait": "Small","text": "Halflings are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty to their CMB and CMD, and a +4 size bonus on Stealth checks."},
{"race": "Halfling","trait": "Slow Speed","text": "Halflings have a base speed of 20 feet."},
{"race": "Halfling","trait": "Fearless","text": "Halflings receive a +2 racial bonus on all saving throws against fear. This bonus stacks with the bonus granted by halfling luck."},
{"race": "Halfling","trait": "Halfling Luck","text": "Halflings receive a +1 racial bonus on all saving throws."},
{"race": "Halfling","trait": "Keen Senses","text": "Halflings receive a +2 racial bonus on Perception checks."},
{"race": "Halfling","trait": "Sure-Footed","text": "Halflings receive a +2 racial bonus on Acrobatics and Climb checks."},
{"race": "Halfling","trait": "Weapon Familiarity","text": "Halflings are proficient with slings and treat any weapon with the word \"halfling\" in its name as a martial weapon."},
{"race": "Halfling","trait": "Languages","text": "Halflings begin play speaking Common and Halfling. Halflings with high Intelligence scores can choose from the following: Dwarven, Elven, Gnome, and Goblin."},
{"race": "Human","trait": "Medium","text": "Humans are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Human","trait": "Normal Speed","text": "Humans have a base speed of 30 feet."},
{"race": "Human","trait": "Bonus Feat","text": "Humans select one extra feat at 1st level."},
{"race": "Human","trait": "Skilled","text": "Humans gain an additional skill rank at first level and one additional rank whenever they gain a level."},
{"race": "Human","trait": "Languages","text": "Humans begin play speaking Common. Humans with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic)."},
{"race": "Aasimar","trait": "Native Outsider","text": "Aasimars are outsiders with the native subtype."},
{"race": "Aasimar","trait": "Medium","text": "Aasimars are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Aasimar","trait": "Normal Speed","text": "Aasimars have a base speed of 30 feet."},
{"race": "Aasimar","trait": "Darkvision","text": "Aasimars can see in the dark up to 60 feet."},
{"race": "Aasimar","trait": "Skilled","text": "Aasimars have a +2 racial bonus on Diplomacy and Perception checks."},
{"race": "Aasimar","trait": "Spell-Like Ability","text": "Aasimars can use daylight once per day as a spell-like ability (caster level equal to the aasimar's class level)."},
{"race": "Aasimar","trait": "Celestial Resistance","text": "Aasimars have acid resistance 5, cold resistance 5, and electricity resistance 5."},
{"race": "Aasimar","trait": "Languages","text": "Aasimars begin play speaking Common and Celestial. Aasimars with high Intelligence scores can choose from the following languages: Draconic, Dwarven, Elven, Gnome, Halfling, and Sylvan."},
{"race": "Catfolk","trait": "Catfolk","text": "Catfolk are humanoids with the catfolk subtype."},
{"race": "Catfolk","trait": "Medium","text": "Catfolk are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Catfolk","trait": "Normal Speed","text": "Catfolk have a base speed of 30 feet."},
{"race": "Catfolk","trait": "Low-Light Vision","text": "In dim light, catfolk can see twice as far as humans."},
{"race": "Catfolk","trait": "Cat's Luck (Ex)","text": "Once per day when a catfolk makes a Reflex saving throw, he can roll the saving throw twice and take the better result. He must decide to use this ability before the saving throw is attempted."},
{"race": "Catfolk","trait": "Natural Hunter","text": "Catfolk receive a +2 racial bonus on Perception, Stealth, and Survival checks."},
{"race": "Catfolk","trait": "Sprinter","text": "Catfolk gain a 10-foot racial bonus to their speed when using the charge, run, or withdraw actions."},
{"race": "Catfolk","trait": "Languages","text": "Catfolk begin play speaking Common and Catfolk. Catfolk with high Intelligence scores can choose from the following languages: Elven, Gnoll, Gnome, Goblin, Halfling, Orc, and Sylvan."},
{"race": "Dhampir","trait": "Dhampir","text": "Dhampirs are humanoids with the dhampir subtype."},
{"race": "Dhampir","trait": "Medium","text": "Dhampirs are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Dhampir","trait": "Normal Speed","text": "Dhampirs have a base speed of 30 feet."},
{"race": "Dhampir","trait": "Senses","text": "Low-light vision and darkvision 60 feet."},
{"race": "Dhampir","trait": "Manipulative","text": "+2 racial bonus on Bluff and Perception."},
{"race": "Dhampir","trait": "Undead Resistance","text": "Dhampirs gain a +2 racial bonus on saving throws against disease and mind-affecting effects."},
{"race": "Dhampir","trait": "Light Sensitivity","text": "Dhampirs are dazzled in areas of bright sunlight or within the radius of a daylight spell."},
{"race": "Dhampir","trait": "Negative Energy Affinity","text": "Though a living creature, a dhampir reacts to positive and negative energy as if it were undead—positive energy harms it, while negative energy heals it."},
{"race": "Dhampir","trait": "Spell-Like Ability","text": "A dhampir can use detect undead three times per day as a spell-like ability. The caster level for this ability equals the dhampir's class level."},
{"race": "Dhampir","trait": "Resist Level Drain (Ex)","text": "A dhampir takes no penalties from energy drain effects, though he can still be killed if he accrues more negative levels then he has Hit Dice. After 24 hours, any negative levels a dhampir takes are removed without the need for an additional saving throw."},
{"race": "Dhampir","trait": "Languages","text": "Dhampirs begin play speaking Common. Those with high Intelligence scores can choose any language it wants (except secret languages, such as Druidic)."},
{"race": "Drow","trait": "Elf","text": "Drow are humanoids with the elf subtype."},
{"race": "Drow","trait": "Medium","text": "Drow are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Drow","trait": "Normal Speed","text": "Drow have a base speed of 30 feet."},
{"race": "Drow","trait": "Darkvision","text": "Drow can see in the dark up to 120 feet."},
{"race": "Drow","trait": "Drow Immunities","text": "Drow are immune to magic sleep effects and gain a +2 racial bonus on saving throws against enchantment spells and effects."},
{"race": "Drow","trait": "Keen Senses","text": "Drow gain a +2 racial bonus on Perception checks."},
{"race": "Drow","trait": "Poison Use","text": "Drow are skilled in the use of poison and never risk accidentally poisoning themselves."},
{"race": "Drow","trait": "Spell Resistance","text": "Drow possess spell resistance equal to 6 plus their class levels."},
{"race": "Drow","trait": "Spell-Like Abilities","text": "A drow can cast dancing lights, darkness, and faerie fire, once each per day, using her total character level as her caster level."},
{"race": "Drow","trait": "Light Blindness","text": "Abrupt exposure to bright light blinds drow for 1 round; on subsequent rounds, they are dazzled as long as they remain in the affected area."},
{"race": "Drow","trait": "Weapon Familiarity","text": "Drow are proficient with the hand crossbow, rapier, and short sword."},
{"race": "Drow","trait": "Languages","text": "Drow begin play speaking Elven and Undercommon. Drow with high Intelligence scores can choose from the following languages: Abyssal, Aklo, Aquan, Common, Draconic, Drow Sign Language, Gnome, or Goblin."},
{"race": "Fetchling","trait": "Native Outsider","text": "Fetchlings are outsiders with the native subtype."},
{"race": "Fetchling","trait": "Medium","text": "Fetchlings are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Fetchling","trait": "Normal Speed","text": "Fetchlings have a base speed of 30 feet."},
{"race": "Fetchling","trait": "Darkvision","text": "Fetchlings can see in the dark up to 60 feet."},
{"race": "Fetchling","trait": "Low-Light Vision","text": "Fetchlings can see twice as far as humans in conditions of dim light."},
{"race": "Fetchling","trait": "Skilled","text": "Fetchlings have a +2 racial bonus on Knowledge (planes) and Stealth checks."},
{"race": "Fetchling","trait": "Shadow Blending (Su)","text": "Attacks against a fetchling in dim light have a 50% miss chance instead of the normal 20% miss chance. This ability does not grant total concealment; it just increases the miss chance."},
{"race": "Fetchling","trait": "Shadowy Resistance","text": "Fetchlings have cold resistance 5 and electricity resistance 5."},
{"race": "Fetchling","trait": "Spell-Like Abilities (Sp)","text": "A fetchling can use disguise self once per day as a spell-like ability. He can assume the form of any humanoid creature using this spell-like ability. When a fetchling reaches 9th level in any combination of classes, he gains shadow walk (self only) as a spell-like ability usable once per day, and at 13th level, he gains plane shift (self only, to the Shadow Plane or the Material Plane only) usable once per day. A fetchling's caster level is equal to his total Hit Dice."},
{"race": "Fetchling","trait": "Languages","text": "Fetchlings begin play speaking Common. Fetchlings with a high Intelligence scores can choose from the following: Aklo, Aquan, Auran, Draconic, D'ziriak (understanding only, cannot speak), Ignan, Terran, and any regional human tongue."},
{"race": "Goblin","trait": "Goblinoid","text": "Goblins are humanoids with the goblinoid subtype."},
{"race": "Goblin","trait": "Small","text": "Goblins are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty to their CMB and CMD, and a +4 size bonus on Stealth checks."},
{"race": "Goblin","trait": "Fast","text": "Goblins are fast for their size, and have a base speed of 30 feet."},
{"race": "Goblin","trait": "Darkvision","text": "Goblins can see in the dark up to 60 feet."},
{"race": "Goblin","trait": "Skilled","text": "+4 racial bonus on Ride and Stealth checks."},
{"race": "Goblin","trait": "Languages","text": "Goblins begin play speaking Goblin. Goblins with high Intelligence scores can choose from the following: Common, Draconic, Dwarven, Gnoll, Gnome, Halfling, and Orc."},
{"race": "Hobgoblin","trait": "Goblinoid","text": "Hobgoblins are humanoids with the goblinoid subtype."},
{"race": "Hobgoblin","trait": "Medium","text": "Hobgoblins are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Hobgoblin","trait": "Normal Speed","text": "Hobgoblins have a base speed of 30 feet."},
{"race": "Hobgoblin","trait": "Darkvision","text": "Hobgoblins can see in the dark up to 60 feet."},
{"race": "Hobgoblin","trait": "Sneaky","text": "Hobgoblins receive a +4 racial bonus on Stealth checks."},
{"race": "Hobgoblin","trait": "Languages","text": "Hobgoblins begin play speaking Common and Goblin. Hobgoblins with high Intelligence scores can choose from the following: Draconic, Dwarven, Infernal, Giant, and Orc."},
{"race": "Ifrit","trait": "Native Outsider","text": "Ifrits are outsiders with the native subtype."},
{"race": "Ifrit","trait": "Medium","text": "Ifrits are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Ifrit","trait": "Normal Speed","text": "Ifrits have a base speed of 30 feet."},
{"race": "Ifrit","trait": "Darkvision","text": "Ifrits can see in the dark up to 60 feet."},
{"race": "Ifrit","trait": "Spell-Like Ability","text": "Burning hands 1/day (caster level equals the ifrit's level; DC 11 + Charisma modifier)."},
{"race": "Ifrit","trait": "Energy Resistance","text": "Ifrits have fire resistance 5."},
{"race": "Ifrit","trait": "Fire Affinity","text": "Ifrit sorcerers with the elemental (fire) bloodline treat their Charisma score as 2 points higher for all sorcerer spells and class abilities. Ifrit spellcasters with the Fire domain use their domain powers and spells at +1 caster level."},
{"race": "Ifrit","trait": "Languages","text": "Ifrits begin play speaking Common and Ignan. Ifrits with high Intelligence scores can choose from the following: Aquan, Auran, Dwarven, Elven, Gnome, Halfling, and Terran."},
{"race": "Kobold","trait": "Reptilian","text": "Kobolds are humanoids with the reptilian subtype."},
{"race": "Kobold","trait": "Small","text": "Kobolds are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on their combat maneuver checks and to Combat Maneuver Defense, and a +4 size bonus on Stealth checks."},
{"race": "Kobold","trait": "Normal Speed","text": "Kobolds have a base speed of 30 feet."},
{"race": "Kobold","trait": "Darkvision","text": "Kobolds can see in the dark up to 60 feet."},
{"race": "Kobold","trait": "Armor","text": "Kobolds have a +1 natural armor bonus."},
{"race": "Kobold","trait": "Crafty","text": "Kobolds gain a +2 racial bonus on Craft (trapmaking), Perception, and Profession (miner) checks. Craft (traps) and Stealth are always class skills for a kobold."},
{"race": "Kobold","trait": "Weakness","text": "Light sensitivity."},
{"race": "Kobold","trait": "Languages","text": "Kobolds begin play speaking only Draconic. Kobolds with high Intelligence scores can choose from the following: Common, Dwarven, Gnome, and Undercommon."},
{"race": "Orc","trait": "Orc","text": "Orcs are humanoids with the orc subtype."},
{"race": "Orc","trait": "Medium","text": "Orcs are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Orc","trait": "Normal Speed","text": "Orcs have a base speed of 30 feet."},
{"race": "Orc","trait": "Darkvision","text": "Orcs can see in the dark up to 60 feet."},
{"race": "Orc","trait": "Light Sensitivity","text": "Orcs are dazzled in areas of bright sunlight or within the radius of a daylight spell."},
{"race": "Orc","trait": "Ferocity","text": "Orcs can remain conscious and continue fighting even if their hit point totals fall below 0. Orcs are still staggered at 0 hit points or lower and lose 1 hit point each round as normal."},
{"race": "Orc","trait": "Weapon Familiarity","text": "Orcs are always proficient with greataxes and falchions, and treat any weapon with the word \"orc\" in its name as a martial weapon."},
{"race": "Orc","trait": "Languages","text": "Orcs begin play speaking Common and Orc. Orcs with high Intelligence scores can chose from the following: Dwarven, Giant, Gnoll, Goblin, Undercommon."},
{"race": "Oread","trait": "Native Outsider","text": "Oreads are outsiders with the native subtype."},
{"race": "Oread","trait": "Medium","text": "Oreads are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Oread","trait": "Slow Speed","text": "Oreads have a base speed of 20 feet."},
{"race": "Oread","trait": "Darkvision","text": "Oreads can see in the dark up to 60 feet."},
{"race": "Oread","trait": "Spell-Like Ability","text": "Magic stone 1/day (caster level equals the oread's total level; DC 11 + Charisma modifier)."},
{"race": "Oread","trait": "Energy Resistance","text": "Oreads have acid resistance 5."},
{"race": "Oread","trait": "Earth Affinity","text": "Oread sorcerers with the elemental (earth) bloodline treat their Charisma score as 2 points higher for all sorcerer spells and class abilities. Oread clerics with the Earth domain use their domain powers and spells at +1 caster level."},
{"race": "Oread","trait": "Languages","text": "Oreads begin play speaking Common and Terran. Oreads with high Intelligence scores can choose from the following: Aquan, Auran, Dwarven, Elven, Gnome, Halfling, Ignan, and Undercommon."},
{"race": "Ratfolk","trait": "Ratfolk","text": "Ratfolk are humanoids with the ratfolk subtype."},
{"race": "Ratfolk","trait": "Small","text": "Ratfolk are Small and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their CMD, and a +4 size bonus on Stealth checks."},
{"race": "Ratfolk","trait": "Slow Speed","text": "Ratfolk have a base speed of 20 feet."},
{"race": "Ratfolk","trait": "Darkvision","text": "Ratfolk can see in the dark up to 60 feet."},
{"race": "Ratfolk","trait": "Rodent Empathy","text": "Ratfolk gain a +4 racial bonus on Handle Animal checks made to influence rodents."},
{"race": "Ratfolk","trait": "Swarming","text": "Ratfolk are used to living and fighting communally, and are adept at swarming foes for their own gain and their foes' detriment. Up to two ratfolk can share the same square at the same time. If two ratfolk in the same square attack the same foe, they are considered to be flanking that foe as if they were in two opposite squares."},
{"race": "Ratfolk","trait": "Tinker","text": "Ratfolk gain a +2 racial bonus on Craft (alchemy), Perception, and Use Magic Device checks."},
{"race": "Ratfolk","trait": "Languages","text": "Ratfolk begin play speaking Common. Ratfolk with high Intelligence scores can choose from the following: Aklo, Draconic, Dwarven, Gnoll, Gnome, Goblin, Halfling, Orc, and Undercommon."},
{"race": "Sylph","trait": "Native Outsider","text": "Sylphs are outsiders with the native subtype."},
{"race": "Sylph","trait": "Medium","text": "Sylphs are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Sylph","trait": "Normal Speed","text": "Sylphs have a base speed of 30 feet."},
{"race": "Sylph","trait": "Darkvision","text": "Sylphs can see in the dark up to 60 feet."},
{"race": "Sylph","trait": "Spell-Like Ability","text": "Feather fall 1/day (caster level equals the sylph's total level)."},
{"race": "Sylph","trait": "Energy Resistance","text": "Sylphs have electricity resistance 5."},
{"race": "Sylph","trait": "Air Affinity","text": "Sylph sorcerers with the elemental (air) bloodline treat their Charisma score as 2 points higher for all sorcerer spells and class abilities. Sylph spellcasters with the Air domain use their domain powers and spells at +1 caster level."},
{"race": "Sylph","trait": "Languages","text": "Sylphs begin play speaking Common and Auran. Sylphs with high Intelligence scores can choose from the following: Aquan, Dwarven, Elven, Gnome, Halfling, Ignan, and Terran."},
{"race": "Tengu","trait": "Tengu","text": "Tengus are humanoids with the tengu subtype."},
{"race": "Tengu","trait": "Medium","text": "Tengus are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Tengu","trait": "Normal Speed","text": "Tengus have a base speed of 30 feet."},
{"race": "Tengu","trait": "Senses","text": "Tengus have low-light vision."},
{"race": "Tengu","trait": "Sneaky","text": "Tengus gain a +2 racial bonus on Perception and Stealth checks."},
{"race": "Tengu","trait": "Gifted Linguist","text": "Tengus gain a +4 racial bonus on Linguistics checks, and learn 2 languages each time they gain a rank in Linguistics rather than 1 language."},
{"race": "Tengu","trait": "Swordtrained","text": "Tengus are trained from birth in swordplay, and as a result are automatically proficient with swordlike weapons (including bastard swords, daggers, elven curve blades, falchions, greatswords, kukris, longswords, punching daggers, rapiers, scimitars, short swords, and two-bladed swords)."},
{"race": "Tengu","trait": "Natural Weapon","text": "A tengu has a bite attack that deals 1d3 points of damage."},
{"race": "Tengu","trait": "Languages","text": "Tengus begin play speaking Common and Tengu. Tengus with high Intelligence scores can choose any languages they want (except for secret languages, such as Druidic)."},
{"race": "Tiefling","trait": "Native Outsider","text": "Tieflings are outsiders with the native subtype."},
{"race": "Tiefling","trait": "Medium","text": "Tieflings are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Tiefling","trait": "Normal Speed","text": "Tieflings have a base speed of 30 feet."},
{"race": "Tiefling","trait": "Darkvision","text": "Tieflings see in the dark for up to 60 feet."},
{"race": "Tiefling","trait": "Skilled","text": "Tieflings gain a +2 racial bonus on Bluff and Stealth checks."},
{"race": "Tiefling","trait": "Spell-Like Ability","text": "Tieflings can use darkness once per day as a spell-like ability. The caster level for this ability equals the tiefling's class level."},
{"race": "Tiefling","trait": "Fiendish Resistance","text": "Tieflings have cold resistance 5, electricity resistance 5, and fire resistance 5."},
{"race": "Tiefling","trait": "Fiendish Sorcery","text": "Tiefling sorcerers with the Abyssal or Infernal bloodlines treat their Charisma score as 2 points higher for all sorcerer class abilities."},
{"race": "Tiefling","trait": "Languages","text": "Tieflings begin play speaking Common and either Abyssal or Infernal. Tieflings with high intelligence scores can choose from the following: Abyssal, Draconic, Dwarven, Elven, Gnome, Goblin, Halfling, Infernal, and Orc."},
{"race": "Undine","trait": "Native Outsider","text": "Undines are outsiders with the native subtype."},
{"race": "Undine","trait": "Medium","text": "Undines are Medium creatures and receive no bonuses or penalties due to their size."},
{"race": "Undine","trait": "Normal Speed","text": "Undines have a base speed of 30 feet on land. They also have a swim speed of 30 feet, can move in water without making Swim checks, and always treat Swim as a class skill."},
{"race": "Undine","trait": "Darkvision","text": "Undines can see in the dark up to 60 feet."},
{"race": "Undine","trait": "Spell-Like Ability","text": "Hydraulic push 1/day (caster level equals the undine's level)."},
{"race": "Undine","trait": "Energy Resistance","text": "Undines have cold resistance 5."},
{"race": "Undine","trait": "Water Affinity","text": "Undine sorcerers with the elemental (water) bloodline treat their Charisma score as 2 points higher for all sorcerer spells and class abilities. Undine clerics with the Water domain cast their Water domain powers and spells at +1 caster level."},
{"race": "Undine","trait": "Languages","text": "Undines begin play speaking Common and Aquan. Undines with high Intelligence scores can choose from the following: Auran, Dwarven, Elven, Gnome, Halfling, Ignan, and Terran."},
{"race": "Duergar","trait": "Medium","text": "Duergar are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Duergar","trait": "Dwarf","text": "Duergar are humanoids with the dwarf subtype."},
{"race": "Duergar","trait": "Slow and Steady","text": "Duergar have a base speed of 20 feet, but their speed is never modified by armor or encumbrance."},
{"race": "Duergar","trait": "Superior Darkvision","text": "Duergar can see in the dark up to 120 feet."},
{"race": "Duergar","trait": "Duergar Immunities","text": "Duergar are immune to paralysis, phantasms, and poison. They gain a +2 racial bonus on saves against spells and spell-like abilities."},
{"race": "Duergar","trait": "Stability","text": "Duergar receive a +4 racial bonus to their CMD against bull rush or trip attempts while on solid ground."},
{"race": "Duergar","trait": "Spell-Like Abilities","text": "A duergar can use enlarge person and invisibility once each per day, using its character level as its caster level and affecting itself only."},
{"race": "Duergar","trait": "Light Sensitivity","text": "Duergar are dazzled in areas of bright light."},
{"race": "Duergar","trait": "Languages","text": "Duergar begin play speaking Common, Dwarven, and Undercommon. Duergar with high Intelligence scores can choose from the following: Aklo, Draconic, Giant, Goblin, Orc, and Terran."},
{"race": "Gillman","trait": "Medium","text": "Gillmen are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Gillman","trait": "Aquatic","text": "Gillmen are humanoids with the aquatic subtype."},
{"race": "Gillman","trait": "Normal Speed","text": "Gillmen have a base speed of 30 feet on land. As aquatic creatures, they also have a swim speed of 30 feet, can move in water without making Swim checks, and always treat Swim as a class skill."},
{"race": "Gillman","trait": "Amphibious","text": "Gillmen have the aquatic subtype, but can breathe both water and air."},
{"race": "Gillman","trait": "Enchantment Resistance","text": "Gillmen gain a +2 racial saving throw bonus against non-aboleth enchantment spells and effects, but take a –2 penalty on such saving throws against aboleth sources."},
{"race": "Gillman","trait": "Water Dependent","text": "A gillman's body requires constant submersion in fresh or salt water. Gillmen who spend more than 1 day without fully submerging themselves in water risk internal organ failure, painful cracking of the skin, and death within 4d6 hours."},
{"race": "Gillman","trait": "Languages","text": "Gillmen begin play speaking Common and Aboleth. Gillmen with high Intelligence scores can choose from the following: Aklo, Aquan, Draconic, and Elven."},
{"race": "Grippli","trait": "Small","text": "Gripplis are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty to their CMB and CMD, and a +4 size bonus on Stealth checks."},
{"race": "Grippli","trait": "Grippli","text": "Gripplis are humanoids with the grippli subtype."},
{"race": "Grippli","trait": "Normal Speed","text": "Gripplis have a base speed of 30 feet and a climb speed of 20 feet."},
{"race": "Grippli","trait": "Darkvision","text": "Gripplis can see in the dark up to 60 feet."},
{"race": "Grippli","trait": "Camouflage","text": "Gripplis receive a +4 racial bonus on Stealth checks in marshes and forested areas."},
{"race": "Grippli","trait": "Swamp Stride (Ex)","text": "A grippli can move through difficult terrain at its normal speed while within a swamp. Magically altered terrain affects a grippli normally."},
{"race": "Grippli","trait": "Weapon Familiarity","text": "Gripplis are proficient with nets."},
{"race": "Grippli","trait": "Languages","text": "Gripplis begin play speaking Common and Grippli. Gripplis with high Intelligence scores can choose from the following: Boggard, Draconic, Elven, Gnome, Goblin, and Sylvan."},
{"race": "Kitsune","trait": "Medium","text": "Kitsune are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Kitsune","trait": "Kitsune","text": "Kitsune are humanoids with the kitsune and shapechanger subtypes."},
{"race": "Kitsune","trait": "Normal Speed","text": "Kitsune have a base speed of 30 feet."},
{"race": "Kitsune","trait": "Low-Light Vision (Ex)","text": "Kitsune can see twice as far as humans in conditions of dim light."},
{"race": "Kitsune","trait": "Change Shape (Su)","text": "A kitsune can assume the appearance of a specific single human form of the same sex. The kitsune always takes this specific form when she uses this ability. A kitsune in human form cannot use her bite attack, but gains a +10 racial bonus on Disguise checks made to appear human. Changing shape is a standard action. This ability otherwise functions as alter self, except that the kitsune does not adjust her ability scores and can remain in this form indefinitely."},
{"race": "Kitsune","trait": "Agile (Ex)","text": "Kitsune receive a +2 racial bonus on Acrobatics checks."},
{"race": "Kitsune","trait": "Kitsune Magic (Ex/Sp)","text": "Kitsune add +1 to the DC of any saving throws against enchantment spells that they cast. Kitsune with a Charisma score of 11 or higher gain the following spell-like ability: 3/day—dancing lights (caster level equals the kitsune's level)."},
{"race": "Kitsune","trait": "Natural Weapons (Ex)","text": "In her natural form, a kitsune has a bite attack that deals 1d4 points of damage."},
{"race": "Kitsune","trait": "Languages","text": "Kitsune begin play speaking Common and Sylvan. Kitsune with high Intelligence scores can choose from the following: any human language, Aklo, Celestial, Elven, Gnome, and Tengu."},
{"race": "Merfolk","trait": "Medium","text": "Merfolk are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Merfolk","trait": "Slow Speed","text": "Merfolk have a base speed of 5 feet. They have a swim speed of 50 feet."},
{"race": "Merfolk","trait": "Aquatic","text": "Merfolk are humanoids with the aquatic subtype."},
{"race": "Merfolk","trait": "Amphibious","text": "Merfolk are amphibious, but prefer not to spend long periods out of the water."},
{"race": "Merfolk","trait": "Low-Light Vision","text": "Merfolk have low-light vision."},
{"race": "Merfolk","trait": "Armor","text": "Merfolk have a +2 natural armor bonus."},
{"race": "Merfolk","trait": "Legless","text": "Merfolk have no legs, and cannot be tripped."},
{"race": "Merfolk","trait": "Languages","text": "Merfolk begin play speaking Common and Aquan. Merfolk with high Intelligence scores can choose from the following: Aboleth, Aklo, Draconic, Elven, and Sylvan."},
{"race": "Nagaji","trait": "Medium","text": "Nagaji are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Nagaji","trait": "Reptilian","text": "Nagaji are humanoids with the reptilian subtype."},
{"race": "Nagaji","trait": "Normal Speed","text": "Nagaji have a base speed of 30 feet."},
{"race": "Nagaji","trait": "Low-Light Vision","text": "Nagaji can see twice as far as humans in conditions of dim light."},
{"race": "Nagaji","trait": "Armored Scales","text": "Nagaji have a +1 natural armor bonus from their scaly flesh."},
{"race": "Nagaji","trait": "Resistant (Ex)","text": "Nagaji receive a +2 racial saving throw bonus against mind-affecting effects and poison."},
{"race": "Nagaji","trait": "Serpent's Sense (Ex)","text": "Nagaji receive a +2 racial bonus on Handle Animal checks against reptiles, and a +2 racial bonus on Perception checks."},
{"race": "Nagaji","trait": "Languages","text": "Nagaji begin play speaking Common and Draconic. Nagaji with high Intelligence scores can choose from the following: any human tongue, Abyssal, Aklo, Celestial, Draconic, Giant, Infernal, and Sylvan."},
{"race": "Samsaran","trait": "Medium","text": "Samsarans are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Samsaran","trait": "Normal Speed","text": "Samsarans have a base speed of 30 feet."},
{"race": "Samsaran","trait": "Low-Light Vision (Ex)","text": "Samsarans can see twice as far as humans in conditions of dim light."},
{"race": "Samsaran","trait": "Lifebound (Ex)","text": "Samsarans gain a +2 racial bonus on all saving throws made to resist death effects, saving throws against negative energy effects, Fortitude saves made to remove negative levels, and Constitution checks made to stabilize if reduced to negative hit points."},
{"race": "Samsaran","trait": "Samsaran Magic (Sp)","text": "Samsarans with a Charisma score of 11 or higher gain the following spell-like abilities: 1/day—comprehend languages, deathwatch, and stabilize. The caster level for these effects is equal to the samsaran's level."},
{"race": "Samsaran","trait": "Shards of the Past (Ex)","text": "A samsaran's past lives grant her bonuses on two particular skills. A samsaran chooses two skills—she gains a +2 racial bonus on both of these skills, and they are treated as class skills regardless of what class she actually takes."},
{"race": "Samsaran","trait": "Languages","text": "Samsarans begin play speaking Common and Samsaran. Samsarans with high Intelligence scores can choose from the following: any human language, Abyssal, Aquan, Auran, Celestial, Draconic, Giant, Ignan, Infernal, Nagaji, Tengu, and Terran."},
{"race": "Strix","trait": "Strix","text": "Strix are humanoids with the strix subtype."},
{"race": "Strix","trait": "Medium","text": "Strix are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Strix","trait": "Normal Speed","text": "Strix have a base speed of 30 feet on land. They also have a fly speed of 60 feet (average)."},
{"race": "Strix","trait": "Low-Light Vision","text": "Strix can see twice as far as humans in conditions of dim light."},
{"race": "Strix","trait": "Darkvision","text": "Strix can see in the dark up to 60 feet."},
{"race": "Strix","trait": "Hatred","text": "Strix receive a +1 racial bonus on attack rolls against humanoid creatures with the human subtype because of their special training against these hated foes."},
{"race": "Strix","trait": "Nocturnal","text": "Strix gain a +2 racial bonus on Perception and Stealth checks in dim light or darkness."},
{"race": "Strix","trait": "Suspicious","text": "Strix receive a +2 racial bonus on saving throws against illusion spells and effects."},
{"race": "Strix","trait": "Languages","text": "Strix begin play speaking Strix. Those with high Intelligence scores can choose from the following: Auran, Common, Draconic, Giant, Gnome, Goblin, Infernal."},
{"race": "Suli","trait": "Native Outsider","text": "Sulis are outsiders with the native subtype."},
{"race": "Suli","trait": "Medium","text": "Sulis are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Suli","trait": "Normal Speed","text": "Sulis have a base speed of 30 feet."},
{"race": "Suli","trait": "Low-Light Vision","text": "Sulis can see twice as far as humans in dim light."},
{"race": "Suli","trait": "Negotiator","text": "Sulis are keen negotiators, and gain a +2 racial bonus on Diplomacy and Sense Motive checks."},
{"race": "Suli","trait": "Elemental Assault (Su)","text": "Once per day as a swift action, a suli can shroud her arms in acid, cold, electricity, or fire. This lasts for one round per level, and can be dismissed as a free action. Unarmed strikes with her arms or hands (or attacks with weapons held in those hands) deal +1d6 points of damage of the appropriate energy type."},
{"race": "Suli","trait": "Energy Resistance 5","text": "Sulis have resistance to acid 5, cold 5, electricity 5, and fire 5."},
{"race": "Suli","trait": "Languages","text": "Sulis begin play speaking Common and one elemental language (Aquan, Auran, Ignan, or Terran). Sulis with high Intelligence scores can choose from the following: Aquan, Auran, Draconic, Ignan, and Terran."},
{"race": "Svirfneblin","trait": "Gnome","text": "Svirfneblin are humanoids with the gnome subtype."},
{"race": "Svirfneblin","trait": "Small","text": "Svirfneblin are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty to their CMB and CMD, and a +4 size bonus on Stealth checks."},
{"race": "Svirfneblin","trait": "Slow Speed","text": "Svirfneblin have a base speed of 20 feet."},
{"race": "Svirfneblin","trait": "Defensive Training","text": "Svirfneblin gain a +2 dodge bonus to Armor Class."},
{"race": "Svirfneblin","trait": "Senses","text": "Svirfneblin have darkvision 120 ft. and low-light vision."},
{"race": "Svirfneblin","trait": "Fortunate","text": "Svirfneblin gain a +2 racial bonus on all saving throws."},
{"race": "Svirfneblin","trait": "Skilled","text": "Svirfneblin gain a +2 racial bonus on Stealth checks; this improves to a +4 bonus underground. They gain a +2 racial bonus on Craft (alchemy) checks and Perception checks."},
{"race": "Svirfneblin","trait": "Hatred","text": "Svirfneblin receive a +1 bonus on attack rolls against humanoid creatures of the reptilian and dwarf subtypes due to training against these hated foes."},
{"race": "Svirfneblin","trait": "Stonecunning","text": "Svirfneblin gain stonecunning as dwarves."},
{"race": "Svirfneblin","trait": "Spell Resistance","text": "Svirfneblin have SR equal to 11 + their class levels."},
{"race": "Svirfneblin","trait": "Svirfneblin Magic","text": "Svirfneblin add +1 to the DC of any illusion spells they cast. Svirfneblin also gain the following spell-like abilities: Constant—nondetection; 1/day—blindness/deafness (DC 12 + Charisma modifier), blur, disguise self; caster level equals the svirfneblin's class levels."},
{"race": "Svirfneblin","trait": "Languages","text": "Svirfneblin begin play speaking Gnome and Undercommon. Those with high Intelligence scores can choose from the following: Aklo, Common, Draconic, Dwarven, Elven, Giant, Goblin, Orc, and Terran."},
{"race": "Vanara","trait": "Vanara","text": "Vanaras are humanoids with the vanara subtype."},
{"race": "Vanara","trait": "Medium","text": "Vanaras are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Vanara","trait": "Normal Speed","text": "Vanaras have a base speed of 30 feet and a Climb speed of 20 feet."},
{"race": "Vanara","trait": "Low-Light Vision","text": "A vanara can see twice as far as a human in dim light."},
{"race": "Vanara","trait": "Nimble","text": "Vanaras have a +2 racial bonus on Acrobatics and Stealth checks."},
{"race": "Vanara","trait": "Prehensile Tail","text": "A vanara has a long, flexible tail that she can use to carry objects. She cannot wield weapons with her tail, but the tail allows her to retrieve a small, stowed object carried on her person as a swift action."},
{"race": "Vanara","trait": "Languages","text": "Vanaras begin play speaking Common and Vanaran. Vanaras with high Intelligence scores can choose from the following: Aklo, Celestial, Elven, Gnome, Goblin, and Sylvan."},
{"race": "Wayang","trait": "Wayang","text": "Wayangs are humanoids with the wayang subtype."},
{"race": "Wayang","trait": "Small","text": "Wayangs are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on their CMB and to CMD, and a +4 size bonus on Stealth checks."},
{"race": "Wayang","trait": "Slow Speed","text": "Wayangs have a base speed of 20 feet."},
{"race": "Wayang","trait": "Darkvision","text": "Wayangs can see in the dark up to 60 feet."},
{"race": "Wayang","trait": "Light and Dark (Su)","text": "Once per day as an immediate action, a wayang can treat positive and negative energy effects as if she were an undead creature, taking damage from positive energy and healing damage from negative energy. This ability lasts for 1 minute once activated."},
{"race": "Wayang","trait": "Lurker","text": "Wayangs gain a +2 racial bonus on Perception and Stealth checks."},
{"race": "Wayang","trait": "Shadow Magic","text": "Wayangs add +1 to the DC of any saving throws against spells of the shadow subschool that they cast. Wayangs with a Charisma score of 11 or higher also gain the following spell-like abilities: 1/day—ghost sound, pass without trace, and ventriloquism. The caster level for these effects is equal to the wayang's level. The DC for these spells is equal to 10 + the spell's level + the wayang's Charisma modifier."},
{"race": "Wayang","trait": "Shadow Resistance","text": "Wayangs get a +2 racial bonus on saving throws against spells of the shadow subschool."},
{"race": "Wayang","trait": "Languages","text": "Wayangs begin play speaking Common and Wayang. Wayangs with high Intelligence scores can choose from the following: any human language, Abyssal, Aklo, Draconic, Goblin, Infernal, Nagaji, Samsaran, and Tengu."},
{"race": "Vishkanya","trait": "Vishkanya","text": "Vishkanyas are humanoids with the vishkanya subtype."},
{"race": "Vishkanya","trait": "Medium","text": "Vishkanyas are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Vishkanya","trait": "Normal Speed","text": "Vishkanyas have a base speed of 30 feet."},
{"race": "Vishkanya","trait": "Low-Light Vision","text": "Vishkanyas can see twice as far as humans in conditions of dim light."},
{"race": "Vishkanya","trait": "Keen Senses","text": "Vishkanyas receive a +2 racial bonus on Perception checks."},
{"race": "Vishkanya","trait": "Limber","text": "Vishkanyas receive a +2 racial bonus on Escape Artist and Stealth checks."},
{"race": "Vishkanya","trait": "Poison Resistance","text": "A vishkanya has a racial bonus on saving throws against poison equal to its Hit Dice."},
{"race": "Vishkanya","trait": "Poison Use","text": "Vishkanyas are skilled in the use of poison and never accidentally poison themselves when using or applying poison."},
{"race": "Vishkanya","trait": "Toxic","text": "A number of times per day equal to his Constitution modifier (minimum 1/day), a vishkanya can envenom a weapon that he wields with his toxic saliva or blood (using blood requires the vishkanya to be injured when he uses this ability). Applying venom in this way is a swift action.\\nVishkanya Venom: Injury; save Fort DC 10 + 1/2 the vishkanya's Hit Dice + the vishkanya's Constitution modifier; frequency 1/round for 6 rounds; effect 1d2 Dex; cure 1 save."},
{"race": "Vishkanya","trait": "Weapon Familiarity","text": "Vishkanyas are always proficient with blowguns, kukri, and shuriken."},
{"race": "Vishkanya","trait": "Languages","text": "Vishkanyas begin play speaking Common and Vishkanya. Vishkanyas with high Intelligence scores can choose from the following: Aklo, Draconic, Elven, Goblin, Sylvan, and Undercommon."},
{"race": "Changeling","trait": "Medium","text": "Changelings are Medium creatures and have no bonuses or penalties due to their size."},
{"race": "Changeling","trait": "Humanoid","text": "Changelings are humanoids with the changeling subtype."},
{"race": "Changeling","trait": "Normal Speed","text": "Changelings have a base speed of 30 feet."},
{"race": "Changeling","trait": "Hag Racial Trait","text": "The changeling inherits one of the following racial traits, depending on her mother's hag type:\\nHulking Changeling (Annis Hag): The changeling gains a +1 racial bonus on melee damage.\\nGreen Widow (Green Hag): The changeling gains a +2 racial bonus on Bluff checks against creatures that are sexually attracted to her.\\nSea Lungs (Sea Hag): The changeling may hold her breath for a number of rounds equal to three times her Constitution before she risks drowning."},
{"race": "Changeling","trait": "Claws","text": "Changelings' fingernails are hard and sharp, granting them two claw attacks (1d4 points of damage each)."},
{"race": "Changeling","trait": "Natural Armor","text": "Changelings have a +1 natural armor bonus."},
{"race": "Changeling","trait": "Darkvision","text": "Changelings can see in the dark up to 60 feet."},
{"race": "Changeling","trait": "Languages","text": "Changelings begin play speaking Common and the primary language of their host society. Changelings with high Intelligence scores can choose from the following: Aklo, Draconic, Dwarven, Elven, Giant, Gnoll, Goblin, and Orc."}
